[{"website": "www.boardwalktech.com", "product_pod": "Google Drive", "company_description": "Boardwalktech is a software company which empowers companies to build and maintain competitive advantage through business process automation in the collaborative planning space.", "logo_vector": "BWT Logo (RGB) 2009.ai", "exhibitors": ["JB Kuppe", "Dharmesh Dadbhawala"], "product_description": "Boardwalktech provides patented technology for Google Spreadsheet which enables access control, slicing of large data sets, interoperability with Excel, and integration with enterprise systems.", "company_name": "Boardwalktech", "logo_img": "BWT Logo 94x94.jpg"}, {"website": "http://www.disney.com", "product_pod": "Chrome", "company_description": "Disney Interactive entertains kids, families and Disney enthusiasts everywhere with world-class products that push the boundaries of technology and imagination. ", "logo_vector": "tbd - will e-mail", "exhibitors": ["Karlene Nguyen", "Tamer Eskander"], "product_description": "Play high-quality HTML5 games on Disney.com in desktop & mobile Chrome browsers! Agent P Strikes Back is a fun, 2-D platformer game that highlights excellent HTML5 performance in Chrome!", "company_name": "Disney", "logo_img": "tbd - will e-mail"}, {"website": "http://goburp.com", "product_pod": "Google Maps", "company_description": "Discover & Rank The Best Places For Your Favorite Dishes.", "logo_vector": "burp", "exhibitors": ["Danny Roa", "Sho Takahashi"], "product_description": "Be it Burger, Ramen or Wings, Find & Share the Best Places To Get Your Favorite Dishes in Your City. ", "company_name": "Burp", "logo_img": "burp"}, {"website": "http://www.playcanvas.com/", "product_pod": "Chrome", "company_description": "PlayCanvas is a provider of browser gaming middleware solutions that make the HTML5 game development and publishing process simple and fun. ", "logo_vector": "playcanvas_logo.psd", "exhibitors": ["Will Eastcott", "Dave Evans"], "product_description": "PlayCanvas Platform is a cloud-hosted, collaborative development environment for interactive 3D web content. Build and publish cutting edge, cross-platform HTML5 games on any device.", "company_name": "PlayCanvas", "logo_img": "playcanvas_logo_94x94.png"}, {"website": "www.ditoweb.com", "product_pod": "Google Drive", "company_description": "Dito is focused on moving organizations to Google’s cloud.  After hundreds of successful deployments, we have gained notoriety for our complete understanding of the platform.", "logo_vector": "dito_logo_cropped_hq.eps", "exhibitors": ["Dan McNelis", "Jason Taylor"], "product_description": "Dito development services include solutions to fill-in those missing gaps. Need deployment or automated workflow solutions? Interested in Google Script? Visit Dito Sandbox today!", "company_name": "DITO", "logo_img": "Dito Company Logo 94 x 94 pixels"}, {"website": "www.playdom.com", "product_pod": "Google+", "company_description": "As part of the Walt Disney Company, Playdom is bringing the tradition of high-quality entertainment, to the rapidly growing world of social games.", "logo_vector": "Playdom_logo_94px.png", "exhibitors": ["Laura Celio", "Xingsheng Qian"], "product_description": "From the epic Super Hero battles of Marvel: Avengers Alliance to the hidden objects in Gardens of Time, Playdom produces casual games for all audiences.", "corrected_sandbox": "Commerce", "company_name": "Playdom", "logo_img": "Playdom_logo_94px.jpg"}, {"website": "www.mobiata.com", "product_pod": "Google TV", "company_description": "Mobiata creates beautiful apps that make travel easier and more fun.  Acquired by Expedia November 2010, we continue to deliver indispensable tools for travelers.", "logo_vector": "MobiataLogo_tag_94px.ai", "exhibitors": ["Joanne Phillips", "Scott Weber"], "product_description": "FlightTrack and FlightBoard are two of the most popular travel apps of all time. Both are designed to help travelers navigate the flight experience painlessly.", "company_name": "Mobiata", "logo_img": "MobiataLogo_tag_94px.png"}, {"website": "http://halfbrick.com/", "product_pod": "Chrome", "company_description": "With the success of Fruit Ninja Halfbrick has catapulted to become one of the most well known indie developers in the world.", "logo_vector": "Halfbrick Logo", "exhibitors": ["Jason Harwood", "Kim Forrest"], "product_description": "Band Stars:\nForm a band. Hit the studio. Start recording. Fame and fortune awaits in this awesome new game presented by Halfbrick, makers of Fruit Ninja and Jetpack Joyride.\n\n\nJetpack Joyride:\nSuit up with a selection of the coolest jetpacks ever made and take to the skies as Barry Steakfries, the lovable hero on a one-way trip to adventure!", "company_name": "Halfbrick Studios", "logo_img": "Halfbrick Image"}, {"website": "www.testdroid.com", "product_pod": "Android", "company_description": "Testdroid is an automated testing solution for Android applications enabling use case based fully automated testing. Create tests once and run on any Android device.", "logo_vector": "Testdroid_Logo.pdf", "exhibitors": ["Jouko Kaasila", "Sakari Rautiainen"], "product_description": "Testdroid Cloud is an online service with over 100 real Android devices for fully automated device compatibility testing of Android applications. ", "company_name": "Testdroid", "logo_img": "Testdroid_Logo.png"}, {"website": "http://www.coreonline.com", "product_pod": "Chrome", "company_description": "The Square Enix Group, and its subsidiary Hapti.co, is committed to bringing console quality gaming to the browser utilizing our group’s best-selling IP as well as producing new and innovative social games.", "logo_vector": "squareenixvector", "exhibitors": ["Mads Wibroe", "Martin Jensen"], "product_description": "\"Lara Croft and the Guardian of Light\" is an award winning title in the world renowned TOMB RAIDER ® franchise.", "company_name": "Square Enix", "logo_img": "squareeniximg"}, {"website": "http://www.jetbrains.com", "product_pod": "Android", "company_description": "JetBrains is a software development company that's crazy-passionate about developer productivity. Our tools automate your routine tasks and help you effectively solve the challenging ones.", "logo_vector": "JetBrainsDevelop_94.eps", "exhibitors": ["Nikolay Chashnikov", "Eugene Kudelevsky"], "product_description": "IntelliJ IDEA is a powerful and productivity-focused Java IDE fully supporting Android application development, and technologies such as Google App Engine, Google Chrome and GWT.", "company_name": "JetBrains", "logo_img": "JetBrainsDevelop_94.png"}, {"website": "www.crittercism.com", "product_pod": "Android", "company_description": "Crittercism is a cross platform crash reporting and mobile APM product that offers a real-time global view of app diagnostics. ", "logo_vector": "Crittercism Logo EPS.eps", "exhibitors": ["Andrew Yousef", "Jennifer Moranz"], "product_description": "Crittercism’s real-time dashboard allows developers to track app loads, crash reports, handled exceptions and breadcrumbs to fix the most important bugs. ", "company_name": "Crittercism", "logo_img": "Crittercism Logo 94x94.png"}, {"website": "www.folia.dk", "product_pod": "Google Maps", "company_description": "Folia is an IT company who specialize in Google Maps solutions - Standard solutions and customized solutions for different industries. Folia is Google Maps Partner.", "logo_vector": "Folia_logo_cmyk.eps", "exhibitors": ["Rasmus Steenberg Andersen", "Jesper Nyholm Jensen"], "product_description": "Indoor WiFi based positioning, search, mapping and routing in large buildings with dynamic floor plans eg. malls, universities, hospitals, exhibitions and many more.", "company_name": "Folia a/s", "logo_img": "Folia_logo2011_94x94.jpg"}, {"website": "zynga.com", "product_pod": "Commerce", "company_description": "Zynga Inc. (NASDAQ: ZNGA) is the world's leading provider of social game services with more than 240 million monthly active users playing its games.", "logo_vector": "zynga-horizontal-print.zip", "exhibitors": ["Parth Parekh", "Alexander Shoykhet"], "product_description": "Zynga games, which include CityVille, Draw Something, and Words With Friends are available on a number of platforms, including Facebook, Zynga.com, Google+, iOS and Android.", "company_name": "Zynga, Inc", "logo_img": "zynga-horizontal-on-screen.zip"}, {"website": "www.iheartradio.com", "product_pod": "Google TV", "company_description": "iHeartRadio is an all-in-one personalized digital listening experience that lets you listen to radio's top Live Stations or create your own Custom Stations.", "logo_vector": "iheartradio", "exhibitors": ["Ken Colton", "Mike Biondo"], "product_description": "iHeartRadio for Google TV brings a visually optimized all-in-one audio experience to the living room.", "company_name": "iHeartRadio", "logo_img": "iheartradio94"}, {"website": "kineticbytes.com/home/", "product_pod": "Android", "company_description": "At Kinetic Bytes we are dedicated to creating fun, addictive and entertaining mobile applications with the main focus on games for various mobile platforms.", "logo_vector": "kblogo2.svg", "exhibitors": ["Udayan Kale", "N/A"], "product_description": "Pool Break is a suite of games featuring Pool, Snooker, Carrom and Crokinole with spectacular 3D graphics, smooth action, accurate physics and online gameplay.", "corrected_sandbox": "Google TV", "company_name": "Kinetic Bytes", "logo_img": "kblogo2.png"}, {"website": "html.adobe.com", "product_pod": "Chrome", "company_description": "Adobe is changing the world through digital experiences.  We help creative professionals, publishers, developers, and businesses create, publish, promote, and monetize their content anywhere.", "logo_vector": "adobe_logo_standard_ai.ai", "exhibitors": ["Andrew Shorten", "Deepa Subramaniam"], "product_description": "With Adobe Creative Cloud membership get any Adobe Creative Suite 6 tool or Adobe Touch App to create anything you can imagine.", "company_name": "Adobe", "logo_img": "adobe_logo_standard_jpg.jpg"}, {"website": "http://www.zazzle.com", "product_pod": "Commerce", "company_description": "Zazzle is the leading platform for custom products.  Our proprietary technology is redefining commerce by enabling the instant creation of products by customers worldwide.", "logo_vector": "Zazzle_Standard_CMYK.AI", "exhibitors": ["Jan Borgersen", "Ed Caggiani"], "product_description": "Zazzle features one of the world’s largest product marketplaces.  Created by a global community of designers, we’re the place where ideas and trends meet products.", "company_name": "Zazzle", "logo_img": "Zazzle_Stacked_94x94.png"}, {"website": "www.smartsheet.com", "product_pod": "Google Drive", "company_description": "Smartsheet.com, a privately held SaaS company, offers an enterprise-ready cloud app for project management and collaboration. Trusted by more than 15,000 subscribing organizations.", "logo_vector": "smartsheet-logo-navy.ai", "exhibitors": ["Kyan Skeem", "John Creason"], "product_description": "Smartsheet’s cloud worksheets are ideal for collaborating on projects and tasks. Like a spreadsheet, but smarter with Gantt charts, file sharing, Google Drive, mobile.", "company_name": "Smartsheet", "logo_img": "smartsheet-logo-navy.png"}, {"website": "www.squrl.com", "product_pod": "YouTube", "company_description": "Squrl is working to make video discovery simple. \n", "logo_vector": "there are several they all will have Squrl in the title", "exhibitors": ["Steven Gemmen", "Martin Gentry"], "product_description": "Squrl is the best place to watch and discover video on your mobile devices.  ", "company_name": "Squrl", "logo_img": "there are several they all will have Squrl in the title"}, {"website": "www.csc.com/cloud", "product_pod": "App Engine", "company_description": "CSC Cloud Services enable business agility and lower operating costs. Remove your IT barriers to innovation. Gain the CSC Trusted Cloud advantage.", "logo_vector": "csc", "exhibitors": ["Christopher Knepper", "Jeremy Burdette"], "product_description": "CSC's global Google Implementation Services provide our clients with proven and robust services to improve operational efficiency, leveraging the full potential of the Google platform.", "company_name": "CSC", "logo_img": "csc.jpg"}, {"website": "http://newmedia.sonydadc.com", "product_pod": "YouTube", "company_description": "Sony DADC New Media Solutions, a division of Sony Corporation, is a pioneering provider of creative services and end-to-end digital supply chain solutions to the media and entertainment industries. In 2009 a new division named LOOT™ was created to develop games, virtual goods and applications for PlayStation®Home, the PlayStation®3 social gaming network. ", "logo_vector": "SonyDADC_LOOT_94x94_GoogleIO_2012.pdf", "exhibitors": ["Danilo Moura de Mello e Silva", "David Sterling"], "product_description": "LOOT™ created machinima tools to provide PlayStation®3 owners, via PlayStation®Home, the opportunity to shout lights, camera and action! Users can collaborate with friends to bring their own movies and television shows to life. PlayStation®Home offers high definition avatars, customizable locations and movie props to help create virtually any story! The LOOT™ Active Camera records video directly to the PS3™ XMB™ and YouTube™.", "company_name": "LOOT, a Sony DADC New Media Solutions company", "logo_img": "SonyDADC_LOOT_94x94_GoogleIO_2012.png"}, {"website": "www.sony.com", "product_pod": "Google TV", "company_description": "Sony Electronics, Inc. designs and manufactures audio/video products, gaming systems, mobile communications devices, computers, components and entertainment services for the consumer and professional electronics markets.", "logo_vector": "Sony Make.Believe 94x94.ai", "exhibitors": ["Shigeki Nakamura", "Tonni Larsen "], "product_description": "Sony’s NSZ-GS7, Internet Player and NSZ-GP9, Blu-ray Disc Player both with Google TV allow users to seamlessly watch TV, enjoy apps, and browse the Internet.", "company_name": "Sony Electronics Inc.", "logo_img": "Sony Make.Believe 94x94-02.jpg"}, {"website": "www.kleientertainment.com", "product_pod": "Chrome", "company_description": "Klei is an independent game development studio, proudly creating original products since 2005. We are best known for creating the titles Eets and Shank. ", "logo_vector": "klei_logo.png", "exhibitors": ["Alia McCutcheon", "Kevin Forbes"], "product_description": "Wilson is trapped in a mysterious wilderness. Gather, hunt, build, and above all: Don't Starve.", "company_name": "Klei Entertainment Inc.", "logo_img": "klei_logo_94x94.png"}, {"website": "http://ubilabs.net", "product_pod": "Google Maps", "company_description": "Ubilabs is a new media company and an official Geo Enterprise Partner specialized in consulting, customization and the integration of Google Maps.", "logo_vector": "ubilabs.ai", "exhibitors": ["Michael Pletziger", "Martin Kleppe"], "product_description": "How to get the most value out of your map? Ubilabs shows you new ideas, beautiful apps and helpful tools for your next geo-related project.", "company_name": "Ubilabs", "logo_img": "ubilabs_small_square.png"}, {"website": "http://www.ciandt.com", "product_pod": "Cloud Platform / App Engine", "company_description": "Ci&T's high-performance teams employ agile methodologies to deliver innovative, value-generating projects for companies of all sizes by leveraging the latest mobile, cloud and web technologies.", "logo_vector": "cit-logo.ai", "exhibitors": ["Daniel Vieira Viveiros", "Marcio Cyrillo"], "product_description": "Web and mobile (Android) health insurance applications for Sulamerica/ING (brazilian insurance company) using technologies like Google App Engine, Fusion Tables and Google Maps.", "company_name": "Ci&T", "logo_img": "cit-logo.jpg"}, {"website": "www.claritics.com", "product_pod": "Cloud Platform / App Engine", "company_description": "Claritics is the leading User Intelligence platform that provides actionable analytics to help measure and improve user acquisition, engagement and monetization campaigns for social, mobile and online application developers. ", "logo_vector": "claritics", "exhibitors": ["SANDEEP MANDADA", "RUCHEE MEHTA"], "product_description": "The Claritics Analytics Suite drives actionability using outcome based analytic apps like Cohort Analysis, Funnels and Campaign Analytics.", "company_name": "Claritics", "logo_img": "claritics"}, {"website": "lge.com", "product_pod": "Google TV", "company_description": "The LG Electronics Home Entertainment Company is a global top player in televisions, monitors, commercial displays, audio video systems, personal computers and security systems. The company constantly pushes technological boundaries to create feature-rich devices with stylish designs that meet global consumer needs. LG's consumer products include CINEMA 3D Smart TVs, OLED TVs, IPS monitors, home theater systems, Blu-ray Disc™ players, mouse scanners and external storage devices. LG’s commercial products include digital signage, video conferencing systems and IP security cameras", "logo_vector": "LG_c_hor_tag", "exhibitors": ["Hyung Jin Kim", "Samuel Lee"], "product_description": "LG Smart TV with Google TV delivers the easiest user interface, boundless content, and superior performance with LG’s L9 dual-core chipset\n", "company_name": "LG Electronics", "logo_img": "LG Logo_94x94"}, {"website": "www.Qello.com", "product_pod": "Google TV", "company_description": "Qello is a music entertainment company that streams HD-quality content to millions of users across all new media devices using its proprietary streaming platform.", "logo_vector": "Qello Vector", "exhibitors": ["Matthew P Carona", "Richard Johnson"], "product_description": "Qello brings the concert to you - wherever you are, whenever you want it. Qello delivers the ultimate music experience in crystal clear High Definition.", "company_name": "Qello", "logo_img": "Qello 94x"}, {"website": "www.storsimple.com", "product_pod": "App Engine", "company_description": "StorSimple is the only company that delivers an enterprise cloud storage appliance certified by both Microsoft and VMware that helps connect enterprise applications to Google-Cloud-Storage.", "logo_vector": "StorSimpleLogo.jpg", "exhibitors": ["Burzin Patel", "Badri Venkatachari"], "product_description": "The StorSimple appliance delivers automatically tiered primary storage, cloud-archival, cloud data protection and cloud disaster-recovery in one box, helping reduce storage infrastructure costs by 60-80%.", "company_name": "StorSimple", "logo_img": "StorSimpleLogo.jpg"}, {"website": "http://www.youpd.org", "product_pod": "Cloud Platform / App Engine", "company_description": "YouPD.org is a facilitated network of K12 educators with a passion for sharing, learning, and problem-solving to integrate next-generation tools and practices in the domain of teaching and learning.  YouPD members share narrated screencast or video solutions to problems of practice, called \"hacks,\" participate in evening meetups, called \"blenders,\" and join forces in extended learning and problem-solving communities via \"challenges.\"  YouPD.org is an initiative of New Visions for Public Schools, a non-profit organization providing comprehensive school support services to 78 NYC high schools and over 34,000 students.", "logo_vector": "youpd_svg", "exhibitors": ["Andrew Stillman", "David Rothauser"], "product_description": "Building off the agile, homegrown Google Spreadsheet and Forms-driven workflows and reporting dashboards developed by very-high-performing urban HS principal Mark Dunetz, YouPD's tinkerer-educators have created a suite of several powerful Apps Scripts and shared systems templates that make this highly flexible approach scalable and adaptable by other schools.  The autoCrat and formMule scripts, available in the Scripts Gallery, are building blocks in what may become a powerful, free, school data system erector set with the help of our four 2012 Google Summer of Code interns!", "corrected_sandbox": "Google Drive", "company_name": "YouPD.org / New Visions for Public Schools", "logo_img": "youpd_94x94"}, {"website": "http://www.klokantech.com/", "product_pod": "Google Maps", "company_description": "Klokan Technologies helps developers bring scanned maps and raster geodata to their web applications and mobile devices with the MapTiler, GDAL2Tiles and Georeferencer software.", "logo_vector": "klokantech.pdf", "exhibitors": ["Vaclav Klusak", "Petr Pridal"], "product_description": "OldMapsOnline.org is an easy-to-use gateway to historical maps in libraries around the world, powered by a unique geographical search technology called the MapRank Search.", "company_name": "Klokan Technologies", "logo_img": "klokantech94.png"}, {"website": "www.orangescape.com", "product_pod": "Cloud Platform / App Engine", "company_description": "Global top 10 platform-as-a-service (PaaS) company widely featured by Gartner & Forrester.  Used by global brands like Unilever, Pfizer, CitiBank, AstraZeneca, United Biscuits, IndiaInfoline, Sterlite", "logo_vector": "OrangeScape", "exhibitors": ["Mani Doraisamy", "Dinesh Varadharajan"], "product_description": "*Visual PaaS– Application platform-as-a-service (aPaaS) for building comprehensive enterprise class business applications\n*KiSSFlow– Business process platform-as-a-service (bPaaS) for Google Apps customers for creating Do-IT-Yourself workflows", "company_name": "OrangeScape Inc", "logo_img": "OrangeScape logo"}, {"website": "www.hipmunk.com", "product_pod": "Google Maps", "company_description": "Hipmunk is a site bringing the fun back to travel by taking the agony out of hotel and flight search.", "logo_vector": "hipmunk-ontopoflogo.ai", "exhibitors": ["Steve Huffman", "Julie Zhou"], "product_description": "Ecstasy-filled hotel search plotting results on a map with unique heatmap options; Agony-free flight search displaying results in a visual timeline with tradeoffs at-a-glance.", "company_name": "Hipmunk", "logo_img": "hipmunk-ontopoflogo-sm.jpg"}, {"website": "www.thuuz.com", "product_pod": "Google TV", "company_description": "Thuuz is a mobile and connected TV service revolutionizing how consumers discover and connect to sports programming. ", "logo_vector": "thuuz-logo-on-square.eps", "exhibitors": ["Brandon Fields", "Jordan Toor"], "product_description": "Thuuz Sports alerts you to the most exciting sporting events as they're happening, so you never miss the action. ", "company_name": "Thuuz Inc", "logo_img": "Thuuz-logo-94x94.jpg"}, {"website": "www.unrealengine.com", "product_pod": "Android", "company_description": "Epic Games, Inc., based in Cary, NC and established in 1991, develops cutting-edge games and cross-platform game engine technology.  ", "logo_vector": "epic_UE3_final_logo", "exhibitors": ["Joe Kreiner", "Paul Oliver"], "product_description": "Developed by Epic Games, the award-winning Unreal Engine is known for its cutting-edge graphics, best-of-breed tools and scalability across multiple platforms.", "company_name": "Epic Games", "logo_img": "UE3blackbackground94x94"}, {"website": "www.dramafever.com", "product_pod": "Google TV", "company_description": "DramaFever brings you the best TV shows from around the world for your enjoyment on demand with subtitles.", "logo_vector": "df_logo_vector.ai", "exhibitors": ["Romanos Fessas", "Sung Choi"], "product_description": "With DramaFever's Google TV app, you can enjoy over 8,000 hours of the most popular Korean dramas and TV shows with English subtitles.", "company_name": "DramaFever, Inc.", "logo_img": "df_logo_94.png"}, {"website": "do.com & desk.com   ", "product_pod": "Google Drive", "company_description": "Do and Desk.com by Salesforce are leading providers of cloud-based productivity and customer support software for small and medium-sized enterprises", "logo_vector": "Desk.com sfdc co-branded logo.eps", "exhibitors": ["Gopal Patel", "Matt Walker"], "product_description": "Do makes it easy to get work done with anyone from anywhere you are. Desk.com helps companies deliver awesomely responsive customer support.\n\n", "company_name": "Do and Desk.com by Salesforce", "logo_img": "Desk.com sfdc co-branded logo.png"}, {"website": "www.cloudlock.com", "product_pod": "Google Drive", "company_description": "CloudLock enables companies to extend their data security practices to the cloud. The world’s largest Google Apps customers trust CloudLock to secure their data", "logo_vector": "cloudLock-logo-horizontal-vector.eps", "exhibitors": ["Dan Lines", "Tom Davis"], "product_description": "CloudLock protects data stored in Google Drive (Docs), Sites and Google+ by providing enterprise-class, Data Loss Prevention, auditing, compliance, and data management", "corrected_sandbox": "Cloud Platform", "company_name": "CloudLock", "logo_img": "cloudLock-logo-94.png"}, {"website": "www.Ericom.com", "product_pod": "Chrome", "company_description": "Ericom provides Application Access and Virtualization solutions, including native and HTML5-based RDP clients for accessing Centrally/Cloud-hosted Windows applications and virtual/physical desktops — from anywhere, any device", "logo_vector": "EricomSoftware.ai  and EricomSoftware.eps", "exhibitors": ["Eran Heyman", "James Lui"], "product_description": "Ericom AccessNow extends the access reach of Chromebooks and any HTML5-compatible browser/device to hosted Windows desktops & applications - without installing anything on the user’s device ", "company_name": "Ericom Software Inc.", "logo_img": "ericomSoftware.jpg  and ericomSoftwareHi.jpg"}, {"website": "http://worldmap.harvard.edu", "product_pod": "Google Maps", "company_description": "The Center for Geographic Analysis (CGA) at Harvard was established in 2006 to support research and teaching of all disciplines across the University with emerging geospatial technologies.", "logo_vector": "cga_3d.eps", "exhibitors": ["Ben Lewis", "Matt Bertrand"], "product_description": "The WorldMap platform is being developed at Harvard to lower barriers for scholars who wish to explore, visualize, edit, collaborate with, and publish geospatial information. ", "company_name": "The Center for Geographic Analysis at Harvard University", "logo_img": "cga_3d.png"}, {"website": "www.nivio.com", "product_pod": "Google Drive", "company_description": "nivio is a global start-up, headquartered in Palo Alto with offices in London and Delhi.  Leading the way in desktop cloud services to any device.", "logo_vector": "nivio logo", "exhibitors": ["Barry Russell", "Andrew Radin"], "product_description": "nivio provides current Windows, SaaS app market and synchonized file storage from the cloud to Android, Chromebook, Mac, iOS and tablet devices.  ", "company_name": "nivio Corp.", "logo_img": "nivio logo.jpg"}, {"website": "www.moviecom.tv", "product_pod": "YouTube", "company_description": "Moviecom.tv is an online video platform for business. Crowned Global 100 Red Herring Winners 2011. Currently based in the UK, expanding into US with 3000+business sign ups. ", "logo_vector": "moviecomtv vector", "exhibitors": ["Gillian O'Neil", "Kev O'Neil"], "product_description": "Moviecom.tv the world's simple and easy to use platform, where businesses can set up a customisable video site in minutes, record, centralise & share all their video content. ", "company_name": "Moviecom.tv", "logo_img": "moviecomtv vector small.pdf"}, {"website": "www.lucidpress.com", "product_pod": "Chrome", "company_description": "Lucid builds next generation HTML5 collaborative web applications such as Lucidchart, a leading diagramming application with powerful functionality and a UX better than desktop software.", "logo_vector": "lucidpress_logo.ai", "exhibitors": ["Karl Sun", "Brian Pugh"], "product_description": "Lucidpress is the first web-based application for designing and arranging images, text, graphics, videos and more.  Features include custom fonts, text linking and effects, and real-time collaboration. ", "company_name": "Lucid Software Inc.", "logo_img": "lucidpress_logo.png"}, {"website": "webfilings.com", "product_pod": "Cloud Platform / App Engine", "company_description": "WebFilings has revolutionized the financial reporting process via cloud computing and a collaborative platform that integrates and streamlines the process of creating and filing regulatory reports.", "logo_vector": "WebFilings_logotm_RGB.eps", "exhibitors": ["Kenneth Mai", "Shane Sizer"], "product_description": "The WebFilings SEC Reporting Solution leverages the power of Google App Engine to help companies reduce the time, risk and cost associated with financial and regulatory reporting.", "company_name": "WebFilings", "logo_img": "WebFilings_logotm_RGB_94x94.png"}, {"website": "www.shoppa.us", "product_pod": "Commerce", "company_description": "Mobtapp, the creators of Shoppa, is an independent Bay Area collective delivering useful and compelling everyday Android apps for the masses. ", "logo_vector": "mobtappLogo_google.ai", "exhibitors": ["Sean Green", "Jennifer Green"], "product_description": "Utilizing the Google Shopping API, Shoppa simplifies mobile shopping by presenting extensive results internationally from trusted shops online creating a true one-stop shopping experience.", "company_name": "Mobtapp", "logo_img": "mobtappLogo_94x94.jpg"}, {"website": "www.elasticpath.com", "product_pod": "Cloud Platform / App Engine", "company_description": "Elastic Path is the leader in digital commerce technology and expertise for enterprises selling digital goods and services. ", "logo_vector": "elastic_path_logo_vector.eps", "exhibitors": ["Eddie Chan", "Michael Taylor"], "product_description": "The Google Earth online store is powered by the Elastic Path ecommerce platform, which has been migrated to Google App Engine and Google Cloud SQL.", "company_name": "Elastic Path Software", "logo_img": "elastic_path_logo_94x94.jpg"}, {"website": "www.envista.com", "product_pod": "Google Maps", "company_description": "Envista is a cloud-based platform developed on Earth Builder that integrates geo-located and business data to coordinate business processes and solve business problems. ", "logo_vector": "Envista Logo Vector.eps", "exhibitors": ["Marc Fagan", "Mike Walsh"], "product_description": "Envista Services Suite is a cloud application toolset that aggregates geo-located and business data to enable activities such as collaboration, notification, workflows, and business logic.", "company_name": "Envista", "logo_img": "Envista Logo Image.jpg"}, {"website": "www.peel.com", "product_pod": "Google TV", "company_description": "Peel is revolutionizing the way you watch TV. The groundbreaking Peel app combines personalized program discovery, remote control, and social sharing across multiple content sources.", "logo_vector": "Peel Logo Vector.ai", "exhibitors": ["Scott Ellis", "Philip Poulidis"], "product_description": "Peel launches multi-source TV convergence.  The Peel app now helps you find and watch shows on live TV, your DirecTV DVR, and Netflix through GoogleTV.", "company_name": "Peel Technologies, Inc.", "logo_img": "Peel-Logo-94x94.png"}, {"website": "http://www.spryfox.com", "product_pod": "Chrome", "company_description": "Spry Fox is a developer of original games; our titles include Steambirds, Panda Poet, Triple Town, and Realm of the Mad God.", "logo_vector": "SpryFox - Logo - Vector.ai", "exhibitors": ["David Edery", "Jason Coleman"], "product_description": "Sparrow is an original, multiplayer roleplaying game created entirely in HTML5.", "company_name": "Spry Fox", "logo_img": "SpryFox_logo.png"}, {"website": "www.twinstrata.com", "product_pod": "Cloud Platform / App Engine", "company_description": "TwinStrata, an innovator in cloud-based data storage solutions, offers enterprise-class gateway products that make Google Cloud Storage fast, safe and easy to use. ", "logo_vector": "TwinStrata_logo.eps", "exhibitors": ["Nicos Vekiarides", "John Bates"], "product_description": "CloudArray iSCSI software/hardware appliances enable unlimited cloud storage that is secure, fast and simple to use without the costs and administration of traditional storage.", "company_name": "TwinStrata", "logo_img": "TwinStrata_logo-small.jpg"}, {"website": "http://tethr.org", "product_pod": "Chrome", "company_description": "Tethr builds a tiny box that lets you get on the net from anywhere in the world, no matter what's going on around you.", "logo_vector": "TethrTropo.eps", "exhibitors": ["Aaron Huslage", "Tim Panton"], "product_description": "Tethr is a network-in-a-box, providing voice, SMS, Wi-Fi, 3G/4G data, and satellite connectivity. Tethr connects with Tropo's cloud communications services via WebRTC-enabled browsers for on-the-ground coordination of crisis response.", "company_name": "Tethr.", "logo_img": "TethrTropo94x94.png"}, {"website": "www.trulia.com", "product_pod": "Google Maps", "company_description": "Trulia gives home buyers, sellers, owners and renters the inside scoop on properties, places and real estate professionals.", "logo_vector": "trulia_logo_201205.eps", "exhibitors": ["Jeff McConathy", "Talin Salway"], "product_description": "Trulia is leading innovation delivering unique interactive map visualizations showcasing neighborhood info, school ratings/boundaries, crime data and more across web, mobile and tablet apps.", "company_name": "Trulia, Inc.", "logo_img": "trulia_logo_94x94_201205.jpg"}, {"website": "www.telestream.net", "product_pod": "YouTube", "company_description": "Telestream provides live and on-demand digital video tools and workflow solutions that allow consumers and businesses to transform video on the desktop and across the enterprise.", "logo_vector": "telestream_logo.eps", "exhibitors": ["Eric Norrell", "Christine Porter"], "product_description": "With Wirecast you can stream professional-looking live broadcasts from anywhere with just a camera, computer and Internet connection. With Episode you can easily batch encode and deploy videos to YouTube.", "company_name": "Telestream", "logo_img": "Telestream_logo_image.jpg"}, {"website": "revision3.com", "product_pod": "Android", "company_description": "Revision3 is the leading online video network offering original content including tech, gaming, entertainment, science and more on web, mobile and over-the-top devices.", "logo_vector": "revision3-logo.eps", "exhibitors": ["Evan Hourigan", "Rob Demillo"], "product_description": "Use the Revision3 App to stream your favorite shows in HD-quality anytime, anywhere on all Android devices and Google TV.", "corrected_sandbox": "Google TV", "company_name": "Revision3", "logo_img": "revision3-logo_94x94.jpg"}, {"website": "www.pulse.me", "product_pod": "Android", "company_description": "Pulse is the world's leading application for reading news on mobile devices. ", "logo_vector": "pulse-color.eps", "exhibitors": ["Lili Dworkin", "Justin Peterman"], "product_description": "Pulse brings all your news together in one beautiful mobile interface. Exciting to use, quick to read, ready to share.\u2028", "corrected_sandbox": "Cloud Platform", "company_name": "Pulse", "logo_img": "pulse-color.png"}, {"website": "http://unity3d.com/", "product_pod": "Android", "company_description": "Unity Technologies is revolutionizing the game industry with Unity, its breakthrough development platform for creating games and interactive 3D across industries and platforms.", "logo_vector": "Unity Logo", "exhibitors": ["Randy Spong", "Tracy Erickson"], "product_description": "Unity is a multiplatform engine and development toolset designed to provide cutting edge visuals and a highly efficient production cycle for development studios of all sizes.", "company_name": "Unity Technologies", "logo_img": "Unity Logo"}, {"website": "Atlas", "product_pod": "Google Maps", "company_description": "concept3D Inc. is a leading geoweb software and services firm offering its simple map management platform Atlas and interactive services for top clients world wide.", "logo_vector": "NEW c3d_vector.eps", "exhibitors": ["Matthew Brown", "Oliver Davis"], "product_description": "Atlas map manager combines interactive media - including 3D and custom Streetview - along with geo data into a simple mapping toolkit.", "company_name": "concept3D Inc.", "logo_img": "NEW c3d_vector.eps"}, {"website": "AndEngine", "product_pod": "Android", "company_description": "AndEngine is a free open source 2D game engine for the Google Android platform written entirely in Java.", "logo_vector": "andengine_logo.svg", "exhibitors": ["Nicolas Gramlich", "Oren Bengigi"], "product_description": "AndEngine GLES2 is the recent port of AndEngine to OpenGL ES 2.0. ", "company_name": "AndEngine", "logo_img": "andengine_logo_94x94.png"}, {"website": "vidcaster.com", "product_pod": "YouTube", "company_description": "VidCaster is a video site creation platform which seamlessly combines multiple video players and platforms into a simple, cohesive experience for viewers and content owners.", "logo_vector": "vidcaster-vector", "exhibitors": ["Kieran Farr", "Thinh Ngo"], "product_description": "\"VidCaster Free powered by YouTube\" is a SaaS product empowering YouTube users to instantly create stand-alone video sites for their YouTube videos.", "company_name": "VidCaster", "logo_img": "vidcaster-image"}, {"website": "www.siriusxm.com", "product_pod": "Google TV", "company_description": "SiriusXM Radio delivers commercial-free music, sports, news, talk,\ncomedy, Latin programming plus traffic, weather, data services on over\n800 devices for vehicles, homes, and smartphones. SiriusXM has\narrangements with every major automaker and is available at retail and\nonline throughout the US.", "logo_vector": "siriusxm.eps", "exhibitors": ["Sean Gibbons", "Dave Horoschak"], "product_description": "Listen to what you want, when you want – with over 140 channels of great SiriusXM programming now on your Google TV. \n ", "company_name": "SiriusXM Radio, inc", "logo_img": "siriusxm.jpg"}, {"website": "www.wevideo.com", "product_pod": "Google Drive", "company_description": "WeVideo redefines video editing by leveraging the strength of the cloud for easy, full-featured, collaborative HD video editing across Google Drive, Chromebooks and Android devices.", "logo_vector": "WeVideo_Logo_CMYK.ai", "exhibitors": ["John Canning", "Krishna Menon "], "product_description": "WeVideo redefines video editing by leveraging the strength of the cloud for easy, full-featured, collaborative HD video editing across Google Drive, Chromebooks and Android devices.", "corrected_sandbox": "YouTube", "company_name": "WeVideo", "logo_img": "wevideo_Logo94x94.png"}, {"website": "www.desmos.com", "product_pod": "Google Drive", "company_description": "At Desmos, we've set out to re-imagine the graphing calculator from the ground up, building on the best technologies available.", "logo_vector": "desmos_delta.ai", "exhibitors": ["Eli Luberoff", "Jason Merrill"], "product_description": "The Desmos Graphing Calculator is a powerful visual math engine. Graph multiple functions, save your work to the cloud, and share everything with friends.", "company_name": "Desmos, Inc.", "logo_img": "desmos_delta.png"}, {"website": "www.getaround.com", "product_pod": "Cloud Platform / App Engine", "company_description": "Getaround empowers people everywhere to safely share cars by the hour, day, or week through a secure online marketplace. ", "logo_vector": "getaround_vector.eps", "exhibitors": ["Matas Vidutis", "Ishmael Riles"], "product_description": "Getaround connects car owners with potential renters through their web and mobile applications. Sharing is facilitated through a proprietary CarKit Technology.", "company_name": "Getaround", "logo_img": "getaround_image.jpeg"}, {"website": "http://plexapp.com", "product_pod": "Google TV", "company_description": "Plex Inc. is dedicated to providing the best solution for organizing and accessing video, music and photos whether they are online, local user-generated, paid, free, stored in the cloud, or at home.  Plex is currently available for Windows, OS X, Linux, iOS, Android, Windows Phone 7, LG TVs, Samsung TVs, Google TVs, Rokus and via DLNA.", "logo_vector": "plex_vector.zip", "exhibitors": ["Darrin Edelman", "Schulyer Ullman"], "product_description": "Plex for Google TV is a Plex client capable of accessing the full contents of you Plex Media Server so that you can easy get to your videos, music and photos without needing to move files around.  It also provides support for Plex Channels and myPlex allowing you to access on line content as well as your queue and anything shared to you by friends and family.", "company_name": "Plex Inc", "logo_img": "plex_logo_94x94.png"}, {"website": "http://www.picotube.tv", "product_pod": "YouTube", "company_description": "Vettl Inc. develops PicoTube, a place for enjoying online video party with your friends in real time. The winner of TechCrunch Tokyo 2011.", "logo_vector": "logo_vettl.ai", "exhibitors": ["Hidetaka Yamashita", "Kazuyuki Mori"], "product_description": "PicoTube is an online social service where you can enjoy real-time video parties with your friends.\n\nUsers with similar tastes can gather in a virtual room called a Pod and share their favorite YouTube video and music. PicoTube takes a place on a colony somewhere in the space. Aliens from various planets hang out there with fun video and music.It brings a live excitement that you've never experienced with other video and music services.\n\nJoin and host a video party anytime you feel like.", "company_name": "Vettl Inc.", "logo_img": "logo_vettl.png"}, {"website": "Business.me", "product_pod": "YouTube", "company_description": "Business.me is an online destination to discover and share videos about business.", "logo_vector": "businessme_logo.pdf", "exhibitors": ["Prashant Nadarajan", "Oscar Moreno"], "product_description": "Business.me provides editor curated videos on business topics, personalized video recommendations based on a user's professional interests and connections and the ability for users to share those videos within a community of business users.", "company_name": "Business.me", "logo_img": "businessme_logo.jpg"}, {"website": "www.GetMoai.com", "product_pod": "Android", "company_description": "Zipline Games creates mobile games and the Moai platform. Zipline’s first title, Wolf Toss, has over 2 million players on Android, Chrome, and iOS.", "logo_vector": "Moai_Logo.ai", "exhibitors": ["Todd Hooper", "Patrick Meehan"], "product_description": "Moai helps game developers build better games, faster, and get them into the hands of more players via major modern app stores (Android, Chrome, iOS).", "company_name": "Zipline Games", "logo_img": "Moai_Logo_94.png"}, {"website": "www.skimble.com", "product_pod": "YouTube", "company_description": "Skimble powers the mobile health revolution with dynamic expert-led coaching applications.  Skimble's latest title, Workout Trainer, delivers best-in-class multimedia workout experiences for everyone.", "logo_vector": "workout-trainer-by-skimble-logo.eps", "exhibitors": ["Maria Ly", "Gabriel Vanrenen"], "product_description": "Workout Trainer provides multimedia-rich workouts led by expert personal trainers.  Download Workout Trainer -- a top free Health & Fitness Android application -- today!", "company_name": "Skimble", "logo_img": "workout-trainer-by-skimble-logo-94x94.png"}, {"website": "Pixorial.com", "product_pod": "Google Drive", "company_description": "Pixorial is a video storytelling platform that makes it easy to collect, create and share videos old and new...directly from Google Drive!", "logo_vector": "pixorial_logo_vector", "exhibitors": ["John Martyniak", "Justin Van Dyke"], "product_description": "With Pixorial, anyone can upload, create and share video moments vintage and new and sync entire video libraries with Google Drive and across multiple platforms.", "company_name": "Pixorial Inc.", "logo_img": "Pixorial_noplaylogo_128x128"}, {"website": "http://ardrone2.parrot.com/", "product_pod": "YouTube", "company_description": "Parrot, a global leader in wireless devices for mobile phones, stands on the cutting edge of innovation.The company has developed the most extensive range of hands-free systems on the market for cars. Additionally, Parrot designs and markets an exclusive ‘Parrot by’ range, consisting of a prestigious line of high-end wireless multimedia products.", "logo_vector": "parrot-logo-94x94.ai", "exhibitors": ["Pierre Bureau", "Michael Pastor"], "product_description": "Discover and pilot the Parrot AR.Drone 2.0 using FreeFlight app for your smartphone. Fly your Drone, record aerial video, and share them on YouTube seamlessly.", "company_name": "Parrot ", "logo_img": "parrot-logo-94x94.png"}, {"website": "http://graphicly.com", "product_pod": "Chrome", "company_description": "Graphicly provides publishers the simplest and most cost-effective digital content conversion and distribution, across every marketplace imaginable, with comprehensive actionable insights on reader behavior.", "logo_vector": "graphicly_vector", "exhibitors": ["Zach Graves", "Mark Rebec"], "product_description": "Utilizing cutting edge technology, Graphicly allows publishers a single point upload via a web based dashboard which enables conversion, distribution and key analytics management.", "corrected_sandbox": "Commerce", "company_name": "Graphicly", "logo_img": "graphicly_logo"}, {"website": "movl.com", "product_pod": "Google TV", "company_description": "MOVL is driving innovation in the social TV app revolution by creating connectivity between smart-phones, tablets and smart TVs through its MOVL Connect™ Platform. ", "logo_vector": "MOVL", "exhibitors": ["Summer Paul", "Juan Pablo Gnecco"], "product_description": "KontrolTV, powered by the MOVL Connect Platform, makes content easier  for users to discover, interact and control on multiple SmartTV platforms. ", "company_name": "MOVL ", "logo_img": "MOVL "}, {"website": "www.immersion.com", "product_pod": "Android", "company_description": "Immersion’s OEM and developer software creates engaging haptic effects, aka “touch feedback”. Our tools make integrating haptics throughout mobile UIs and apps fast and easy.", "logo_vector": "IMMRvector", "exhibitors": ["Bob Heubel", "Steve Kingsley-Jones"], "product_description": "Haptic SDK is free haptic integration and design tool for 3rd party app developers.  TouchSense and Integrator allow handset OEMs to create quality haptics experiences.", "company_name": "Immersion", "logo_img": "IMMR94"}, {"website": "vizio.com", "product_pod": "Google TV", "company_description": "VIZIO, Inc., headquartered in Irvine, California, is America’s HDTV and Consumer Electronics Company. In 2007, VIZIO skyrocketed to the top by becoming the #1 selling brand of flat panel HDTVs in North America and became the first American brand in over a decade to lead in U.S. TV sales. ", "logo_vector": "VIZIO Logo", "exhibitors": ["James Kittle", "Alfonso Pintor"], "product_description": "The VIZIO Co-Star™ Stream Player decks out your existing HDTV with apps, full-screen Web browsing and the best in streaming entertainment, turning any HDTV into the ultimate smart TV.", "company_name": "VIZIO", "logo_img": "VIZIO Image"}, {"website": "khanacademy.org", "product_pod": "Cloud Platform / App Engine", "company_description": "Watch. Practice. Learn almost anything for free.", "logo_vector": "KHA_Logo_v6.pdf", "exhibitors": ["Jason Rosoff", "Chris Klaiber"], "product_description": "With over 3,200 videos on everything from arithmetic to physics, finance, and history and hundreds of skills to practice, we're on a mission to help you learn what you want, when you want, at your own pace.", "company_name": "Khan Academy", "logo_img": "khan.png"}, {"website": "www.airbnb.com", "product_pod": "Google Maps", "company_description": "Airbnb connects people to unique travel experiences, at any price point, in more than 19,000 cities and 192 countries.", "logo_vector": "airbnb_blue_final.eps", "exhibitors": ["Tobi Knaup", "Naseem Hakim"], "product_description": "Airbnb is a trusted community marketplace for people to list, discover, and book unique accommodations around the world – online or from a mobile phone.", "company_name": "Airbnb", "logo_img": "airbnb_94x94.jpg"}, {"website": "www.yoyogames.com", "product_pod": "Android", "company_description": "YoYo Games is a top publisher of mobile, Facebook, and web-based games and the creator of GameMaker, the world’s fastest and easiest to use cross-platform games development tool. ", "logo_vector": "YoYo Games Logo Vector", "exhibitors": ["Russell Kay", "Malcolm Collins"], "product_description": "GameMaker: Studio enables developers to create and publish games from a single source and run them natively in HTML5, Apple iOS, Google’s Android, Symbian as well as the existing platforms, Mac OSX and Windows. \n\n", "company_name": "YoYo Games", "logo_img": "YoYo Games Logo Vector Large"}, {"website": "http://benetech.org", "product_pod": "Chrome", "company_description": "Benetech is a 501c(3) nonprofit that creates technological solutions to address large global social needs in literacy, human rights and the environment.", "logo_vector": "BenetechLogoCMYK.eps", "exhibitors": ["Martin Quiazon", "Paul Anderson"], "product_description": "Bookshare WebReader is a Chrome Web App based on the open source Readium project targeted at users with vision and learning disabilities, such as dyslexia.", "corrected_sandbox": "Accessibility", "company_name": "Benetech", "logo_img": "benetechlogo.png"}, {"website": "www.supergiantgames.com", "product_pod": "Commerce", "company_description": "Supergiant Games is a small developer with big ambitions: to make games that spark your imagination like the games you played as a kid.", "logo_vector": "SupergiantGames_LogoForGoogle.psd", "exhibitors": ["Michael Ailshie", "Andrew Wang"], "product_description": "Bastion is an original action role-playing game set in a lush imaginative world, in which players must create and fight for civilization’s last refuge.", "company_name": "Supergiant Games", "logo_img": "Supergiant_LogoForGoogle94x94.png"}, {"website": "http://www.realmofthemadgod.com", "product_pod": "Cloud Platform / App Engine", "company_description": "Wild Shadow Studios is a small independent game company started in\n2008 with the goal of making innovative games.  After experimenting\nwith various prototypes, our first game, a Flash-based MMO called\nRealm of the Mad God, went into public beta in 2010 and was officially\nreleased in 2011.  It has strong and growing player base all over the\nworld and received a nomination for Technical Excellence from the\nIndependent Games Festival.  We continue to improve RotMG with new\nreleases on a (mostly) monthly basis.", "logo_vector": "WS_mark", "exhibitors": ["Willem Rosenthal", "Steven Chin"], "product_description": "Realm of the Mad God is the world's first co-op fantasy MMO shooter.", "corrected_sandbox": "Commerce", "company_name": "Wild Shadow Studios", "logo_img": "WS_mark"}, {"website": "www.podio.com", "product_pod": "Google Drive", "company_description": "Podio is a collaborative work platform for project management and online collaboration that allows anyone to build apps to support how they work. ", "logo_vector": "logo-podio-blue-CMYK.eps", "exhibitors": ["Daniel Pouzemski", "Kenneth Auchenberg"], "product_description": "Podio's work platform allows sharing of files from your Google Drive and the creation of tasks from a Gmail Contextual Gadget.", "company_name": "Podio", "logo_img": "PodioLogo.png"}, {"website": "bimeanalytics.com", "product_pod": "Cloud Platform / App Engine", "company_description": "BIME provides Cloud Business Intelligence. As one of the first launch partners of BigQuery, BIME enables businesses to do real-time visual analysis of Big Data.", "logo_vector": "Bime", "exhibitors": ["Nicolas Raspal", "Rachel Delacour"], "product_description": "BIME provides a full suite of interactive analysis tools and dashboards directly in the browser. It offers built-in integration with Google Services including BigQuery, GSpreadsheet, Google Analytics.", "company_name": "BIME", "logo_img": "Bime"}, {"website": "www.codefactory.es", "product_pod": "Android", "company_description": "Code Factory is a company leader in development of products designed to eliminate existing barriers in mobile technology for blind and visually impaired users.", "logo_vector": "logoCF_2lineas_color.ai / .eps", "exhibitors": ["Ferran Gállego", "Yolanda Reyes"], "product_description": "Mobile Accessibility is a screen-access application which allows blind or low vision people to use an Android phone in a simple way.", "corrected_sandbox": "Accessibility", "company_name": "Code Factory S.L.", "logo_img": "logoCF_2lineas_color_low.png"}, {"website": "www.nbp.org", "product_pod": "Android", "company_description": "National Braille Press is a nonprofit braille publisher that promotes braille literacy for blind children and provides information-access for blind people of all ages. ", "logo_vector": "NBP logo_color.eps", "exhibitors": ["Brian Mac Donald", "Bryan Blazie"], "product_description": "The B2G is an affordable Android based braille tablet for the blind with phone/data capability, GPS, bluetooth, wifi, and a camera for OCR/apps.", "corrected_sandbox": "Accessibility", "company_name": "National Braille Press", "logo_img": "NBP logo_color.jpg"}, {"website": "http://komodoopenlab.com/tecla/tecla-for-android", "product_pod": "Android", "company_description": "Komodo and the IDRC work together developing open and inclusive technologies that facilitate the daily lives of people with disabilities and also benefit everybody else.", "logo_vector": "komodo-idrc-logo.svg", "exhibitors": ["Jorge Silva", "Mauricio Meza"], "product_description": "Tecla is a set of open software and hardware tools that facilitate switch access to electronic devices for people with mobility impairments.", "corrected_sandbox": "Accessibility", "company_name": "Komodo OpenLab & the Inclusive Design Research Centre", "logo_img": "komodo-idrc-logo.png"}, {"website": "www.autodesk.com", "product_pod": "Chrome", "company_description": "Autodesk, Inc., is a leader in 3D design, engineering and entertainment software. Customers across the manufacturing, architecture, building, construction, and media and entertainment industries—including the last 17 Academy Award winners for Best Visual Effects—use Autodesk software to design, visualize, and simulate their ideas before they’re ever built or created. From blockbuster visual effects and buildings that create their own energy to electric cars and the batteries that power them, the work of our 3D software customers is everywhere you look.", "logo_vector": "Autodesk_logo.zip", "exhibitors": ["Christian Pramuk", "Randy Young"], "product_description": "Autodesk 123D Catch - Transform photos of your favorite people, places and things into amazingly detailed 3D models using the power of the cloud. \n\nAutodesk 123D Make - Automatically transform 3D models into cut patterns and animated assembly instructions for making artful creations.\n\nAutodesk 360 - Autodesk 360 is a cloud-based platform that gives you access to storage, a collaboration workspace, and cloud services to help you dramatically improve the way you design, visualize, simulate, and share your work with others anytime, anywhere.", "company_name": "Autodesk", "logo_img": "Autodesk_logo_image"}, {"website": "http://www.glu.com/", "product_pod": "Commerce", "company_description": "Glu Mobile is a leading global developer and publisher of freemium games for smartphone and tablet devices on a wide range of platforms. ", "logo_vector": "glu_logo_for_white-lightBG.ai", "exhibitors": ["Scott Kepnach", "Jason Enriquez"], "product_description": "Glu Mobile is a Top Developer of freemium games on Google Play, Google+, and the Chrome Web Store. ", "company_name": "Glu Mobile", "logo_img": "glu_logo_on_white.jpg"}, {"website": "www.funzio.com", "product_pod": "Android", "company_description": "Funzio leads in creating advanced and successful social games for Facebook, Google+, and mobile, that are fun to play with friends. Our vision is to invent a future where people can play immersive games together whenever and wherever they are.", "logo_vector": "funzio_logo.svg", "exhibitors": ["Ricky Shum", "Marc Pirrone"], "product_description": "Rise through the ranks of the mafia and take over the city! Build up your hood, do jobs, and fight other players! Play Crime City on Android!", "corrected_sandbox": "Commerce", "company_name": "GREE/Funzio", "logo_img": "funzio_logo.png"}, {"website": "Flipboard", "product_pod": "YouTube", "company_description": "Inspired by the beauty and ease of print media, Flipboard’s mission is to fundamentally improve how people discover, view and share content.", "logo_vector": "Flipboard logo.ai", "exhibitors": ["Jason Culverhouse", "David Creemer"], "product_description": "Named one of TIME's Top 50 Innovations, Flipboard creates a personalized magazine out of everything being shared with you.", "company_name": "Flipboard", "logo_img": "Flipboard-94.png"}, {"website": "www.sencha.com", "product_pod": "Chrome", "company_description": "Sencha empowers developers to create amazing cross-browser applications. Built on web standards, we offer HTML5-based frameworks tailored for both desktop and mobile experiences; design tools; and the industry’s first cloud services for mobile application developers.", "logo_vector": "Sencha-Logo-Final.eps", "exhibitors": ["Aditya Bansod", "Michael Mullany"], "product_description": "Sencha Touch 2, a high-performance HTML5 mobile application framework, is the cornerstone of the Sencha HTML5 platform. Built for enabling world-class user experiences, Sencha Touch 2 is the only framework that enables developers to build fast and impressive apps that work on iOS, Android, BlackBerry, Kindle Fire, and more.", "company_name": "Sencha", "logo_img": "Sencha-Avatar-94.png"}, {"website": "kabam.com", "product_pod": "Google+", "company_description": "Kabam is the leader in F2P hardcore social games on web and mobile devices, with franchises including Kingdoms of Camelot and The Godfather: Five Families \n", "logo_vector": "Kabam_Logo_White_BG.ai", "exhibitors": ["Bryan Schwab", "Denny Wu"], "product_description": "Dragons of Atlantis", "corrected_sandbox": "Commerce", "company_name": "Kabam", "logo_img": "Kabam_Logo.jpg"}, {"website": "http://www.KendoUI.com", "product_pod": "Chrome", "company_description": "Kendo UI by Telerik builds and supports professional tools for HTML5 and JavaScript that maximize developer productivity.", "logo_vector": "Kendo_Logo_vector.eps", "exhibitors": ["Todd Anglin", "Brandon Satrom"], "product_description": "Kendo UI provides everything developers need to build sites and mobile apps with HTML and JavaScript, including UI widgets, data viz, and mobile tools.", "company_name": "Kendo UI", "logo_img": "Kendo_Logo_square_small.png"}, {"website": "https://github.com/attdevsupport/ARO", "product_pod": "Android", "company_description": "Application Resource Optimizer (ARO) is an open source product on github that was developed and supported by the AT&T developer program.", "logo_vector": "to be sent separately", "exhibitors": ["Lisa Burks", "Lucinda Raap"], "product_description": "Application Resource Optimizer (ARO) is a diagnostic tool for analyzing mobile web application performance. ARO allows you to automatically profile an application to optimize performance, make battery utilization more efficient, and reduce network impact.", "company_name": "Application Resource Optimizer (ARO)", "logo_img": "to be sent separately"}, {"website": "http://www.primerlabs.com", "product_pod": "YouTube", "company_description": "Primer Labs makes games to make all knowledge playable and Code Hero teaches how to code games so you can make games that teach everything else.", "logo_vector": "Code Hero Logo.ai", "exhibitors": ["Alex Peake", "Antonio Gussenhoven"], "product_description": "Code Hero is a game that teaches people how to code games with a code ray that shoots Javascript in Unity 3D. Code Hero provides a Unity Youtube Uploader.", "company_name": "Primer Labs: Code Hero", "logo_img": "Code Hero Logo 94px.png"}, {"website": "http://www.mercent.com", "product_pod": "Commerce", "company_description": "Mercent is a leading provider of online marketing technology and services for retailers.", "logo_vector": "mercent_vector.eps", "exhibitors": ["Cory Nielsen", "Matt Marston"], "product_description": "Mercent’s on-demand platform, Mercent Retail, is the foundation of an integrated online marketing solution that helps retailers market and sell through multiple ecommerce channels.", "company_name": "Mercent Corporation", "logo_img": "mercent_logo.png"}, {"website": "www.zynga.com", "product_pod": "Google TV", "company_description": "Zynga Inc. (NASDAQ: ZNGA) is the world's leading provider of social game services with more than 290 million monthly active users playing its games, which include CityVille, FarmVille, Words With Friends, Scramble With Friends, CastleVille, Hidden Chronicles, Zynga Poker, Empires & Allies, Indiana Jones™ Adventure World, The Pioneer Trail, Mafia Wars and Café World. Zynga's games are available on a number of global platforms, including Facebook, Zynga.com, Google+, Tencent, Apple iOS and Google Android. Through Zynga.org, Zynga players have raised more than $10 million for world social causes. Zynga is headquartered in San Francisco, Calif.", "logo_vector": "zynga.psd", "exhibitors": ["Laura Dansingani", "Aditya Kashyap"], "product_description": "Zynga Poker, Facebook’s #1 Texas Hold’em Poker Game, is available for your Android phone, tablet and Google TV.  Play live against other Zynga Poker players and experience Las Vegas casino style poker across Facebook and Android devices.  ", "company_name": "Zynga", "logo_img": "zynga.psd"}, {"website": "http://www.balsamiq.com", "product_pod": "Google Drive", "company_description": "Balsamiq is a small group of passionate individuals who believe work should be fun and that life's too short for bad software.", "logo_vector": "balsamiq-logo.eps", "exhibitors": ["Kyle Dinh", "Valerie Liberty"], "product_description": "Balsamiq Mockups is a rapid wireframing tool that reproduces the experience of sketching interfaces on a whiteboard, but using your computer, so they’re easier to share, modify, and get honest feedback on. Mockups look like sketches, so stakeholders won’t get distracted by little details, and can focus on what’s important instead.", "company_name": "Balsamiq", "logo_img": "balsamiq-logo.png"}, {"website": "www.cloudsherpas.com", "product_pod": "Cloud Platform / App Engine", "company_description": "Cloud Sherpas provides a broad range of services around the Google Apps and Salesforce platforms from migrations to custom application development.", "logo_vector": "cloud_sherpas_logo.eps", "exhibitors": ["Shel Davis", "Jonathan Parrott"], "product_description": "Cloud Sherpas specializes in custom application development on the Google Apps ", "company_name": "Cloud Sherpas", "logo_img": "sherpas-94x94.png"}, {"website": "http://software.intel.com/en-us/android/", "product_pod": "Android", "company_description": "Use the same from MWC 2012.  I can supply if you don't have it.", "logo_vector": "intel_rgb_62.ai", "exhibitors": ["Jackson Marusarz", "Mark Janes"], "product_description": "Intel supports Android Eco-system – Come check out Intel® Graphics Performance Analyzers, Intel® VTune™ Amplifier profiler for performance and power efficiency, plus faster Android x86 Emulation.", "company_name": "Intel Corporation", "logo_img": "intel_rbg_3000.png"}, {"website": "http://www.hipmunk.com", "product_pod": "Android", "company_description": "Hipmunk is a site bringing the fun back to travel by taking the agony out of hotel and flight search.", "logo_vector": "hipmunk-ontopoflogo.ai", "exhibitors": ["Ryan Oldenburg", "Danilo Campos"], "product_description": "Ecstasy-filled hotel search plotting results on a map with unique heatmap options; Agony-free flight search displaying results in a visual timeline with tradeoffs at-a-glance.", "company_name": "Hipmunk", "logo_img": "hipmunk-ontopoflogo-sm.jpg"}, {"website": "cloud.tv", "product_pod": "Android", "company_description": "We make fun apps for Android =)", "logo_vector": "cloudtv logo.ai", "exhibitors": ["Michael Christoff", "Radley Marx"], "product_description": "HD Widgets and Cloudskipper Music Player make it fun and easy to personalize your device & find the best music for the moment.", "company_name": "cloud.tv", "logo_img": "cloudtvlogo-100x100.png"}, {"website": "http://www.hellofax.com", "product_pod": "Google Drive", "company_description": "HelloFax is helping to build the paperless office by being the best way to fax or sign a document online. HelloFax is eliminating the need for printers, scanners, fax machines, PDF editors and complicated electronic signature technology.", "logo_vector": "logo vector.psd", "exhibitors": ["Paul Denya", "Ben Dezile"], "product_description": "HelloFax is the best way to fax or sign a document online. By integrating with Google Drive, HelloFax allows users to fax documents and sign documents from their Google Drive. ", "company_name": "HelloFax", "logo_img": "hellofax-logo-94x94.png"}, {"website": "http://pinterest.com", "product_pod": "Android", "company_description": "Pinterest is a Virtual Pinboard.", "logo_vector": "Pinterest_Logo.eps", "exhibitors": ["Carl Rice", "Cynthia Maxwell"], "product_description": "Pinterest lets you organize and share all the beautiful things you find on the web. Now available for Android.", "company_name": "Pinterest, Inc", "logo_img": "Pinterest_Favicon.png"}, {"website": "www.expedia.com", "product_pod": "Android", "company_description": "Expedia Inc. is the largest online travel agency in the world. Our mission is to revolutionize travel through the power of technology.", "logo_vector": "Expedia_Logo_psd", "exhibitors": ["Brennan Taylor", "Chris Arvin"], "product_description": "Get real-time hotel searches, easy filtering, gorgeous graphics, and super-simple booking — all with the Expedia Hotels app. Booking the perfect hotel has never been easier.", "company_name": "Expedia.com", "logo_img": "Expedia_Logo_jpg"}, {"website": "www.c9.io", "product_pod": "Chrome", "company_description": "Cloud9 IDE is a leading cloud-based Integrated Development Environment (IDE) enabling web and mobile developers to work together and collaborate in remote teams anywhere, anytime.", "logo_vector": "Cloud9 Logo vector - CMYK.ai", "exhibitors": ["Lieke Arends ", "Matt Pardee"], "product_description": "Cloud9 IDE is the first open-source and cloud-based IDE supporting JavaScript, HTML5, CSS and Node.js by offering extensive tooling and 3rd-party integrations.", "company_name": "Cloud9 IDE ", "logo_img": "C9 Logo in Color - square layout.jpg"}, {"website": "getpocket.com", "product_pod": "Android", "company_description": "Based in San Francisco, Pocket was founded in 2007 to help save what you find online and view it on any device, at any time.", "logo_vector": "Pocket-Vector.eps", "exhibitors": ["Max Weiner", "Nate Weiner"], "product_description": "Pocket lets you save anything you find on the web to view later, on any device, at any time.", "company_name": "Pocket", "logo_img": "Pocket-94x94.png"}, {"website": "http://mobilebits.de", "product_pod": "Android", "company_description": "MobileBits is an independent game developer for all AppStore platforms with our own cross-platform technology called Delta Engine (see http://deltaengine.net)", "logo_vector": "mobilebits.EPS", "exhibitors": ["Karsten Wysk", "Boje Holtz"], "product_description": "SoulCraft is a console quality free2play Action RPG, please see http://SoulCraftGame.com", "company_name": "MobileBits GmbH", "logo_img": "MobileBits_94.png"}, {"website": "http://www.onavo.com/", "product_pod": "Android", "company_description": "Onavo makes award-winning mobile apps that make it easy for millions of smartphone users to get the most out of their mobile data.", "logo_vector": "OnavoLogo-GIO.ai", "exhibitors": ["Ze'ev Rosenstein", "Ori Peleg"], "product_description": "Onavo Extend stretches your data plan by up to 5X, avoiding overages, roaming fees and throttling - without changing the way you use your Android phone.", "company_name": "Onavo", "logo_img": "OnavoLogo-GIO.png"}, {"website": "www.arm.com", "product_pod": "Android", "company_description": "to come on Monday", "logo_vector": "ARM_Corp_CMYK.eps", "exhibitors": ["Andrew N. Sloss", "Mark Bellamy"], "product_description": "to come on Monday", "company_name": "ARM", "logo_img": "ARM_Corp_RGB.jpg"}, {"website": "www.Mavenlink.com", "product_pod": "Google Drive", "company_description": "Mavenlink is the online workplace for the project workforce.  Our SaaS platform enables service providers and their clients to efficiently manage projects from start to finish.", "logo_vector": "ML_logo-vector.psd", "exhibitors": ["Sean Crafts", "Roger Neel"], "product_description": "Mavenlink provides a comprehensive online workplace which includes project management, collaboration, file sharing, time & expense tracking, invoicing and online payments. ", "company_name": "Mavenlink", "logo_img": "ML logo 94x94"}, {"website": "http://www.ti.com/", "product_pod": "Android", "company_description": "Texas Instruments semiconductor innovations help 90,000 customers unlock the possibilities of the world as it could be – smarter, safer, greener, healthier and more fun.", "logo_vector": "ti_stk_2c_pos_spot_all.zip", "exhibitors": ["Kevin McCray", "Tyler Luu"], "product_description": "TI’s smart multicore OMAP platform delivers high processing performance at ultra-low power  for mobile devices as well as automotive, enterprise and robotics applications.", "company_name": "Texas Instruments", "logo_img": "ti_stk_2c_pos_spot_all.zip"}, {"website": "http://www.getpebble.com", "product_pod": "Android", "company_description": "Pebble Technology creates customizable connected devices, like the Pebble smartwatch (which sold over 85,000 pre-orders on Kickstarter in just 1 month).", "logo_vector": "Pebble-Logo-v0.5.svg", "exhibitors": ["Matt Zulak", "Adam Stroud"], "product_description": "Pebble is a customizable watch. Developers can write apps for Pebble (watchfaces, sports/fitness trackers, games or more!) or send notifications and alerts from other Android apps. ", "company_name": "Pebble", "logo_img": "Pebble-Logo-v0.5_94x94.png"}, {"website": "http://www.hyperdevbox.com", "product_pod": "Android", "company_description": "HyperDevbox is a game studio based in Tokyo. Developer of Spectral Souls Android, we make high quality games on latest high-end smart phones and tablets.", "logo_vector": "Hyperdevbox_Logo.ai", "exhibitors": ["Carlo Perconti", "Ugo Ricard"], "product_description": "The next generation of mobile gaming is here. ExZeus 2, sequel of the acclaimed 3D shooting game “ExZeus” is landing on your Android. Prepare to battle!", "company_name": "HyperDevbox", "logo_img": "Hyperdevbox_Logo.png"}, {"website": "http://www.sumo.fm", "product_pod": "Chrome", "company_description": "Sumoing Ltd wants to make image creation more social and fun. We are developing services that enables anybody to create, publish and share images.", "logo_vector": "sumofm-man-whitebg.ai", "exhibitors": ["Lauri Koutaniemi", "Anton Gauffin"], "product_description": "Tune photos, create drawings or browse and remix images from others in Sumo.Fm - it's a fun way to discover and share inspiration!", "company_name": "Sumoing Ltd", "logo_img": "sumofm-man-whitebg.png"}, {"website": "www.nvidia.com", "product_pod": "Android", "company_description": "NVIDIA is the leading force powering visual, parallel and mobile computing. Its Tegra processors are at the heart of smartphones, tablets and auto infotainment systems.", "logo_vector": "NVIDIA", "exhibitors": ["Sridhar Ramaswamy", "Bojan Skaljak"], "product_description": "NVIDIA, which has deep experience collaborating with developers, is accelerating native Android development with powerful tools, such as Nsight Tegra for Microsoft’s Visual Studio.", "company_name": "NVIDIA", "logo_img": "NVIDIA.ppt"}, {"website": "www.tapestry-app.com", "product_pod": "Android", "company_description": "Ekata Systems builds applications that make “social” more personal and engaging.  We aim to facilitate real-life, serendipitous, hyper-local connections over a mobile proximity-based P2P network.", "logo_vector": "tapestry_logo_vector", "exhibitors": ["Arun Venkataraman", "Jeff Bayer"], "product_description": "Tapestry is a synchronized slideshow application that is an elegant way to share your photos, securely and privately, with people who are physically around you.", "company_name": "Ekata Systems, Inc.", "logo_img": "tapestry_logo_img"}, {"website": "www.geoeye.com", "product_pod": "Google Maps", "company_description": "GeoEye is a leading source of geospatial information and delivers Earth Imagery, Geospatial Expertise, and Enabling Technology for decision makers to understand our changing world", "logo_vector": "GeoEyeLogo+Tag_2c_CMYK.eps", "exhibitors": ["Alistair Miller", "Adam Simmons"], "product_description": "Premium imagery for Google Maps Engine, providing users on-demand access to the most up-to-date imagery available", "company_name": "GeoEye", "logo_img": "GeoEye_logo94x94.png"}, {"website": "www.tinyco.com", "product_pod": "Android", "company_description": "TinyCo makes beautiful, fun and engaging games for mobile devices. Our mission is to make millions of people happy five minutes at a time.\n", "logo_vector": "tinyco_logotype.ai", "exhibitors": ["Sean Maher", "Alex Schlessinger"], "product_description": "Tiny Monsters: Hatch, raise, and breed mysterious elemental creatures.", "company_name": "TinyCo", "logo_img": "tinyco_logotype-1.jpg"}, {"website": "funf.org", "product_pod": "Android", "company_description": "Phones have the potential to know us better than we know ourselves. Our mission is to help developers, users, and researchers tap into these insights.", "logo_vector": "funf_logo.ai", "exhibitors": ["Cody Sumter", "Alan Gardner"], "product_description": "The Funf open-source mobile-sensing framework enables the development of apps with grassroots collection, dissemination, and sense-making of rich data about individuals, communities, and their environment.", "company_name": "Funf: Open Mobile Sensing", "logo_img": "funf_96_by_96.png"}, {"website": "http://www.ted.com", "product_pod": "Android", "company_description": "TED is a nonprofit devoted to Ideas Worth Spreading. We believe passionately in the power of ideas to change attitudes, lives and ultimately, the world. So we're building a platform that offers knowledge and inspiration from the world's most inspired thinkers, and also a community of curious souls to engage with ideas and each other.", "logo_vector": "ted_logo.eps", "exhibitors": ["Thaniya Keereepart", "Kelly Merrell"], "product_description": "TED's official Android app presents talks from some of the world's most fascinating people: education radicals, geniuses, medical mavericks, business gurus, and music legends. Find more than 1,000 TEDTalk videos (with more added each week) on the official TED Android app. ", "company_name": "TED", "logo_img": "ted_94x94.png"}, {"website": "ea.com", "product_pod": "Android", "company_description": "EA, a global leader in digital interactive entertainment delivers games/services for consoles, computers, mobile phones/tablets and social networks with over 220 million registered players.\n", "logo_vector": "EAlogo", "exhibitors": ["Vanessa Auerswald", "David Franzi"], "product_description": "MASS EFFECT™ INFILTRATOR From the makers of the critically acclaimed Dead Space on Android comes an all-new, original Mass Effect storyline – made exclusively for mobile! ", "company_name": "Electronic Arts", "logo_img": "EAlogo"}, {"website": "http://www.square-enix.com/jp/mobile/", "product_pod": "Android", "company_description": "Square Enix provides high-quality services and products to customers, bringing them amazing and unforgettable experiences, and enabling them to discover a happiness all their own.", "logo_vector": "SQEXlogo.ai", "exhibitors": ["Kazuhiko Yamaguchi", "Keisuke Hata"], "product_description": "FINAL FANTASY III: When the land is robbed of light, four youths chosen by the crystals must embark on a journey to save the world.", "company_name": "SQUARE ENIX CO., LTD.", "logo_img": "SQEXlogo94-94.psd"}, {"website": "http://www.inis.jp", "product_pod": "Android", "company_description": "iNiS is an independent entertainment software and technology company specializing in high-end digital interactive experiences on multiple platforms including console, mobile and PC.  \n", "logo_vector": "iNiS_Logo.eps", "exhibitors": ["Keiichi Yano", "Andy Tsai"], "product_description": "The machines have invaded Eden!\nAnd now it’s PAYBACK time!!  \n\nRise against the MACHINES and restore Eden to its once beautiful vistas!\n\nGet ready to launch an all-out counter-attack of nature against the machines that have taken over in this unique 'tower-offense' game.\n\nAnd it’s all FREE!\n\nAs featured in Tegra Zone.", "company_name": "iNiS", "logo_img": "iNiS_Logo.png"}, {"website": "TourWrist.com", "product_pod": "Android", "company_description": "TourWrist is a pano industry leader, empowering consumers to easily shoot, discover and share 360-degree experience via smartphones, tablets and computers.", "logo_vector": "TourWrist-Logo.pdf", "exhibitors": ["Charles Armstrong", "Eric Campbell"], "product_description": "The TourWrist app allows you to quickly record 360-degree moments in time from a smartphone or tablet — and then share them anywhere.", "company_name": "TourWrist", "logo_img": "TourWrist-Flower.png"}]
