{"map":[],"speakers":[{"name":"Kevin Galligan","bio":"Kevin is the President of Touch Lab, NYC's premiere Android development shop. &nbsp;He started coding at age 7, and has been professionally coding for over 15 years. &nbsp;Kevin's Android experience started before the G1 was released.<br /><br />Touch Lab runs the big NYC Android developer group, and is involved in various tech community activities.<br /><br />In his off time, Kevin plays in a hard rock band that virtually none of you would be interested in.&nbsp;","company":null,"plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1355785/avatar.jpg.75x75px.jpg","id":"9921e2c3-d7e3-43ba-8ed1-04017f54203b"},{"name":"Kevin Grant","bio":"Kevin Grant is an Android Engineer at tumblr, a creative blogging platform in New York City, where he focuses on application design, implementing the latest design and user interaction paradigms and pushing the boundaries of the Android framework.&nbsp;<br /><br />He began developing for Android in 2009, performing research at the University of Nevada, Reno. After graduating he moved to Malm&ouml;, Sweden where he took part in the Scandinavian startup scene.","company":"Tumblr","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1356579/avatar.jpg.75x75px.jpg","id":"6631c7a7-a133-4f4b-97eb-cc7e0fdf51c8"},{"name":"Chris Haseman","bio":null,"company":"Tumblr","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1381596/avatar.jpg.75x75px.jpg","id":"a5782e47-2c30-4504-9d29-3fa9ac93cfed"},{"name":"Barry Burd","bio":"Since 1980, Dr. Burd has been a professor in the Department of Mathematics and Computer Science at Drew University in Madison, New Jersey. He has lectured at conferences in the United States, Europe, Australia, and Asia. He is the author of several articles and books, including Java For Dummies, Android Application Development All-in-One For Dummies, and Java Programming for Android Developers For Dummies, all from Wiley Publishing, Inc.","company":"Drew University","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1355793/avatar.jpg.75x75px.jpg","id":"cf464b05-d552-45ed-a223-d86b5d0ab0e0"},{"name":"Roman Nurik","bio":"<br />Roman Nurik is a Design Advocate at Google, focusing on user experience and visual design for Android. Previously, Roman was a developer advocate on Android and Maps. Before Google, he engaged in web design and development work on a variety of independent projects.","company":"Google","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1366978/avatar.jpg.75x75px.jpg","id":"5cd0dac0-bb44-420d-bcf2-d46c41ef0091"},{"name":"Omer Strulovich","bio":null,"company":null,"plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1375298/avatar.jpg.75x75px.jpg","id":"190853ec-bc33-4bef-ac67-2a605d86abfb"},{"name":"Conrad Wade","bio":"Femtoduino.com is an open source hardware startup that makes the smallest arduino uno compatible, as well as the smallest arduino compatible with on-board Bluetooth Low Energy, and the only Arduino with onboard 10dof Motion and Orientation Sensing.","company":null,"plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1355856/avatar.jpg.75x75px.jpg","id":"e5907643-0edc-4b14-bc51-f37b37c6b77e"},{"name":"Michael Pardo","bio":"Michael is a software engineer working in Ann Arbor, Michigan, and he write Android apps at Lift. He also writes an active record style ORM for Android called ActiveAndroid. ActiveAndroid allows you to easily persist objects to SQLite databases in Android. He is also the author of RingDimmer &mdash; an Android app that sets your ring volume to the room volume &mdash; and Quotes &mdash; a simple, Holo themed stock quote tracker.","company":null,"plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1380320/avatar.jpg.75x75px.jpg","id":"b5fb9de7-ff83-46e6-b904-a4b7a8081f88"},{"name":"Jean-Baptiste Quéru","bio":"JBQ is an Android Architect at Yahoo, working across Yahoo's entire suite of Android apps. He has been working in mobile for more than 12 years and was part of the team at Google that launched and grew Android.","company":null,"plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1379864/avatar.jpg.75x75px.jpg","id":"dbe1d9be-8775-4716-a9b8-7b3f258500d4"},{"name":"Michael Bolin","bio":"Michael is a software engineer at Facebook where he created Buck, an open source build system for Android (and more!). Prior to his most recent work on Android tools, he focused on JavaScript tools and web development at Google. Michael is also the author of \"Closure: The Definitive Guide\" (O'Reilly 2010).","company":null,"plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1375307/avatar.jpg.75x75px.jpg","id":"89e3ba98-3192-4bff-a555-550af5e70680"},{"name":"Elizabeth Mezias","bio":"Elizabeth is an experienced computing professional. She has been to 4 Google I/O conferences and got to be both a Google Glass Pioneer and Explorer. Since 2008 her work is on Android apps as a mobile app architect and developer. This continues a long history with the Java platform starting at Sun in the '90s (JDK 1.1.4). <br /><br />Elizabeth is able to communicate complex technical ideas to other engineers as well as lay people, having been both an Individual Contributor as well as a Director of Technical Support. She is making connections in Boston after many years in Silicon Valley working with a diverse group of technologists in small, private start-ups and at large corporations like Adobe Systems. <br /><br />Miss Mezias hails from Bridgeport, CT. Her Bachelor of Science in Computer Science from San Francisco State University included valuable early work as a campus consultant for Steve Jobs at NeXT, Inc. For her, technology is a passion and she is continually building her skill set.","company":"Applico, Inc.","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1390203/avatar.jpg.75x75px.jpg","id":"bb063001-23f0-475f-b7e9-cab7e0739c5c"},{"name":"David Crawshaw","bio":"David Crawshaw is a Google software engineer on the Go programming language team. His long term mission is to improve programmer productivity by simplifying the foundations of computing. Right now, that means bringing Go to Android. You can find him at twitter.com/davidcrawshaw.","company":"Google","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1356607/avatar.jpg.75x75px.jpg","id":"3382273d-5859-47f4-be93-eb66b1c3059d"},{"name":"Jake Wharton","bio":"Jake Wharton is an Android developer at Square working on Square Cash. For the past 5 years he's been working on Android and Java libraries to smooth out the rough, annoying, and broken bits in order to simplify development.","company":"Square","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1356595/avatar.jpg.75x75px.jpg","id":"a6031414-e2d7-4dc8-9642-d7b1c78922f1"},{"name":"Valerie Lisyansky","bio":"Valerie Lisyansky&nbsp;is a product strategist, user experience, and visual designer based in NYC. With her 8 years of experience she has helped clients get products to market that are elegant and embody their brand story at every user interaction.<br /><br />Her understanding of the unique needs between different types of consumers allows her to create carefully crafted solutions for every client, and with a results-driven approach to product her work always reinforces the client&rsquo;s business objectives.<br /><br />Valerie graduated from Parsons The New School for Design with a BFA degree in Illustration &amp; Design.","company":null,"plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1356583/avatar.jpg.75x75px.jpg","id":"f5111956-19d1-420e-9814-5cdb186719db"},{"name":"Dario Laverde","bio":"Dario Laverde is a senior developer evangelist at HTC. He has experience in software development for mobile, embedded, Web and enterprise. Among his various professional roles, he has worked as an Android instructor, consultant, Java architect, author and entrepreneur. Dario leads the NYC-GDG (Google Developer Group), the NYCJava JUG, and co-organizes the New York Android Developers Meetup. He also runs the New York City based skylight1 open-source Android projects group that is currently working on Android Wear and Google Glass projects.","company":"HTC","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1356606/avatar.jpg.75x75px.jpg","id":"0f4d06f5-a971-4c5d-bf56-66efaf37cada"},{"name":"Morrison Chang","bio":"Morrison is a veteran software developer currently at Medialets Inc, a premier mobile ad tech company. He started out working on embedded programming in C and assembly at Symbol Technologies (now Motorola Solutions), slid into finance touching Perl, more C/C++, SQL, and, Java (at famous and infamous names), and now involved in mobile. He got his G1/ADP back in 2009 and is a commit level/lead member of the Skylight1 open source project. A known face in around the NYC Android scene, he has presented at BarCamp NYC, NYPC&rsquo;s Java Mobile Group, and AnDevCon. Morrison received his BS in Computer &amp; System Engineering from Rensselaer Polytechnic Institute, and his MS in Computer Engineering from the University of Southern California.","company":null,"plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1375316/avatar.jpg.75x75px.jpg","id":"0d268e01-4132-4a93-9154-2c88e2374445"},{"name":"Ty Smith","bio":"Ty Smith is a Sr. Android Engineer on the mobile platform team at Twitter developing awesome SDK's including Crashlytics. Prior to Twitter, Ty worked at Evernote on the product team and SDK team for 2 years, cofounded Recapp, a social sports news startup, lead the engineering effort on Powow Text Messaging which was acquired by Sprint, and built Zagat for Android which was acquired by Google. Ty holds a B.S. in Software Engineering from the University of Texas. He lives with his wife in San Francisco.","company":"Twitter","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1356612/avatar.jpg.75x75px.jpg","id":"bfbd992c-ecae-4684-836d-7cdc221b2cdc"},{"name":"Noe Branagan","bio":"Noe is a mobile developer at Orange R&D skill center focusing in researching needs for emerging markets(Africa and Latin America). He's has been advocating about mobile development mainly Android trying to give developers , conference speaker, developer community organizer, he likes to collaborate in activities that are related with developers .","company":"Orange","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1375071/avatar.jpg.75x75px.jpg","id":"2df8cfb4-6c5f-411b-a4c6-aeb5057aec90"},{"name":"Dan Maccarone","bio":"Dan Maccarone is the co-founder of Charming Robot, a product design company based in NYC. For the past twelve years, he has been helping startups, media &amp; fashion companies shape their online product strategy, including Foursquare, Rent The Runway, Jetsetter, Nicole Miller, Fitstar, &amp; Rachel Zoe. His experience also includes television, music and print media, and he has worked with Late Night with Jimmy Fallon, Gawker, Saturday Night Live, Universal Music and The Wall Street Journal. One of his most noted projects was creating the original strategy and user experience for Hulu. Prior to Charming Robot, Dan co-founded the design agency Hard Candy Shell.","company":"Charming Robot","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1356582/avatar.jpg.75x75px.jpg","id":"cef809ef-b590-4131-990a-c7db4fdeac94"},{"name":"Dallas Gutauckis","bio":"Dallas Gutauckis&nbsp;is a professional Android Engineer working at SeatGeek.com in New York City. He spends most of his time making engaging and whimsical experiences for their Android app.","company":"SeatGeek","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1356570/avatar.jpg.75x75px.jpg","id":"dd23d3eb-22bc-4d22-83e8-eed62a9028ee"},{"name":"Brent Watson","bio":"BrentWatson is an Android developer at Percolate Industries Inc, in NYC. Brent writes applications used by major brands such as Visa, GE, RedBull, Braun, Ford, Guinness, and many others. You can find him on twitter @brent_watson, and online at brentwatson.com","company":"Percolate Industries, Inc.","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1356590/avatar.jpg.75x75px.jpg","id":"fda7a224-e281-464d-af59-3e2ae58c0bb1"},{"name":"Mark Murphy","bio":"Mark Murphy is the founder of CommonsWare and the author of The Busy Coder&rsquo;s Guide to Android Development. He is active in supporting the Android developer community, from answering questions on StackOverflow to publishing sample code and reusable components as open source.","company":"CommonsWare","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1356611/avatar.jpg.75x75px.jpg","id":"745536b8-27c8-4188-b012-7a72fd3af382"},{"name":"Michael Bailey","bio":"Michael J. Bailey, Engineering Director - Android, American Express<br />\"Michael is an Engineering Director for the Android team responsible for American Express&rsquo; flagship consumer Android apps in the U.S. market. Development on these apps began in 2010.<br />Since joining the company in 2008, Michael has worked on a number initiatives at American Express including analytics, enterprise content management, AmexLabs, iOS apps, international mobile applications, NFC payments, the U.S. homepage and the U.S. online card applications site.<br />Michael holds a BS in Computer Science from Harvey Mudd College and an MS in Computer Science from the University of Southern California, where he specialized in computer security.<br />Including the US Consumer Apps that Michael works on, American Express has 8 Android apps in the US Play Store ( https://play.google.com/store/apps/developer?id=American%20Express ) and more in the International Play Stores\"","company":null,"plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1375064/avatar.jpg.75x75px.jpg","id":"e690e79f-9411-4668-91ab-ebd8fb813eb7"},{"name":"Kevin Schultz","bio":"Kevin Schultz is a Senior Software Engineer at Gilt Groupe. He works on the team building Gilt&rsquo;s new native Android application. He was previously the Lead Mobile Engineer at Lua Technologies.<br /><br />Kevin began his career as a mechanical engineer designing nuclear submarines for General Dynamics Electric Boat. He carries the lessons learned about quality and lean manufacturing over to his software work with a focus on automated testing and continuous delivery.&nbsp;<br /><br />He has a BS in Mechanical Engineering with a minor in Computer Science from the University of Delaware.","company":"Gilt Groupe","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1356567/avatar.jpg.75x75px.jpg","id":"fdda8e2a-d6a1-4543-88b5-5c557cbc58a5"},{"name":"Nathan Freitas","bio":"Nathan Freitas is the Founder and Director of the Guardian Project, a Brooklyn-based open-source mobile security community, whose apps include Orbot (Tor for Android), ChatSecure (encrypted chat and file sharing), and ObscuraCam (auto-face-blur!), and developer libraries including SQLCipher, IOCipher and NetCipher, for database, file and network encryption.","company":"The Guardian Project","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1356616/avatar.jpg.75x75px.jpg","id":"f8817434-5018-498f-941e-a79415e7b8a2"},{"name":"Troed Sangberg","bio":"Troed Sangberg is a developer advocate with Sony Developer Relations. With a core technical background in the home computer scene of the 80s he&rsquo;s been a professional telecom developer since the late 90s. Most recently he has worked in research, with an interest in the intersection between disruptive technology and the culture of society. Troed considers decentralisation of creation - how anyone anywhere can invent, distribute and disrupt - to be the major game changer of our times. Troed can be followed at Sony Developer World and at @devtroed<br />http://developer.sonymobile.com/https://twitter.com/devtroed","company":null,"plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1377185/avatar.jpg.75x75px.jpg","id":"ac1775c6-32ca-403a-8590-c2f9415dd44f"},{"name":"Anu Kannan","bio":"Android enthusiast the past 5 years focusing on enterprise grade mobile computers at Motorola Solutions Inc.","company":"Motorola Solutions","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1375024/avatar.jpg.75x75px.jpg","id":"9a142b8b-3232-4eec-929a-afd0f4acf156"},{"name":"Nihal Mehta","bio":"Nihal Mehta is a Founding General Partner at Eniac Ventures. With over 15 years experience in marketing technologies through founding five startups and investing in 100+ since 1999, Nihal Mehta is a noted expert in the emerging adoption of mobile technologies for media properties and consumer brands.<br />Prior to Eniac, Nihal co-founded LocalResponse, Inc., which makes ads more relevant from social signals, which he pivoted from buzzd, the first mobile real-time city guide. As the Founding CEO, Nihal grew LocalResponse&rsquo;s revenues 2153% over a three year period, which placed the company to #204 (#14 in NYC) to the 2014 Inc. 5000&prime;s Fastest Growing Companies and #67 to the 2013 Forbes list of America&rsquo;s Most Promising Companies. Prior to LocalResponse, Nihal founded ipsh!, one of the first full-service mobile marketing agencies in 2001, which was acquired by Omnicom (NYSE: OMC) in 2005. Nihal&rsquo;s investment portfolio includes Admob (sold to Google), Airbnb, HotelTonight, Swiftkey, Tapad &amp; Uber.<br /><br />In 2013, Nihal Mehta was named a semi-finalist for &ldquo;Entrepreneur of the Year&rdquo; by Ernst &amp; Young, in 2012 a top 100 &ldquo;Coolest People in NY Tech,&rdquo; by Business Insider, a &ldquo;NYC tech influencer&rdquo; by VentureBeat, one of the &ldquo;25 People Every New Founder Should Meet in New York Tech&rdquo; a top &ldquo;25 Up-And-Coming Startup CEO in New York&rdquo; by Business Insider, and a 2012 AlwaysOn &ldquo;Power Player NYC.&rdquo; Mehta was named a top 10 New York City &ldquo;Game Changer&rdquo; in the 2010 New York Enterprise Report, one of twenty RCR Wireless News &ldquo;Mobile Movers and Shakers&rdquo; in 2008, a BusinessWeek &ldquo;M-Commerce Baron&rdquo; in 2006 and named one of Ad Age&rsquo;s &ldquo;Top 20 Marketers in Their 20s&rdquo; in 2005. Nihal frequently guest lectures at business schools around the country on entrepreneurship and mobile marketing, and is published in over 15 books and white papers on the subject.<br /><br />Nihal graduated from the University of Pennsylvania with a BA in Philosophy and a BSE in Computer Science.","company":"Eniac Ventures","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1370078/avatar.jpg.75x75px.jpg","id":"eae10386-6a62-4466-824c-f74e6dcc8417"},{"name":"Rob Spectre","bio":"Rob Spectre is a punk rock technolologist having a barrel of monkeys on the Internet.<br /><br />Doing just about anything for a good laugh, Rob serves the developer evangelism and education teams at Twilio as their director. He is an ardent supporter of open source software and creative commons art, the startup scene in New York, and every professional sports club from Boston. In addition to bringing the good news of Twilio to the world, Rob runs a number of exploits into Internet ridiculousness, including the robotic telephonic joke machine Laugh-o-Tron, and the Nobel Prize-losing Chrome Extension Jeter Filter.<br /><br />Living and working in Brooklyn, Rob loves laughing, playing in a terrible punk band and failing to act his age by staying out of the mosh pit.","company":null,"plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1375292/avatar.jpg.75x75px.jpg","id":"7dcfc0f0-3207-4b1e-b2a0-6b52788059bc"},{"name":"Brian Christensen","bio":null,"company":null,"plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1375059/avatar.jpg.75x75px.jpg","id":"45b5f840-b965-4239-9357-5e7992088f2a"},{"name":"Tyler Kieft","bio":"Tyler&nbsp;Kieft&nbsp;has spent the last two years as an engineer working on Instagram for Android, building key features and focusing on usability and performance. Before joining Facebook, he was one of the co-founders of SpeakerText, which leveraged crowdsourcing and machine learning to produce fast, accurate transcriptions of video and audio content.","company":"Instagram","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1377208/avatar.jpg.75x75px.jpg","id":"69498ee0-8067-4ca4-b5aa-54426061be04"},{"name":"Johny Urgiles","bio":"Advocate for products so reliable, you could lend them money. Heavily focused on user experience and solving problems that &lsquo;Make The World a Better Place&rsquo;. In spare time, organize The Lab for Robotics Education to expose NYC teens to robotics.&nbsp;","company":null,"plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1377187/avatar.jpg.75x75px.jpg","id":"344f094b-8981-4a8c-aaf8-9cce4b32c6f8"},{"name":"Ron Shapiro","bio":"Ron graduated from Columbia in 2013 and has been working on Venmo's Android app since he was an intern the summer before. He loves photography, watching his hometown Phillies, biking down the Hudson river, and playing Minesweeper. Ron is also a well-documented sleepwalker and his been known to try doing a 900 off his bed and organize his room while subconscious.","company":null,"plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1375256/avatar.jpg.75x75px.jpg","id":"0d1b89bd-b3e8-41c9-9f17-98ef945f6915"},{"name":"Elissa Shevinsky","bio":"Elissa Shevinsky (aka \"LADYBOSS\") is CEO of Glimpse. Glimpse is an easy to use app for sharing encrypted photo and video messages. Currently available only for iOS7, Shevinsky can't wait to release for Android. Shevinsky has been making software since 1999, when web applications were still bleeding edge. Find her on Glimpse under username \"ladyboss\" (https://WeNeedGlimpse.com) or on Twitter as @ElissaBeth.","company":null,"plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1375018/avatar.jpg.75x75px.jpg","id":"2c8c9e5b-1a9e-408f-81da-03facb2aab69"},{"name":"Jesse Wilson","bio":"Jesse works on Square Cash in Waterloo, Canada. He's worked on open source at Square (OkHttp, Dagger, Wire) and before that Google (Gson, Guice, Guava). Jesse's currently moonlighting on a material design update for Rounds, a score pad app (roundsapp.com).","company":"Square","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1356581/avatar.jpg.75x75px.jpg","id":"702dca86-9d4a-40c9-a030-6f5da4cf1360"},{"name":"Edison Wang","bio":"Edison Wang is an engineer on the Vine for Android team at Twitter, mainly responsible the video playback and recording experience in the app. He is also the co-founder for SleepBot, a sleep tracking app available on Android and iOS. Prior of joining Twitter, he was lead Android engineer at Squarespace and a contractor for Samsung. He received his bachelor degree at Cooper Union.","company":"Vine/Twitter","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1356604/avatar.jpg.75x75px.jpg","id":"e9af7ffa-2543-448f-91c6-bd2d4a6f4276"},{"name":"Ray Ryan","bio":"<br />Ray Ryan is a senior software citizen at Square, where he focuses on making Android development tolerable. He has been goading people into writing software the way he thinks they should since the 1980s.","company":"Square","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1356596/avatar.jpg.75x75px.jpg","id":"bd15afc9-6206-451a-bff3-bb5cec2affb1"},{"name":"Huyen Dao","bio":"Huyen Tue Dao is a developer and consultant specializing in native mobile development for Android and iOS. She graduated with a BS and MS in Computer and Electrical Engineering from the University of Maryland, College Park. Professionally, she spent several years developing web applications before moving to mobile, working on projects small and enterprise.&nbsp;Huyen is completely crazy about development. She is also completely crazy about the developer community and participating through technical writing, speaking at conferences, and meeting other devs.<br /><br />If she is not up late obsessing over code, she is probably up late obsessing over a game: PC, console, mobile, board, card, hardcore, casual, multiplayer, or solo. Currently, she lives mostly in Denver though can often be found visiting the DC Metro area.","company":null,"plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1356594/avatar.jpg.75x75px.jpg","id":"c9981173-759d-4156-bfe3-aed801c5f797"},{"name":"Chuck Greb","bio":"Chuck Greb is a mobile software craftsman practicing clean code, responsive design, and test-driven development. He has been developing Android libraries and applications since platform version 2.0 Eclair launched on the original Motorola Droid. Since then he has helped build successful applications for companies including Comcast, MeetMe, HowAboutWe, and AWeber Communications.<br /><br />He is currently an Android developer at Mapzen where he crafts tools for building location-based mobile apps that leverage the power of open source and open data. As co-coordinator Android Alliance Philly and GDG Philadelphia, he helps promote and support the local development community. He also builds and plays traditional drums from Guinea, West Africa.","company":"Mapzen","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1356591/avatar.jpg.75x75px.jpg","id":"58e36423-8382-4bd7-95fe-90eac70e7e80"},{"name":"List Neigut","bio":"Lisa Neigut is an Android Developer at Etsy, the Brooklyn-based marketplace for handmade goods. Originally from Texas, she came to NYC as a part of the Hacker School batch of summer 2012. She's been building Android apps for the better part of 3 years. You can find her on Twitter as @niftynei, or her follow her infrequently updated blog at&nbsp;<a href=\"http://https417.blogspot.com/\" target=\"_blank\">http://https417.blogspot.com</a>.","company":"Etsy","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1356561/avatar.jpg.75x75px.jpg","id":"bab45798-9b70-4e02-be4d-0f3dba51a871"},{"name":"Marcos Paulo Damasceno","bio":"Marcos is an Android Craftsman at Mirego, one of Canada's fastest-growing companies.<br />He loves simple and beautiful UX and UI and has his attention always focused to small details and what makes mobile apps great. A passionate about Start Ups, Marcos already attended to many start up weekends and hackathons in Sao Paulo, San Francisco and Montreal and currently serves as a mentor for some successful brazilian apps.<br />He has been playing around with mobile since 2010, worked in many significant android apps for the brazilian market in the backend and mobile stack. Marcos already had the opportunity to speak at big conferences in Brazil like The Developer's Conference and DevFest Sao Paulo.&nbsp;<br />Marcos moved to Montreal in 2013, where he led the development of a big consumer's product android tablet app currently used by Sony US and now do great stuff with an amazing team at Mirego.<br />You can follow Marcos at:Google Plus +marcospaulosdTwitter @marcospaulosd","company":null,"plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1375294/avatar.jpg.75x75px.jpg","id":"2f9f2ca4-a4f8-4dbb-b250-94409eab5fe1"},{"name":"Leonard Collins","bio":"Leonard Collins graduated from Hunter College with a Bachelors in Mathematics and another in Computer Science. Since then, he's been working at Fuzz Productions as Lead Android Developer. Leonard's recent efforts in automated testing stems from the bottleneck in the \"Develop, Test, Delivery\" cycle, which he has encountered over the years. Often there aren't enough staff members to test the vast amount of builds generated by any one Dev Shop. With this in mind, \"How can I write meaningful automated tests to alleviate this problem? \" is the question that Leonard seeks to answer.","company":"Fuzz Productions","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1356569/avatar.jpg.75x75px.jpg","id":"769ff9e5-9ec5-4495-8a31-7d456939eb66"},{"name":"William Hoang","bio":"William Hoang is a Developer Advocate on the Mobile Engineering/Developer Experience team at Couchbase. His love for coffee and code has transcended him into the world of mobile while appreciating the offline in-person experiences.&nbsp;<br /><br />Prior, William worked on the Developer Relations team over at Twitter, BlackBerry, and Microsoft while also having been a Software Embedded GPS engineer at Research In Motion.&nbsp;William graduated from McGill University in Electrical Software Engineering<br /><br />Twitter: www.twitter.com/sweetiewill<br />LinkedIN: www.linkedin.com/in/williamhoang/","company":"CouchBase","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1356574/avatar.jpg.75x75px.jpg","id":"fd95482b-2c2c-45bf-a712-61b052598827"},{"name":"Arun Nagarajan","bio":"Arun Nagarajan&nbsp;is the founding engineer at NYC startup still in stealth mode. Prior to that, Arun was Tech Lead at Google working on the Developer Platform team. Arun has been working on mobile devices and applications since the early BlackBerry days. Arun has a BS in Computer Science from Johns Hopkins University. Arun resides in New York City but still loves the outdoors.","company":null,"plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1355858/avatar.jpg.75x75px.jpg","id":"d31beba1-b53b-4d74-b4d3-e8a729f7d3c2"},{"name":"Sonia Naresh Sharma","bio":"Sonia Sharma works in Android team at Google as a Technical Account Manager. Prior to this she has worked on mobile and web domains in Nokia, Motorola, Samsung and a few start-ups, in various capacities, both technical and business centric. She has worked on Android since 2009 and has a few Android applications in Google Play. She mentors students creating Android applications at Technovation Challenge and evangelizes Accessibility in Android.","company":"Google","plusoneUrl":"","thumbnailUrl":"http://static.sched.org/a4/1355857/avatar.jpg.75x75px.jpg","id":"0becb4c8-ec6e-4075-a31b-3505c59f417e"},{"name":"Kagii","bio":null,"company":null,"plusoneUrl":"","thumbnailUrl":"","id":"a184f025-37fd-4a3d-a9c4-f4121fb84b28"}],"blocks":[{"end":"2014-09-20T13:00:00.000Z","start":"2014-09-20T12:00:00.000Z","subtitle":null,"title":"Breakfast","type":"break"},{"end":"2014-09-20T17:30:00.000Z","start":"2014-09-20T16:30:00.000Z","subtitle":null,"title":"Lunch","type":"break"},{"end":"2014-09-20T19:30:00.000Z","start":"2014-09-20T19:00:00.000Z","subtitle":null,"title":"Break","type":"break"},{"end":"2014-09-21T13:00:00.000Z","start":"2014-09-21T12:00:00.000Z","subtitle":null,"title":"Breakfast","type":"break"},{"end":"2014-09-21T17:30:00.000Z","start":"2014-09-21T16:30:00.000Z","subtitle":null,"title":"Lunch","type":"break"},{"end":"2014-09-21T19:30:00.000Z","start":"2014-09-21T19:00:00.000Z","subtitle":null,"title":"Break","type":"break"}],"partners":[],"sessions":[{"speakers":["b5fb9de7-ff83-46e6-b904-a4b7a8081f88"],"description":"Android gives you several options to store your data, and the Android community gives you even more. This talk will cover the many different data storage options available to you and the reasons you might choose one over the other. We'll look at implementation details, common pitfalls, and examples of how you might use each in the real world.","photoUrl":"http://static.sched.org/a4/1380320/avatar.jpg","url":"http://bit.ly/1w4Po1I","startTimestamp":"2014-09-20T15:50:00Z","title":"Android Data","youtubeUrl":"","endTimestamp":"2014-09-20T16:30:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5508","tags":["THEME_DEVELOP","TOPIC_INTRO"],"color":null,"mainTag":"TOPIC_INTRO","room":"5faad506"},{"speakers":["dbe1d9be-8775-4716-a9b8-7b3f258500d4"],"description":"As a major established brand embracing Android, Yahoo needs to design its applications within Android guidelines, in order to be familiar to existing Android users who are new to Yahoo, while remaining familiar to its existing users.","photoUrl":"http://static.sched.org/a4/1379864/avatar.jpg","url":"http://bit.ly/1w4Qjis","startTimestamp":"2014-09-20T15:50:00Z","title":"Applying brand guidelines within Android guidelines","youtubeUrl":"","endTimestamp":"2014-09-20T16:30:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5509","tags":["THEME_DESIGN","TOPIC_UX"],"color":"#00897b","mainTag":"TOPIC_UX","room":"e16ec9a4"},{"speakers":["89e3ba98-3192-4bff-a555-550af5e70680"],"description":"* The naive way Android apps are built (and why it is slow).<br />* Where the opportunities for improvement are and how Buck capitalizes on them.<br />* How we use exopackage (<a href=\"http://facebook.github.io/buck/article/exopackage.html\" target=\"_blank\">http://facebook.github.io/buck/article/exopackage.html</a>) to take things a step further and make incremental Android development insanely fast.","photoUrl":"http://static.sched.org/a4/1375307/avatar.jpg","url":"http://bit.ly/1w4Qj2a","startTimestamp":"2014-09-20T15:50:00Z","title":"Building Android at Ludicrous Speed with Buck","youtubeUrl":"","endTimestamp":"2014-09-20T16:30:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5510","tags":["THEME_DEVELOP","TOPIC_BUILD"],"color":null,"mainTag":"TOPIC_BUILD","room":"accf3d0c"},{"speakers":["bb063001-23f0-475f-b7e9-cab7e0739c5c"],"description":"Home screen widgets and live wallpapers are a powerful innovation available only on the Android platform. These tools allow users to view a summary of real time information from your Android apps and can serve as a shortcut to opening your app. In this talk I will give an overview of two important pieces of behavioral science - the glance-able display and the quantitative self. After a design discussion covering lessons learned from the Stanford Design School on a Medical School research project I will cover the essentials of how to code these remote views. Live wallpapers and home screen widgets will come to life. The design discussion is quite relevant to the new Android Wear APIs.<br />Attendees will learn the steps required to create these features through a slide presentation and sample code.","photoUrl":"http://static.sched.org/a4/1390203/avatar.jpg","url":"http://bit.ly/1oWagCt","startTimestamp":"2014-09-20T17:30:00Z","title":"Home screen widgets and live wallpapers","youtubeUrl":"","endTimestamp":"2014-09-20T18:10:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5511","tags":["THEME_DEVELOP"],"color":"#666666","room":"5faad506"},{"speakers":[],"description":null,"photoUrl":"","url":"http://bit.ly/1w4PohW","startTimestamp":"2014-09-20T17:30:00Z","title":"Material Design Review","youtubeUrl":"","endTimestamp":"2014-09-20T18:10:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5512","tags":["THEME_DESIGN","TOPIC_L","TOPIC_UX"],"color":null,"mainTag":"TOPIC_L","room":"2ad2ca70"},{"speakers":["3382273d-5859-47f4-be93-eb66b1c3059d"],"description":"Current state of Go on Android:&nbsp;http://golang.org/s/go14android","photoUrl":"http://static.sched.org/a4/1356607/avatar.jpg","url":"http://bit.ly/1w4Poi0","startTimestamp":"2014-09-20T17:30:00Z","title":"Preview of Go on Android","youtubeUrl":"","endTimestamp":"2014-09-20T18:10:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5513","tags":["THEME_DEVELOP","TOPIC_ADVANCED","TOPIC_UNJAVA"],"color":null,"mainTag":"TOPIC_ADVANCED","room":"accf3d0c"},{"speakers":[],"description":"As Square has grown from a tiny startup to a large brand, I am leading our effort to maintain Squares high quality software releases for Register.&nbsp;<br /><br />Our latest campaign has to deal with automation testing. Delivering a solution that executes a matrix of tests over a matrix of devices with different configurations (screen sizes, cpus, android OS versions and so on).<br /><br />- Making it easy for our team to write new tests and understand existing ones<br />- Reduction of manual testing<br />- Decrease in regressions and gaining confidence<br />- Localization via screenshots (while tests are running)<br />- Custom \"Variations\" that provide execution of tests with different parameters (similar to Parameterized tests but tailored for Square)<br />- Dealing with flakiness in tests and how to write good automated tests (we are using Espresso)<br />- Team culture for writing tests<br /><br />I am the tech lead behind both Android and iOS, I will be focusing mostly on Android but a few examples can be provided for comparison with iOS.&nbsp;<br /><br />We are tackling this problem head on. We've tried in the past but we feel like we are now succeeding in realizing our goals.<br /><br />My talk is about brand and quality, how both interconnect and how my primary goal at Square is to have our Register app running reliably for all our customers. Payments has a few intricacies and our team must remain disciplined.","photoUrl":"","url":"http://bit.ly/1w4Poi6","startTimestamp":"2014-09-20T17:30:00Z","title":"Software Quality / Automation Testing at Square","youtubeUrl":"","endTimestamp":"2014-09-20T18:10:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5514","tags":["THEME_DEVELOP","TOPIC_BESTPRACTICE"],"color":null,"mainTag":"TOPIC_BESTPRACTICE","room":"e16ec9a4"},{"speakers":[],"description":null,"photoUrl":"","url":"http://bit.ly/W4YKxk","startTimestamp":"2014-09-20T17:30:00Z","title":"Timehop","youtubeUrl":"","endTimestamp":"2014-09-20T18:10:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5515","tags":["THEME_BUSINESS"],"color":"#666666","room":"c6bbd6c8"},{"speakers":["9921e2c3-d7e3-43ba-8ed1-04017f54203b"],"description":"Welcome to Droidcon NYC! We'll go over plans for the weekend, discuss finding your way around and what not to miss.","photoUrl":"http://static.sched.org/a4/1355785/avatar.jpg","url":"http://bit.ly/1w4Pl60","startTimestamp":"2014-09-20T13:00:00Z","title":"Welcome to Droidcon NYC","youtubeUrl":"","endTimestamp":"2014-09-20T13:20:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5500","tags":["THEME_DEVELOP","TOPIC_KEYNOTE"],"color":null,"mainTag":"TOPIC_KEYNOTE","room":"e16ec9a4"},{"speakers":["9921e2c3-d7e3-43ba-8ed1-04017f54203b"],"description":"A proper understanding of threading is critical to developing for Android, yet relatively little attention is paid to the topic. &nbsp;You will not succeed as a mobile developer if you don't understand this topic.<br />We'll cover the basics, touch on some strategies and frameworks, then talk about what we're doing at Touch Lab.&nbsp;","photoUrl":"http://static.sched.org/a4/1355785/avatar.jpg","url":"http://bit.ly/1w4Poic","startTimestamp":"2014-09-20T18:20:00Z","title":"Android Threading","youtubeUrl":"","endTimestamp":"2014-09-20T19:00:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5516","tags":["THEME_DEVELOP","TOPIC_INTRO"],"color":null,"mainTag":"TOPIC_INTRO","room":"5faad506"},{"speakers":["a5782e47-2c30-4504-9d29-3fa9ac93cfed","6631c7a7-a133-4f4b-97eb-cc7e0fdf51c8"],"description":"Chris and Kevin will discuss the evolution of Android design, Tumblr&rsquo;s design battles (with numbers to back up the company&rsquo;s claims of success), and give a call to action on the importance of building beautiful software in the era of Material Design.","photoUrl":"http://static.sched.org/a4/1381596/avatar.jpg","url":"http://bit.ly/1w4Pmqo","startTimestamp":"2014-09-20T13:20:00Z","title":"Keynote: Create Software With Soul","youtubeUrl":"","endTimestamp":"2014-09-20T13:50:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5501","tags":["THEME_DESIGN","TOPIC_KEYNOTE"],"color":null,"mainTag":"TOPIC_KEYNOTE","room":"e16ec9a4"},{"speakers":["cf464b05-d552-45ed-a223-d86b5d0ab0e0"],"description":"If you're attending the conference to start your Android journey, this talk is for you. I'll introduce you to the tools and the basic programming concepts. I'll create some simple Android apps and run them on real phones.&nbsp;<br /><br />This isn't a hands-on session. But if you work on some examples during the conference, I'll be available to help you get past any hurdles that you encounter.<br /><br />Prerequisite: Reading knowledge of an object-oriented programming language such as Java.","photoUrl":"http://static.sched.org/a4/1355793/avatar.jpg","url":"http://bit.ly/1w4Po1s","startTimestamp":"2014-09-20T14:10:00Z","title":"Android App Development for Newbies","youtubeUrl":"","endTimestamp":"2014-09-20T14:50:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5502","tags":["THEME_DEVELOP","TOPIC_INTRO"],"color":null,"mainTag":"TOPIC_INTRO","room":"5faad506"},{"speakers":["5cd0dac0-bb44-420d-bcf2-d46c41ef0091"],"description":null,"photoUrl":"http://static.sched.org/a4/1366978/avatar.jpg","url":"http://bit.ly/1w4Pmqu","startTimestamp":"2014-09-20T14:10:00Z","title":"Android Material Design","youtubeUrl":"","endTimestamp":"2014-09-20T14:50:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5503","tags":["THEME_DESIGN","TOPIC_L","TOPIC_UX"],"color":null,"mainTag":"TOPIC_L","room":"e16ec9a4"},{"speakers":["190853ec-bc33-4bef-ac67-2a605d86abfb"],"description":null,"photoUrl":"http://static.sched.org/a4/1375298/avatar.jpg","url":"http://bit.ly/1w4QlHl","startTimestamp":"2014-09-20T14:10:00Z","title":"Facebook Performance","youtubeUrl":"","endTimestamp":"2014-09-20T14:50:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5504","tags":["THEME_DEVELOP","TOPIC_ADVANCED"],"color":null,"mainTag":"TOPIC_ADVANCED","room":"c6bbd6c8"},{"speakers":[],"description":null,"photoUrl":"","url":"http://bit.ly/1w4Po1w","startTimestamp":"2014-09-20T15:00:00Z","title":"Android UI","youtubeUrl":"","endTimestamp":"2014-09-20T15:40:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5505","tags":["THEME_DEVELOP","TOPIC_INTRO"],"color":null,"mainTag":"TOPIC_INTRO","room":"5faad506"},{"speakers":["6631c7a7-a133-4f4b-97eb-cc7e0fdf51c8"],"description":null,"photoUrl":"http://static.sched.org/a4/1356579/avatar.jpg","url":"http://bit.ly/1w4Pmqy","startTimestamp":"2014-09-20T15:00:00Z","title":"Material design for Android","youtubeUrl":"","endTimestamp":"2014-09-20T15:40:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5506","tags":["THEME_DESIGN","TOPIC_L","TOPIC_UX"],"color":null,"mainTag":"TOPIC_L","room":"e16ec9a4"},{"speakers":["e5907643-0edc-4b14-bc51-f37b37c6b77e"],"description":"In 35 minutes I can explain how to communicate with an arduino over BLE, and how to visualize IMU data on an android. This is great for prototyping wearables and flying things. I will demonstrate these concepts usig Femtoduino.com's IMUduinoBTLE, with a Samsung Live (watch) and a Nexus 5.","photoUrl":"http://static.sched.org/a4/1355856/avatar.jpg","url":"http://bit.ly/1w4Pmqq","startTimestamp":"2014-09-20T15:50:00Z","title":"Android + Arduino + IMU + BLE","youtubeUrl":"","endTimestamp":"2014-09-20T16:30:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5507","tags":["THEME_DEVELOP","TOPIC_BLE","TOPIC_HARDWARE"],"color":null,"mainTag":"TOPIC_BLE","room":"c6bbd6c8"},{"speakers":["2df8cfb4-6c5f-411b-a4c6-aeb5057aec90"],"description":"Emerging markets has seen significant economic development over the last couple years, many people continue to lack access to quality essential services. However, 80% of the population do have access to, or individually own, a mobile phone and the technology offers a channel through which access to financial, utilities, employment, education and other services can be offered to the underserved at scale.<br /><br />Emerging markets mean more opportunities for those capable of cover the particular needs. In this talk we will explore different strategies that we have used to approach these this markets.","photoUrl":"http://static.sched.org/a4/1375071/avatar.jpg","url":"http://bit.ly/1w4Qlaa","startTimestamp":"2014-09-20T19:30:00Z","title":"Developing mobile apps for emerging markets.","youtubeUrl":"","endTimestamp":"2014-09-20T20:10:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5522","tags":["THEME_BUSINESS"],"color":"#666666","room":"accf3d0c"},{"speakers":[],"description":null,"photoUrl":"","url":"http://bit.ly/1w4PmXu","startTimestamp":"2014-09-20T19:30:00Z","title":"First App Code Lab","youtubeUrl":"","endTimestamp":"2014-09-20T20:10:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5523","tags":["THEME_DEVELOP","TOPIC_INTRO"],"color":null,"mainTag":"TOPIC_INTRO","room":"2ad2ca70"},{"speakers":["cef809ef-b590-4131-990a-c7db4fdeac94"],"description":"The best products are not created in a bubble. Over the course of this talk, we will review the critical roles that, through teamwork, the best products are launched. In addition to understanding the definitions/responsibilities of these roles, we'll discuss how to give constructive feedback, common mistakes that teams make (large and small) and analyze experiences that have had successful launches.","photoUrl":"http://static.sched.org/a4/1356582/avatar.jpg","url":"http://bit.ly/1w4PmH6","startTimestamp":"2014-09-20T19:30:00Z","title":"Stop, Collaborate & Listen: The Art of Smart Product Design","youtubeUrl":"","endTimestamp":"2014-09-20T20:10:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5524","tags":["THEME_DESIGN","TOPIC_UX"],"color":"#00897b","mainTag":"TOPIC_UX","room":"e16ec9a4"},{"speakers":[],"description":null,"photoUrl":"","url":"http://bit.ly/1w4QlHf","startTimestamp":"2014-09-20T19:30:00Z","title":"Tools of the Trade","youtubeUrl":"","endTimestamp":"2014-09-20T20:10:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5525","tags":["THEME_DEVELOP","TOPIC_INTRO"],"color":null,"mainTag":"TOPIC_INTRO","room":"5faad506"},{"speakers":["dd23d3eb-22bc-4d22-83e8-eed62a9028ee"],"description":"Covers why we animate, what we animate, and how we animate Android applications.","photoUrl":"http://static.sched.org/a4/1356570/avatar.jpg","url":"http://bit.ly/1w4QjiA","startTimestamp":"2014-09-20T20:20:00Z","title":"Android Animations Bringing Your Applications to Life","youtubeUrl":"","endTimestamp":"2014-09-20T21:00:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5526","tags":["THEME_DEVELOP","TOPIC_INTRO"],"color":null,"mainTag":"TOPIC_INTRO","room":"5faad506"},{"speakers":["9921e2c3-d7e3-43ba-8ed1-04017f54203b"],"description":"Review the newbie topics, and discuss what not to miss for the rest of the conference!","photoUrl":"http://static.sched.org/a4/1355785/avatar.jpg","url":"http://bit.ly/1w4Qlqx","startTimestamp":"2014-09-20T20:20:00Z","title":"Android Newbie Recap","youtubeUrl":"","endTimestamp":"2014-09-20T21:00:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5527","tags":["THEME_DEVELOP","TOPIC_INTRO"],"color":null,"mainTag":"TOPIC_INTRO","room":"2ad2ca70"},{"speakers":["fda7a224-e281-464d-af59-3e2ae58c0bb1"],"description":null,"photoUrl":"http://static.sched.org/a4/1356590/avatar.jpg","url":"http://bit.ly/1w4Po1A","startTimestamp":"2014-09-20T20:20:00Z","title":"BLE for Indoor Positioning","youtubeUrl":"","endTimestamp":"2014-09-20T21:00:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5528","tags":["THEME_DEVELOP","TOPIC_GEO"],"color":null,"mainTag":"TOPIC_GEO","room":"accf3d0c"},{"speakers":["745536b8-27c8-4188-b012-7a72fd3af382"],"description":"The Android ecosystem has come a long way in terms of reusable libraries, courtesy of build system improvements like the Android library project. In this presentation, we will explore \"better than average\" practices for creating, distributing, and supporting libraries for Android developers, with a particular emphasis on open source libraries.","photoUrl":"http://static.sched.org/a4/1356611/avatar.jpg","url":"http://bit.ly/1w4Poia","startTimestamp":"2014-09-20T20:20:00Z","title":"Tips for Writing Libraries","youtubeUrl":"","endTimestamp":"2014-09-20T21:00:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5529","tags":["THEME_DEVELOP","TOPIC_ADVANCED","TOPIC_BESTPRACTICE"],"color":null,"mainTag":"TOPIC_ADVANCED","room":"c6bbd6c8"},{"speakers":["e690e79f-9411-4668-91ab-ebd8fb813eb7"],"description":"We will go through a number items that will help you be more productive with Android Studio. Some knowledge of Java and Android development is assumed.","photoUrl":"http://static.sched.org/a4/1375064/avatar.jpg","url":"http://bit.ly/1w4QhqM","startTimestamp":"2014-09-20T21:10:00Z","title":"Android Studio Tips","youtubeUrl":"","endTimestamp":"2014-09-20T21:50:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5530","tags":["THEME_DEVELOP","TOPIC_INTRO"],"color":null,"mainTag":"TOPIC_INTRO","room":"c6bbd6c8"},{"speakers":["a6031414-e2d7-4dc8-9642-d7b1c78922f1"],"description":"The Java programming language has a knack for requiring a lot of boilerplate code. Annotation processing is a feature of the Java compiler which provides hooks that allow automatic code generation based on annotations. This greatly simplifies your code by pushing the burden of the boilerplate on automated tooling.<br /><br />This talk will focus on showcasing existing annotation processors for Android development. We will also briefly cover how to get started writing your own annotation processor.","photoUrl":"http://static.sched.org/a4/1356595/avatar.jpg","url":"http://bit.ly/1w4Qj1S","startTimestamp":"2014-09-20T18:20:00Z","title":"Annotation Processing Boilerplate Destruction","youtubeUrl":"","endTimestamp":"2014-09-20T19:00:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5517","tags":["THEME_DEVELOP","TOPIC_ADVANCED"],"color":null,"mainTag":"TOPIC_ADVANCED","room":"e16ec9a4"},{"speakers":["f5111956-19d1-420e-9814-5cdb186719db"],"description":"The role of \"visual design\" and \"user experience\" are rather different - which should have priority in a product? This topic focuses on the distinct difference between the two, explaining situations where one is more beneficial than the other, and allowing the developer to make the right decision for their project. The old school mentality of \"function over form\" is no longer always valid with brand having such high value in our culture. Making the decision of giving priority to one over the other isn't always clearcut, though, and in the best products, it appears that visual design and UX blend together seamlessly.","photoUrl":"http://static.sched.org/a4/1356583/avatar.jpg","url":"http://bit.ly/1w4PmXq","startTimestamp":"2014-09-20T18:20:00Z","title":"Design versus UX in mobile","youtubeUrl":"","endTimestamp":"2014-09-20T19:00:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5518","tags":["THEME_DESIGN","TOPIC_UX"],"color":"#00897b","mainTag":"TOPIC_UX","room":"c6bbd6c8"},{"speakers":["0f4d06f5-a971-4c5d-bf56-66efaf37cada"],"description":"All you need to learn to get started with Depth Maps (for 2D plus images, post processing image effects, navigation, gaming and more).<br /><br />Although we'll walk through code for the first commercially available dual lens based depth map processing APIs using the HTC M8, the concepts and code will still be applicable for related Android based projects such as Project Tango, Amazon's latest device, and more. Bring your devices and laptop for a hands on coding session! (loaners will be made available)<br /><br />Depth Maps on Android are here and it's time to take advantage of these new APIs in new innovative ways.","photoUrl":"http://static.sched.org/a4/1356606/avatar.jpg","url":"http://bit.ly/1w4PmH4","startTimestamp":"2014-09-20T18:20:00Z","title":"HTC One Depth Maps","youtubeUrl":"","endTimestamp":"2014-09-20T19:00:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5519","tags":["THEME_DEVELOP"],"color":"#666666","room":"2ad2ca70"},{"speakers":["0d268e01-4132-4a93-9154-2c88e2374445"],"description":"With increased UI/UX demands, image filters are arguably no longer the domain of speciality apps. The talk will cover using Renderscript/Filterscript to alter your content images and touch upon more advanced ways like OpenGL ES 2.0 shader language.","photoUrl":"http://static.sched.org/a4/1375316/avatar.jpg","url":"http://bit.ly/1w4QlXz","startTimestamp":"2014-09-20T18:20:00Z","title":"Image Filter Options in Android","youtubeUrl":"","endTimestamp":"2014-09-20T19:00:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5520","tags":["THEME_DEVELOP","TOPIC_ADVANCED"],"color":null,"mainTag":"TOPIC_ADVANCED","room":"accf3d0c"},{"speakers":["bfbd992c-ecae-4684-836d-7cdc221b2cdc"],"description":"The Android app ecosystem is an international phenomenon. Developers need better tools now, more than ever, and the number of third-party SDKs is also growing to meet the developer's needs. Unfortunately, many of these SDKs are poorly developed and extremely difficult to use. In fact, at Twitter on the Crashlytics team, we've detected a significant percentage of issues caused by third-party SDKs.<br /><br />Crashlytics is well-known for its focus on SDK quality, and have been deployed on hundreds of millions of devices. In this session, attendees will learn the skills to develop and distribute SDKs for Android. We'll explore how to design and build an SDK for stability, testability, performance, overall footprint size, and, most importantly, exceptional ease of implementation. Over the course of the session, we'll develop a simple but well-architected SDK and uncover and explain many of the challenges we encountered when building SDKs at Twitter. Topics include device feature detection, supporting multiple application types (from Widgets to Services to Foreground GUI applications), API design, deploying artifacts, and coding patterns to support developer customization. We'll conclude with advanced topics, from less-known but very useful tricks to minimizing impact on application start-up time to reducing memory footprint and persistent CPU use.","photoUrl":"http://static.sched.org/a4/1356612/avatar.jpg","url":"http://bit.ly/1w4Poie","startTimestamp":"2014-09-20T19:30:00Z","title":"Building First Class Android SDKs","youtubeUrl":"","endTimestamp":"2014-09-20T20:10:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5521","tags":["THEME_DEVELOP","TOPIC_ADVANCED","TOPIC_BESTPRACTICE"],"color":null,"mainTag":"TOPIC_ADVANCED","room":"c6bbd6c8"},{"speakers":["0f4d06f5-a971-4c5d-bf56-66efaf37cada"],"description":"A deep dive into what the Android internals consist of for both of these wearable device platforms. We'll look at what's available via AOSP and how you can use this knowledge to your advantage, how to build and modify the kernel source code and current best practices to target both platforms from the same code base efficiently. Intermediate level, warranty voiding optional.","photoUrl":"http://static.sched.org/a4/1356606/avatar.jpg","url":"http://bit.ly/1w4Po1C","startTimestamp":"2014-09-21T15:00:00Z","title":"Glass and Wear Internals","youtubeUrl":"","endTimestamp":"2014-09-21T15:40:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5539","tags":["THEME_DEVELOP","TOPIC_HARDWARE","TOPIC_WEARABLES"],"color":null,"mainTag":"TOPIC_HARDWARE","room":"5faad506"},{"speakers":[],"description":null,"photoUrl":"","url":"http://bit.ly/1w4QlqN","startTimestamp":"2014-09-21T15:00:00Z","title":"Google Cast","youtubeUrl":"","endTimestamp":"2014-09-21T15:40:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5540","tags":["THEME_DEVELOP","TOPIC_VIDEO"],"color":null,"mainTag":"TOPIC_VIDEO","room":"accf3d0c"},{"speakers":["45b5f840-b965-4239-9357-5e7992088f2a"],"description":null,"photoUrl":"http://static.sched.org/a4/1375059/avatar.jpg","url":"http://bit.ly/1w4PoyA","startTimestamp":"2014-09-21T15:00:00Z","title":"How to work like your team's gonna be huge","youtubeUrl":"","endTimestamp":"2014-09-21T15:40:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5541","tags":["THEME_DEVELOP","TOPIC_BESTPRACTICE"],"color":null,"mainTag":"TOPIC_BESTPRACTICE","room":"e16ec9a4"},{"speakers":["69498ee0-8067-4ca4-b5aa-54426061be04"],"description":"Over the past 18 months, a team of Facebook engineers have been working on the experience of using our flagship apps on Android in emerging markets.<br /><br />In 2013, we were able to achieve significant improvements in data usage, performance, and app size of Facebook by focusing on scenarios that we identified to be problematic during a trip to Africa earlier that year. In this talk, we'll discuss some the changes we made to the Facebook app that resulted in 65% data usage improvements and 50% efficiency gains over about a 6 month period.&nbsp;<br /><br />While these gains were mostly general efficiency improvements that benefited all of of our users, for the second phase of the project we&rsquo;ve been working on more targeted optimizations. These improvements could be optimized based on type of device, network connection characteristics, or general usage patterns of the app. We&rsquo;ll delve into some of the details of the system, including an overview of our innovative device- and network-classification technologies, a new configuration system that powers this optimization, and a discussion of our \"smart prefetching\" technologies.&nbsp;<br /><br />The last thing we'll cover is how we improved the speed and performance of Instagram for Android, and share some of the methods we use to maintain a fast and reliable experience.","photoUrl":"http://static.sched.org/a4/1377208/avatar.jpg","url":"http://bit.ly/1w4QjiG","startTimestamp":"2014-09-21T15:00:00Z","title":"Improving Facebook and Instagram in Emerging Markets ","youtubeUrl":"","endTimestamp":"2014-09-21T15:40:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5542","tags":["THEME_DEVELOP"],"color":"#666666","room":"c6bbd6c8"},{"speakers":["344f094b-8981-4a8c-aaf8-9cce4b32c6f8"],"description":"Bluetooth beacons are revolutionizing open spaces, revealing a new dimension in human-technology interaction. This talk goes into the basics of BLE and how it plays well with Android 4.3 and beyond. Included in this talk will be examples of a production app using BLE and best practices for getting your own project using BLE quickly.","photoUrl":"http://static.sched.org/a4/1377187/avatar.jpg","url":"http://bit.ly/1w4QjyW","startTimestamp":"2014-09-21T15:50:00Z","title":"Beaconizing Android","youtubeUrl":"","endTimestamp":"2014-09-21T16:30:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5543","tags":[],"color":"#666666","room":"c6bbd6c8"},{"speakers":[],"description":null,"photoUrl":"","url":"http://bit.ly/1w4PmGW","startTimestamp":"2014-09-21T15:50:00Z","title":"Panel - Social Good Development","youtubeUrl":"","endTimestamp":"2014-09-21T16:30:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5544","tags":["THEME_BUSINESS"],"color":"#666666","room":"e16ec9a4"},{"speakers":["0d1b89bd-b3e8-41c9-9f17-98ef945f6915"],"description":"Everyone keeps talking about Reactive Programming and RxJava, but how is it actually used in Android programming? This talk will discuss the building blocks of reactive programming, Observables, and how to understand the core parts of push-not-pull programming. Learn how to easily do work on a background thread in one line while still updating your UI on the main thread, easily implement a Publish-Subscribe pattern with Observables and Subjects, and take advantage of RxJava to make form-based UIs simple. Finally, we'll look at how using Observables can improve testing and ensure that your code will not block the UI thread if operations are blocked.","photoUrl":"http://static.sched.org/a4/1375256/avatar.jpg","url":"http://bit.ly/1w4PmGY","startTimestamp":"2014-09-21T15:50:00Z","title":"RxJava Easy Wins: Breaking down Reactive Programming","youtubeUrl":"","endTimestamp":"2014-09-21T16:30:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5545","tags":["THEME_DEVELOP","TOPIC_BESTPRACTICE","TOPIC_THREADING"],"color":null,"mainTag":"TOPIC_BESTPRACTICE","room":"accf3d0c"},{"speakers":["fdda8e2a-d6a1-4543-88b5-5c557cbc58a5"],"description":"All too often mobile apps get to the point where they are collapsing under their own weight, and the engineering team throws up their hands and say &lsquo;we have to rewrite it!&rsquo;. This talk will give a strategy for building Android applications that don&rsquo;t turn into &ldquo;legacy code&rdquo; in 12 months. We will cover Android specific architecture, testing patterns, best practices, and tools that help teams build large scale apps successfully.","photoUrl":"http://static.sched.org/a4/1356567/avatar.jpg","url":"http://bit.ly/1w4Qjio","startTimestamp":"2014-09-20T21:10:00Z","title":"Building Maintainable Android Applications","youtubeUrl":"","endTimestamp":"2014-09-20T21:50:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5531","tags":["THEME_DEVELOP","TOPIC_INTRO"],"color":null,"mainTag":"TOPIC_INTRO","room":"5faad506"},{"speakers":["f8817434-5018-498f-941e-a79415e7b8a2"],"description":"Learn how to use SQLCipher, IOCipher and NetCipher, three open-source developer libraries, to protect, defend and encrypt your on-device databases, local file storage, and network communications from all kinds of threats. The tutorial will walk through how these enhanced APIs are different from the stock Android APIs, review their security features in depth, and discuss real-world threat models apps face. You will work on sample projects, as well as real, complex shipping applications that incorporate the software, will also be dissected. This is a hands-on session, where you will walk away with what you need to better protect your users and their data, using freely licensed, open-source tools.","photoUrl":"http://static.sched.org/a4/1356616/avatar.jpg","url":"http://bit.ly/1w4QkDd","startTimestamp":"2014-09-20T21:10:00Z","title":"The Guardian Project: Developers… Encrypt All the Things!","youtubeUrl":"","endTimestamp":"2014-09-20T21:50:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5532","tags":["THEME_DEVELOP","TOPIC_ADVANCED","TOPIC_SECURITY"],"color":null,"mainTag":"TOPIC_ADVANCED","room":"accf3d0c"},{"speakers":["9921e2c3-d7e3-43ba-8ed1-04017f54203b"],"description":"Recap of day 1. &nbsp;Talks not to miss on day 2.","photoUrl":"http://static.sched.org/a4/1355785/avatar.jpg","url":"http://bit.ly/1w4QiLC","startTimestamp":"2014-09-21T13:00:00Z","title":"Welcome Day 2","youtubeUrl":"","endTimestamp":"2014-09-21T13:20:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5533","tags":["THEME_DEVELOP"],"color":"#666666","room":"e16ec9a4"},{"speakers":[],"description":"TBD...","photoUrl":"","url":"http://bit.ly/1w4QiLE","startTimestamp":"2014-09-21T13:20:00Z","title":"Keynote Day 2","youtubeUrl":"","endTimestamp":"2014-09-21T13:50:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5534","tags":[],"color":"#666666","room":"e16ec9a4"},{"speakers":["ac1775c6-32ca-403a-8590-c2f9415dd44f"],"description":"The era of SmartWear and Internet of Things is upon us. Technological development is never at a standstill - this session will walk through 8000 years of human innovation and extrapolate scenarios for our near future. We will go into detail on Sony SDKs and tech details of Wi-Fi controlled cameras, SmartBand, SmartWatch and SmartEyeglass - and how new Sony services drastically reduce friction for developers.","photoUrl":"http://static.sched.org/a4/1377185/avatar.jpg","url":"http://bit.ly/1w4Poyu","startTimestamp":"2014-09-21T14:10:00Z","title":"Going beyond smartphones","youtubeUrl":"","endTimestamp":"2014-09-21T14:50:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5535","tags":["THEME_DEVELOP","TOPIC_HARDWARE"],"color":null,"mainTag":"TOPIC_HARDWARE","room":"c6bbd6c8"},{"speakers":["9a142b8b-3232-4eec-929a-afd0f4acf156"],"description":"Agenda :<br />1. NDK Overview<br />2. Sample NDK app/usage<br />3. Advantages of NDK<br />4. Tips to improve security and obfuscation of IP protected content<br />5. [Stretch goal] Extend Android's framework to add custom hardware and interface via JNI","photoUrl":"http://static.sched.org/a4/1375024/avatar.jpg","url":"http://bit.ly/1w4PmXE","startTimestamp":"2014-09-21T14:10:00Z","title":"NDK for portability and security","youtubeUrl":"","endTimestamp":"2014-09-21T14:50:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5536","tags":["THEME_DEVELOP","TOPIC_SECURITY"],"color":null,"mainTag":"TOPIC_SECURITY","room":"accf3d0c"},{"speakers":["eae10386-6a62-4466-824c-f74e6dcc8417"],"description":null,"photoUrl":"http://static.sched.org/a4/1370078/avatar.jpg","url":"http://bit.ly/1w4Qlaf","startTimestamp":"2014-09-21T14:10:00Z","title":"The Evolution of Online Advertising","youtubeUrl":"","endTimestamp":"2014-09-21T14:50:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5537","tags":["THEME_BUSINESS"],"color":"#666666","room":"e16ec9a4"},{"speakers":["7dcfc0f0-3207-4b1e-b2a0-6b52788059bc"],"description":"A quick live-coding exploration of the new frontier for Android development introduced to the community at Google I/O, Google Wear. Rob from Twilio will take you through getting started developing for the smart watch platform with all the goods, gahs and gotchas with this new form factor.","photoUrl":"http://static.sched.org/a4/1375292/avatar.jpg","url":"http://bit.ly/1w4Qiv2","startTimestamp":"2014-09-21T14:10:00Z","title":"We Were Promised Jetpacks - An Introduction to Developing on Android Wear","youtubeUrl":"","endTimestamp":"2014-09-21T14:50:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5538","tags":["THEME_DEVELOP","TOPIC_WEARABLES"],"color":"#ad1457","mainTag":"TOPIC_WEARABLES","room":"5faad506"},{"speakers":["58e36423-8382-4bd7-95fe-90eac70e7e80"],"description":null,"photoUrl":"http://static.sched.org/a4/1356591/avatar.jpg","url":"http://bit.ly/1w4PmXs","startTimestamp":"2014-09-21T18:20:00Z","title":"Building Location-Aware Apps with Open Source and Open Data","youtubeUrl":"","endTimestamp":"2014-09-21T19:00:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5803","tags":["THEME_DEVELOP","TOPIC_GEO"],"color":null,"mainTag":"TOPIC_GEO","room":"5faad506"},{"speakers":["bab45798-9b70-4e02-be4d-0f3dba51a871"],"description":null,"photoUrl":"http://static.sched.org/a4/1356561/avatar.jpg","url":"http://bit.ly/1w4Qj28","startTimestamp":"2014-09-21T18:20:00Z","title":"Gradlin': Nuts and bolts","youtubeUrl":"","endTimestamp":"2014-09-21T19:00:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5804","tags":["THEME_DEVELOP","TOPIC_INTRO"],"color":null,"mainTag":"TOPIC_INTRO","room":"e16ec9a4"},{"speakers":["2f9f2ca4-a4f8-4dbb-b250-94409eab5fe1"],"description":"A very useful and powerful feature of android that developers sometimes ignore or use it wrong. The small details of your app is what make it amazing, in this presentation we will talk about how Shapes, Layer-Lists, Gradients and more can make your UI jump to another level and amaze your users. All that without being a rockstar designer!","photoUrl":"http://static.sched.org/a4/1375294/avatar.jpg","url":"http://bit.ly/1w4QiLA","startTimestamp":"2014-09-21T18:20:00Z","title":"The Magic World of Drawables","youtubeUrl":"","endTimestamp":"2014-09-21T19:00:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5805","tags":["THEME_DEVELOP","TOPIC_UX"],"color":"#00897b","mainTag":"TOPIC_UX","room":"c6bbd6c8"},{"speakers":["769ff9e5-9ec5-4495-8a31-7d456939eb66"],"description":"Goals:<br />Show a real world example of espresso and automation<br />Take intro tour to setting up a project with espresso<br />Deeper dive into advance features espresso offers<br />Espresso Gotchas","photoUrl":"http://static.sched.org/a4/1356569/avatar.jpg","url":"http://bit.ly/1w4QlHb","startTimestamp":"2014-09-21T19:30:00Z","title":"Automation and Espresso","youtubeUrl":"","endTimestamp":"2014-09-21T20:10:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5806","tags":["THEME_DEVELOP","TOPIC_INTRO"],"color":null,"mainTag":"TOPIC_INTRO","room":"5faad506"},{"speakers":["fd95482b-2c2c-45bf-a712-61b052598827"],"description":"What is NoSQL and the trends in database. From MongoDB, Couchbase, etc and how it will benefit the developers and end users. Breaking down the iOS and Android development into separate topics (Topic #2 and Topic #3 respectively) but can be combined with Topic #1 as well in a condense overview format.","photoUrl":"http://static.sched.org/a4/1356574/avatar.jpg","url":"http://bit.ly/1w4QlXD","startTimestamp":"2014-09-21T19:30:00Z","title":"NoSQL development on Mobile","youtubeUrl":"","endTimestamp":"2014-09-21T20:10:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5807","tags":["THEME_DEVELOP","TOPIC_INTRO"],"color":null,"mainTag":"TOPIC_INTRO","room":"accf3d0c"},{"speakers":["2c8c9e5b-1a9e-408f-81da-03facb2aab69"],"description":"Speaker Elissa Shevinsky is CEO of Glimpse, an end to end encrypted app. We'll review security and privacy considerations when building for Android. Using popular apps like Snapchat, Yo, and Secret as examples, we'll do a deep dive into best practices for avoiding some of the most basic (but pervasive) hacks on social networks. We'll end with an overview of security differences at the hardware level, comparing security vulnerabilities recently uncovered in Apple (by iOS forensics expert Jonathan Zdzieraski) to the high security hardware being developed for Android (such as the Blackphone, by leading cryptographers Jon Callas and Dan Ford.)","photoUrl":"http://static.sched.org/a4/1375018/avatar.jpg","url":"http://bit.ly/1w4Poi4","startTimestamp":"2014-09-21T15:50:00Z","title":"Security on the Android Platform","youtubeUrl":"","endTimestamp":"2014-09-21T16:30:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5546","tags":["THEME_DEVELOP","TOPIC_SECURITY"],"color":null,"mainTag":"TOPIC_SECURITY","room":"5faad506"},{"speakers":[],"description":null,"photoUrl":"","url":"http://bit.ly/1w4QlqL","startTimestamp":"2014-09-21T15:50:00Z","title":"WunderBar","youtubeUrl":"","endTimestamp":"2014-09-21T16:30:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5547","tags":["THEME_DEVELOP","TOPIC_BLE","TOPIC_HARDWARE"],"color":null,"mainTag":"TOPIC_BLE","room":"2ad2ca70"},{"speakers":["d31beba1-b53b-4d74-b4d3-e8a729f7d3c2"],"description":"Many applications can benefit from having near-real time background location updates. However, due to battery concerns many apps attempt this but eventually shy away from it. This talk will talk about tips and best practices on how to achieve this including the settings and techniques like geofencing. We'll also talk about best tools and brute force approaches to track battery usage so that you can baseline and improve your apps' battery performance without giving away accuracy and key use cases.","photoUrl":"http://static.sched.org/a4/1355858/avatar.jpg","url":"http://bit.ly/1w4Qj20","startTimestamp":"2014-09-21T19:30:00Z","title":"Writing battery efficient GPS and location based apps.","youtubeUrl":"","endTimestamp":"2014-09-21T20:10:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5808","tags":["THEME_DEVELOP","TOPIC_GEO"],"color":null,"mainTag":"TOPIC_GEO","room":"c6bbd6c8"},{"speakers":["0becb4c8-ec6e-4075-a31b-3505c59f417e"],"description":"Integrating accessibility features into new or existing applications to make it stand out and reachable to more users.<br />The session will cover:<br />Importance of accessibility while designing an application.<br />Android&rsquo;s built-in accessibility features and its evolution in different Android versions. This will include Android&rsquo;s built in support for touch, speech and many other features that can be incorporated to make an application more accessible.<br />Deep dive into few of the available features like sensors, haptics, and gestures that will make the application stand out and be more accessible.<br />Code examples explaining accessibility features.<br />Tips to add common useful effects that goes a long way in creating a compelling User Interface.<br /><br />Level: Intermediate.<br />Topic Area: Developer Essentials.","photoUrl":"http://static.sched.org/a4/1355857/avatar.jpg","url":"http://bit.ly/1w4QlXH","startTimestamp":"2014-09-21T20:20:00Z","title":"Designing Accessible Android Applications","youtubeUrl":"","endTimestamp":"2014-09-21T21:00:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5809","tags":["THEME_DEVELOP","TOPIC_INTRO","TOPIC_TOOLS"],"color":null,"mainTag":"TOPIC_INTRO","room":"accf3d0c"},{"speakers":["702dca86-9d4a-40c9-a030-6f5da4cf1360"],"description":"The network is unreliable. 3G networking is slow. Using WiFi drains your battery. The NSA is spying on you. Different versions of HttpURLConnection have different bugs.<br /><br />I'd like to talk OkHttp, a library I maintain, and how to use it to make your app's networking work even when conditions aren't ideal. I'll talk about how to configure caching to improve behavior and save resources. I'll talk about crypto. And I'll give advice on which libraries to use to make good networking easy.","photoUrl":"http://static.sched.org/a4/1356581/avatar.jpg","url":"http://bit.ly/1w4Pmqw","startTimestamp":"2014-09-21T17:30:00Z","title":"HTTP in a hostile world","youtubeUrl":"","endTimestamp":"2014-09-21T18:10:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5548","tags":["THEME_DEVELOP","TOPIC_ADVANCED"],"color":null,"mainTag":"TOPIC_ADVANCED","room":"e16ec9a4"},{"speakers":["e9af7ffa-2543-448f-91c6-bd2d4a6f4276"],"description":"I have been working on Vine for Android's video framework in the last 18 months, wanna share all the experience and things I learned on Android's video playback and recording capabilities. #MediaPlayer #MediaRecorder #MediaCodec, #ExoPlayer, #TextureView, #FrameRecording, #Camera","photoUrl":"http://static.sched.org/a4/1356604/avatar.jpg","url":"http://bit.ly/1w4QlH5","startTimestamp":"2014-09-21T17:30:00Z","title":"Playing and Recording Videos","youtubeUrl":"","endTimestamp":"2014-09-21T18:10:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5549","tags":["THEME_DEVELOP","TOPIC_ADVANCED","TOPIC_VIDEO"],"color":null,"mainTag":"TOPIC_ADVANCED","room":"5faad506"},{"speakers":[],"description":null,"photoUrl":"","url":"http://bit.ly/1w4QiuS","startTimestamp":"2014-09-21T17:30:00Z","title":"Topps","youtubeUrl":"","endTimestamp":"2014-09-21T18:10:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5800","tags":["THEME_BUSINESS"],"color":"#666666","room":"c6bbd6c8"},{"speakers":["bd15afc9-6206-451a-bff3-bb5cec2affb1"],"description":"A detailed discussion of how Square uses its open source libraries Dagger, Flow and Mortar to build its apps and enjoy the process.","photoUrl":"http://static.sched.org/a4/1356596/avatar.jpg","url":"http://bit.ly/1w4QlqP","startTimestamp":"2014-09-21T17:30:00Z","title":"Under Square's Hood","youtubeUrl":"","endTimestamp":"2014-09-21T18:10:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5801","tags":["THEME_DEVELOP","TOPIC_BESTPRACTICE"],"color":null,"mainTag":"TOPIC_BESTPRACTICE","room":"accf3d0c"},{"speakers":["c9981173-759d-4156-bfe3-aed801c5f797"],"description":"While Android already provides easy and quick access to the existing camera application on a user's device, to fully integrate the camera into your application and user experience, to add your own custom filters and processing, to control the format and persistence of media, or to fully leverage new and advanced features such as metering and face detection, you may find yourself wanting to build a custom camera application.<br /><br />This session is for developers with Android experience (intermediate level and above) but who may not be familiar with the Camera API. During the session, we will run through an example of building a custom camera from scratch, from the basics of retrieving camera permissions and features, to properly controlling and working with the flow of the Camera class, to laying out and displaying camera previews, and finally accessing camera features. We will also talk about common issues you may encounter and other considerations to keep in mind while building a custom camera.","photoUrl":"http://static.sched.org/a4/1356594/avatar.jpg","url":"http://bit.ly/1w4Qj22","startTimestamp":"2014-09-21T18:20:00Z","title":"Building Custom Camera Applications","youtubeUrl":"","endTimestamp":"2014-09-21T19:00:00Z","hashtag":"androidnyc","isLivestream":false,"captionsUrl":"","id":"5802","tags":["THEME_DEVELOP"],"color":"#666666","room":"accf3d0c"}],"video_library":[],"hashtags":[{"color":"#303f9f","order":1,"name":"#androidnyc","description":"Android NYC is cool"},{"color":"#80cbc4","order":15,"name":"#androidnyc #Jamaoke","description":"Chat about the party"}],"experts":[],"rooms":[{"original_id":"c6bbd6c8-20f4-4715-87da-23ab00b33cd2","id":"c6bbd6c8","name":"Breakout - Upstairs Big"},{"original_id":"accf3d0c-094e-4220-8388-b5adf26c8f99","id":"accf3d0c","name":"Breakout - Main Floor"},{"original_id":"e16ec9a4-4a4c-4851-9bf0-7b1f0c703d05","id":"e16ec9a4","name":"Main Room"},{"original_id":"2ad2ca70-564c-4d46-acee-2563d1c299ff","id":"2ad2ca70","name":"Code Lab"},{"original_id":"5faad506-efba-4a61-8789-2b4e1934c2db","id":"5faad506","name":"Breakout - Upstairs Small"}],"tags":[{"category":"THEME","name":"Develop","abstract":"","tag":"THEME_DEVELOP","original_id":"2ade1c01-8ed0-e311-b297-00155d5066d7","order_in_category":2},{"category":"TOPIC","name":"TOPIC_ADVANCED","abstract":"","tag":"TOPIC_ADVANCED","original_id":"ffc20a9c-212f-4ccb-977c-65bc228e22ed","order_in_category":0},{"category":"TOPIC","name":"TOPIC_INTRO","abstract":"","tag":"TOPIC_INTRO","original_id":"a8748600-dd2f-43b4-87d4-7162d250a1d8","order_in_category":0},{"category":"TOPIC","name":"TOPIC_BLE","abstract":"","tag":"TOPIC_BLE","original_id":"4dd4523e-b467-4f85-bb26-671df9317172","order_in_category":0},{"category":"TOPIC","name":"Tools","abstract":"","color":"#607d8b","tag":"TOPIC_TOOLS","original_id":"eea54986-3688-e311-84db-00155d5066d7","order_in_category":13},{"category":"TOPIC","name":"UX","abstract":"","color":"#00897b","tag":"TOPIC_UX","original_id":"f2a54986-3688-e311-84db-00155d5066d7","order_in_category":14},{"category":"TOPIC","name":"TOPIC_HARDWARE","abstract":"","tag":"TOPIC_HARDWARE","original_id":"f06e2dfe-c6bf-4902-8dcb-c4c0d6cac232","order_in_category":0},{"category":"TOPIC","name":"TOPIC_KEYNOTE","abstract":"","tag":"TOPIC_KEYNOTE","original_id":"d4f10ca5-0eed-4b9f-a723-db61a577f5b5","order_in_category":0},{"category":"TOPIC","name":"TOPIC_BUILD","abstract":"","tag":"TOPIC_BUILD","original_id":"5a46f3e5-9d19-40c9-9e27-3b58a89d3daf","order_in_category":0},{"category":"TOPIC","name":"TOPIC_L","abstract":"","tag":"TOPIC_L","original_id":"35fba6ae-10bd-4f22-8a02-bf7a4eb70167","order_in_category":0},{"category":"TOPIC","name":"TOPIC_SECURITY","abstract":"","tag":"TOPIC_SECURITY","original_id":"47e1143a-8f9e-4e08-9c8b-46c68163bca6","order_in_category":0},{"category":"TOPIC","name":"TOPIC_GEO","abstract":"","tag":"TOPIC_GEO","original_id":"2c867b4c-0fb8-48f1-a11b-187dfde394db","order_in_category":0},{"category":"TOPIC","name":"TOPIC_UNJAVA","abstract":"","tag":"TOPIC_UNJAVA","original_id":"5d6c0ddf-4a93-44a4-9d5c-18320cf5137e","order_in_category":0},{"category":"TOPIC","name":"Wearables","abstract":"","color":"#ad1457","tag":"TOPIC_WEARABLES","original_id":"a1305602-3788-e311-84db-00155d5066d7","order_in_category":15},{"category":"THEME","name":"THEME_BUSINESS","abstract":"","tag":"THEME_BUSINESS","original_id":"4b38c979-56fa-4a12-ad0e-417068c5912c","order_in_category":0},{"category":"TOPIC","name":"TOPIC_VIDEO","abstract":"","tag":"TOPIC_VIDEO","original_id":"f698eb05-a006-4c43-bf04-e27e1aff29b6","order_in_category":0},{"category":"TOPIC","name":"TOPIC_THREADING","abstract":"","tag":"TOPIC_THREADING","original_id":"0118812f-87c9-4b62-a1cc-8ffd850d18bc","order_in_category":0},{"category":"THEME","name":"Design","abstract":"","tag":"THEME_DESIGN","original_id":"c120fdc1-8dd0-e311-b297-00155d5066d7","order_in_category":1},{"category":"TOPIC","name":"TOPIC_BESTPRACTICE","abstract":"","tag":"TOPIC_BESTPRACTICE","original_id":"7364ec39-7191-47a1-b8f2-5bc898d7148b","order_in_category":0}]}