{
 "sessions": [
  {
   "description": "We'll illustrate affordances on the Android platform that aid blind and low-vision users, and explain what application developers need to pay attention to in order to reach the widest possible user base.  The primary focus of this talk is making custom Android views accessible.",
   "title": "Enabling Blind and Low-Vision Accessibility On Android",
   "startTimestamp": 1.3687236E9,
   "presenterIds": [
    "112002168309662088574",
    "105214334373218557166",
    "103872873250909646668"
   ],
   "endTimestamp": 1.3687272E9,
   "subtype": "SESSION",
   "location": "Room 8",
   "isLivestream": false,
   "id": "258451203"
  },
  {
   "description": "Web Components are here to fundamentally change the way we think, build, and consume our web apps.  This session will prepare you for the future of the web platform by discussing the lower level technologies that form the basis of Web Components (Shadow DOM, \u003ctemplate\u003e, custom elements, MDV, new CSS primitives).  Many of these tools have already landed in a modern browser near you!",
   "title": "Web Components: A Tectonic Shift for Web Development",
   "startTimestamp": 1.3687281E9,
   "youtubeUrl": "FDEMA6OhvGo",
   "presenterIds": [
    "115935752075704261140"
   ],
   "endTimestamp": 1.3687305E9,
   "subtype": "SESSION",
   "location": "Room 10",
   "isLivestream": true,
   "id": "318907648"
  },
  {
   "description": "This session builds on technologies and concepts discussed in a previous session, \"Web Components: a tectonic shift for web development\". This year web development gets a whole lot better thanks to the incredible power of Web Components. Our goal in this session is to show you how to use polyfills to help you realize tomorrow's web platform today. As browsers implement these new specifications, that shim layer gets smaller, better, and faster over time. We'll talk about shadow DOM, custom elements, declarative data/event binding, touch input, smooth animations, and how you can combine them to create awesome apps. Write less boilerplate, target every platform, and be more productive by using the next generation of the web platform.",
   "title": "Web Components in Action",
   "startTimestamp": 1.3687335E9,
   "youtubeUrl": "FDEMA6OhvGo",
   "presenterIds": [
    "104905409446591990813",
    "101770524855203737699"
   ],
   "endTimestamp": 1.3687359E9,
   "subtype": "SESSION",
   "location": "Room 10",
   "isLivestream": true,
   "id": "324149970"
  },
  {
   "description": "In an ideal world, we would always use feature detection to decide what features to serve our users. Unfortunately, in the real world, there are practical problems with that approach, especially when facing users on mobile devices where you need to evaluate their runtime capabilities while you're serving assets.\r\nIn this talk, I'll introduce the ideas and tools behind feature detection and then discuss our experiences with detecting the edge of the web at Coursera.",
   "title": "Feature Detection in the Real World",
   "startTimestamp": 1.3688244E9,
   "presenterIds": [
    "104906919451670502090",
    "104337450658946893583"
   ],
   "endTimestamp": 1.3688268E9,
   "subtype": "SESSION",
   "location": "Room 10",
   "isLivestream": false,
   "id": "324431569"
  },
  {
   "description": "A fundamental necessity for innovation within web apps is fast execution speed. This talk will take a deep dive into the machine rooms of both V8 and the Dart VM and explain some of the reasons why a new execution engine is needed for taking the web platform to the next level. Please join us to hear about how programming languages impact the underlying virtual machines, complexity, on-the-fly code generation, and predictable performance.",
   "title": "Web Languages and VMs: Fast Code is Always in Fashion",
   "startTimestamp": 1.3687236E9,
   "youtubeUrl": "FDEMA6OhvGo",
   "presenterIds": [
    "114041237593092466630",
    "116414339457105695750"
   ],
   "endTimestamp": 1.3687272E9,
   "subtype": "SESSION",
   "location": "Room 10",
   "isLivestream": true,
   "id": "324431687"
  },
  {
   "description": "A high-level view of everything that's now available as part of Google Play services since it's launch, with a special focus on how this affects you as a developer - and what you should be paying attention to.",
   "title": "What's New in Google Play Services",
   "startTimestamp": 1.3687335E9,
   "youtubeUrl": "hXPAXKb-LQE",
   "presenterIds": [
    "105071583660289601573",
    "110213546195618582506",
    "101621607973398200534"
   ],
   "endTimestamp": 1.3687359E9,
   "subtype": "SESSION",
   "location": "Room 12",
   "isLivestream": true,
   "id": "324498944"
  },
  {
   "description": "It's tempting to view CSS optimization as a dark art, for initiates only.  This session will focus on identifying and resolving slow renders, with an emphasis on layout and paint times.  We'll use Chrome DevTools to find, benchmark, and debug slowness in the render-side of an application.  Uncovering a number of sluggish culprits, we'll explore where the time is spent and dig into profiling data from Chrome's internals. You'll walk away with a better understanding of how to use your time wisely while making your application scream with speed, and smart workarounds that address common CSS performance problems.",
   "title": "True Grit: Debugging CSS & Render Performance",
   "startTimestamp": 1.36875E9,
   "youtubeUrl": "FDEMA6OhvGo",
   "presenterIds": [
    "108084063591418803096"
   ],
   "endTimestamp": 1.3687524E9,
   "subtype": "SESSION",
   "location": "Room 10",
   "isLivestream": true,
   "id": "324511365"
  },
  {
   "description": "Building for today's mobile web, getting 60fps across all target devices, while still delivering a fantastic user experience is a huge challenge. We'll dive into all the tools for development, testing, and performance evaluation of mobile webapps. Understand how best to develop with immediate feedback from the mobile devices you're targetting, scale up complexity to avoid hard performance decisions later. We'll also review all the possibilities of device testing locally and in the cloud.\r\nIn this session we'll debut improved remote debugging with Chrome for Android and the Chrome DevTools. You can now do local tunneling for improved local development.\r\nYou'll walk away from the session with a solid overview of the landscape of mobile web tooling and feel confident returning to your projects.\r\n",
   "title": "The Modern Workflow for Developing the Mobile Web",
   "startTimestamp": 1.3686582E9,
   "youtubeUrl": "2OgAetgR_ok",
   "presenterIds": [
    "109240440276013084198"
   ],
   "endTimestamp": 1.3686606E9,
   "subtype": "SESSION",
   "location": "Room 10",
   "isLivestream": true,
   "id": "324558168"
  },
  {
   "description": "An in-depth tour of the Android development tools, with a closer look at everything new - along with tips and tricks for getting the most out of them.",
   "title": "What's New in Android Developer Tools",
   "startTimestamp": 1.3686471E9,
   "youtubeUrl": "XclVwJP5GdM",
   "presenterIds": [
    "100701783247287403697",
    "107680238815246720741"
   ],
   "endTimestamp": 1.3686507E9,
   "subtype": "SESSION",
   "location": "Room 12",
   "isLivestream": true,
   "id": "324603352"
  },
  {
   "description": "The web continues to evolve at an accelerated rate. It's hard to keep up! This session will cover the bleeding-edge features of HTML5 that you may have missed, focusing on features that make developers' lives easier and apps more powerful. A heavy focus will be on freshly landed CSS/JS/HTML primitives which address layout, performance, and specific use cases...especially on mobile: @viewport, @supports, intrinsic/viewport units, resolution & pointer media queries, User/Resource Timing APIs, JS i18n API, iframe goodies, \u003ctemplate\u003e, \u003cdialog\u003e, and more.",
   "title": "A More Awesome Web: Features You've Always Wanted",
   "startTimestamp": 1.3686543E9,
   "youtubeUrl": "2OgAetgR_ok",
   "presenterIds": [
    "115935752075704261140"
   ],
   "endTimestamp": 1.3686567E9,
   "subtype": "SESSION",
   "location": "Room 10",
   "isLivestream": true,
   "id": "324706714"
  },
  {
   "description": "Learn how to add Google+ Sign-In to your Android app, grow your installed base using OTA installs, drive more engagement using interactive posts, and monitor your apps' performance on Google+.",
   "title": "Google+ Sign-In for Android Developers",
   "startTimestamp": 1.36875E9,
   "presenterIds": [
    "109074716522478685421",
    "114522693111049778975"
   ],
   "endTimestamp": 1.3687524E9,
   "subtype": "SESSION",
   "location": "Room 5",
   "isLivestream": false,
   "id": "324806378"
  },
  {
   "description": "Hey, mobile game developers! Wondering what Google's been working on to make life better for you? Drop by the New Developments in Mobile Gaming talk and hear about the latest features we've been building to give your mobile games a little extra moxie. ",
   "title": "New Developments in Mobile Gaming",
   "startTimestamp": 1.3686513E9,
   "youtubeUrl": "XclVwJP5GdM",
   "presenterIds": [
    "106984250202070192646",
    "105928623565048508399",
    "107421292958031479580"
   ],
   "endTimestamp": 1.3686537E9,
   "subtype": "SESSION",
   "location": "Room 12",
   "isLivestream": true,
   "id": "324858737"
  },
  {
   "description": "Google Cloud Messaging allows your services to efficiently send data to applications on Android devices. See what's new, and learn how to use GCM to make your apps more efficient.",
   "title": "Google Cloud Messaging",
   "startTimestamp": 1.3687368E9,
   "youtubeUrl": "hXPAXKb-LQE",
   "presenterIds": [
    "107175595680176247534"
   ],
   "endTimestamp": 1.3687392E9,
   "subtype": "SESSION",
   "location": "Room 12",
   "isLivestream": true,
   "id": "324893448"
  },
  {
   "description": "Take advantage of the lessons learned by the developers of Find Your Way to Oz. Getting that last ounce of performance from your application takes careful optimization that can only be done with an understanding of the runtime environment. Learn how to dig into V8 and surface the important signals that you need to effectively optimize your program. Use these signals to find where small code changes can have large impacts on performance!",
   "title": "Accelerating Oz with V8: Follow the Yellow Brick Road to JavaScript Performance",
   "startTimestamp": 1.3687368E9,
   "youtubeUrl": "FDEMA6OhvGo",
   "presenterIds": [
    "104599836482299606155"
   ],
   "endTimestamp": 1.3687392E9,
   "subtype": "SESSION",
   "location": "Room 10",
   "isLivestream": true,
   "id": "324908972"
  },
  {
   "description": "Thousands of developers monetize apps on Google Play through try-and-buy, virtual goods, as well as subscriptions. Learn how to leverage the more robust (and simpler!) new generation of the Android in-app billing API that makes implementations easier to write and maintain. Familiarity with earlier versions not required. We will cover: availability, purchase flow, subscriptions, consumption models, and security best practices.",
   "title": "In-App Billing Version 3",
   "startTimestamp": 1.3686642E9,
   "presenterIds": [
    "111847972354240994758"
   ],
   "endTimestamp": 1.3686666E9,
   "subtype": "SESSION",
   "location": "Room 5",
   "isLivestream": false,
   "id": "324958374"
  },
  {
   "description": "With Daydream, new in Android 4.2, an idle or docked device becomes an opportunity for your app to delight the user. But where did this feature come from? Should your app support Daydream? How easy is it to add a Daydream? How can you make yours more fun and engaging? Answers to these questions—plus plenty of ideas and sample code—will be provided for daydreamers attending this session.",
   "title": "Androids Do Daydream",
   "startTimestamp": 1.3686612E9,
   "youtubeUrl": "XclVwJP5GdM",
   "presenterIds": [
    "110215737433639737305"
   ],
   "endTimestamp": 1.3686636E9,
   "subtype": "SESSION",
   "location": "Room 12",
   "isLivestream": true,
   "id": "324958375"
  },
  {
   "description": "Chrome implements fast, powerful webpage rendering by using the graphics hardware (GPU). But powerful GPU rendering introduces a new suite of issues that web developers need to understand. For example, how often is the texture cache invalidated? How can using translate-z cause GPU performance issues? How do hidden divs affect the GPU compositing process? \r\n\r\nAttendees will walk away with a clear understanding of the GPU compositor in Chrome and knowledge of how their design choices will impact a page's performance on devices with GPU compositing.",
   "title": "Web Page Design with the GPU in Mind",
   "startTimestamp": 1.3687281E9,
   "presenterIds": [
    "111075169981590729371",
    "101359714341338829292"
   ],
   "endTimestamp": 1.3687305E9,
   "subtype": "SESSION",
   "location": "Room 6",
   "isLivestream": false,
   "id": "325091862"
  },
  {
   "description": "Users expect a fast and optimized experience regardless of whether they're on a mobile or desktop browser. However, delivering a fast mobile experience requires careful consideration and engineering: you need to optimize your network access, you need to prioritize critical assets to deliver the best visual rendering performance, and you need to adapt your pages to the capabilities of the device (such as smaller viewport, touch, high-resolution screens, etc.). In this session we will take a deep technical dive into the criteria that affect the performance of your sites on mobile browsers, and discuss how you can optimize your site to deliver the best experience to your users.",
   "title": "Instant Mobile Websites: Techniques and Best Practices",
   "startTimestamp": 1.3686513E9,
   "presenterIds": [
    "116111176870124899127",
    "101170678775634557153",
    "117096918686526001168"
   ],
   "endTimestamp": 1.3686537E9,
   "subtype": "SESSION",
   "location": "Room 6",
   "isLivestream": false,
   "id": "325128936"
  },
  {
   "description": "Build intuitive and compelling mobile map apps with the Google Maps Android API. This session will demonstrate innovative ways to integrate maps and Android sensors with Google services on Android. We will explore concepts on visualizing contextual, personalized and timely information.",
   "title": "When Android Meets Maps",
   "startTimestamp": 1.3687434E9,
   "presenterIds": [
    "105886400209166952608",
    "102186751610427425012"
   ],
   "endTimestamp": 1.3687458E9,
   "subtype": "SESSION",
   "location": "Room 5",
   "isLivestream": false,
   "id": "325172829"
  },
  {
   "description": "As the complexity of the web apps you build keeps moving, so do the Chrome DevTools.  We'll give you the latest update on your favorite companion; explore new features like emulating mobile devices, remote debugging, Canvas and WebGL profiling, Sass preprocessor support, developing completely within Chrome using the new Workspaces support, and 20 other features that are brand-new to you and will hugely improve your development. Also, learn how to profile and improve your #1 enemy to scrolling performance: paint. Emulate mobile devices within Chrome DevTools with simulated touch events and geolocation data. You'll walk out of the session with a huge advantage in productivity, speed, and precision when developing, debugging, and improving your web applications.",
   "title": "Chrome DevTools Revolutions 2013 ",
   "startTimestamp": 1.3687401E9,
   "youtubeUrl": "FDEMA6OhvGo",
   "presenterIds": [
    "104337450658946893583",
    "109043361748922291889"
   ],
   "endTimestamp": 1.3687425E9,
   "subtype": "SESSION",
   "location": "Room 10",
   "isLivestream": true,
   "id": "325206725"
  },
  {
   "description": "Introducing the new Gradle-based Android SDK build system that will eventually replace Ant and the Eclipse builders. It brings extensibility, dependency management, IDE integration, testing support and advanced features. We will teach you everything from the basic setup to advanced configuration and customization.",
   "title": "The New Android SDK Build System",
   "startTimestamp": 1.3688064E9,
   "presenterIds": [
    "100701783247287403697"
   ],
   "endTimestamp": 1.3688088E9,
   "subtype": "SESSION",
   "location": "Room 5",
   "isLivestream": false,
   "id": "325236644"
  },
  {
   "description": "Learn how to take your game to the next level on Google Play. Our annual game talk, with ways to power up your distribution, user acquisition, and retention. Earn the “Gold Rush” achievement. Score three stars in quality and be one of the featured games on Google Play.",
   "title": "Level Up Your Android Game",
   "startTimestamp": 1.3686642E9,
   "youtubeUrl": "XclVwJP5GdM",
   "presenterIds": [
    "110995114359489245975",
    "104697420032137738545"
   ],
   "endTimestamp": 1.3686666E9,
   "subtype": "SESSION",
   "location": "Room 12",
   "isLivestream": true,
   "id": "325240798"
  },
  {
   "description": "Volley is a library that makes networking for Android apps easier and most importantly, faster. We'll give an overview of how it works, common patterns that work well with it, and a walkthrough of how you can easily load thumbnail images for your ListView from the network in parallel.",
   "title": "Volley: Easy, Fast Networking for Android",
   "startTimestamp": 1.3686582E9,
   "youtubeUrl": "XclVwJP5GdM",
   "presenterIds": [
    "108275493884838222332"
   ],
   "endTimestamp": 1.3686606E9,
   "subtype": "SESSION",
   "location": "Room 12",
   "isLivestream": true,
   "id": "325304728"
  },
  {
   "description": "We used to develop websites solely for desktop users. Today, we also develop for mobile devices, and who knows what new form factors will follow tomorrow. How are you expected to cope with many different constraints, and what are the right ways for approaching device agnostic development?",
   "title": "Device Agnostic Development",
   "startTimestamp": 1.3688199E9,
   "presenterIds": [
    "102813120987797040209",
    "109382476609973360727"
   ],
   "endTimestamp": 1.3688223E9,
   "subtype": "SESSION",
   "location": "Room 10",
   "isLivestream": false,
   "id": "325310259"
  },
  {
   "description": "Come learn about the Google PageSpeed family: \r\n(a) Insights products to help identify performance problems (through browser extensions, online, and API). \r\n(b) Automagic optimization: open-source Apache and Nginx PageSpeed plugins that can optimize your site for you. See hands on examples, stats and case studies from partners (AOL, and few others).\r\n(c) PageSpeed Service: explanation of the Google hosted web optimization product. See examples of advanced integrations with other Google products (e.g. App Engine, A/B testing with Google Analytics, etc). \r\n(d) Chrome data compression: an under the hood look at how Chrome leverages pagespeed to optimize pages on the fly and provides up to 50% bandwidth improvement for mobile browsers!",
   "title": "Automating Performance Best Practices with PageSpeed",
   "startTimestamp": 1.3686642E9,
   "youtubeUrl": "2OgAetgR_ok",
   "presenterIds": [
    "103532563190745371016"
   ],
   "endTimestamp": 1.3686666E9,
   "subtype": "SESSION",
   "location": "Room 10",
   "isLivestream": true,
   "id": "325313237"
  },
  {
   "description": "Location is not only at the heart of maps, but increasingly it's becoming critical to a new generation of contextual apps that are more aware of where the user is and what they're doing. Join us as we explore some of the new applications these APIs make possible.",
   "title": "Beyond the Blue Dot: New Features in Android Location",
   "startTimestamp": 1.3687281E9,
   "youtubeUrl": "hXPAXKb-LQE",
   "presenterIds": [
    "116925039230405927608",
    "114799280971989278080"
   ],
   "endTimestamp": 1.3687305E9,
   "subtype": "SESSION",
   "location": "Room 12",
   "isLivestream": true,
   "id": "325337477"
  },
  {
   "description": "From infrastructure to game logic, writing a multi-player game can be challenging. We will look at techniques to solve common problems when writing multi-player games for Android.",
   "title": "Mobile Multiplayer Made Manageable",
   "startTimestamp": 1.3686582E9,
   "presenterIds": [
    "111847972354240994758",
    "102169232131428342982",
    "113892984011028068483"
   ],
   "endTimestamp": 1.3686606E9,
   "subtype": "SESSION",
   "location": "Room 5",
   "isLivestream": false,
   "id": "325345389"
  },
  {
   "description": "With the Google Drive SDK, developers can integrate custom \"Create\" and \"Open With\" menus within the Google Drive interface and reach tens of millions of users. Using Apps Script API in conjunction with the Google Drive SDK, developers can take advantage of the unique capabilities of Apps Script while also developing entirely on the Google Cloud! We will also demonstrate how you can get programmatic access to files and folders in Drive via Apps Script. ",
   "title": "Integrate Google Drive with Google Apps Script",
   "startTimestamp": 1.3687368E9,
   "presenterIds": [
    "111784658684387563624",
    "108994984878629445066"
   ],
   "endTimestamp": 1.3687392E9,
   "subtype": "SESSION",
   "location": "Room 8",
   "isLivestream": false,
   "id": "325412094"
  },
  {
   "description": "Engineers from the Android UI Graphics team will show some tips, tricks, tools, and techniques for getting the best performance and smoothest UI for your Android applications.",
   "title": "Android Graphics Performance",
   "startTimestamp": 1.3687401E9,
   "youtubeUrl": "hXPAXKb-LQE",
   "presenterIds": [
    "117594266474214732305",
    "110205796080571131737"
   ],
   "endTimestamp": 1.3687425E9,
   "subtype": "SESSION",
   "location": "Room 12",
   "isLivestream": true,
   "id": "325418001"
  },
  {
   "description": "Develop large apps in a structured language and still experience fast Edit/Reload development cycles? Indeed, the prophecy has come true. Get crazy productive with Dart's tools, smooth HTML libraries, cross-browser polyfills, and web components based framework. Come learn how you can easily and quickly develop web apps that work cross-browser on both desktop and mobile platforms. We'll show you how to build modern web apps with Web Components and dynamic data-driven views without having to wait for cumbersome compile cycles. Make a change, hit reload, and boom, it's ready for all modern browsers.",
   "title": "Dart: HTML of the Future, Today!",
   "startTimestamp": 1.3687434E9,
   "presenterIds": [
    "111365150586542265776",
    "109774955499394750474"
   ],
   "endTimestamp": 1.3687458E9,
   "subtype": "SESSION",
   "location": "Room 6",
   "isLivestream": false,
   "id": "325433525"
  },
  {
   "description": "Come see what's new in Dart with its comprehensive, open-source ecosystem for the modern web developer. Learn how to be more productive with a new language: future-based DOM, package manager, JS-interop, a tree-shaking compiler to JavaScript, SIMD, Web Components, a rich editor, and much more. You'll leave this talk all caught up with Dart and ready to make the web awesome.",
   "title": "What's New in Dart: Your First-class Upgrade to Web Development",
   "startTimestamp": 1.3687335E9,
   "presenterIds": [
    "105034695982598329374",
    "113037347177808551648"
   ],
   "endTimestamp": 1.3687359E9,
   "subtype": "SESSION",
   "location": "Room 6",
   "isLivestream": false,
   "id": "325475052"
  },
  {
   "description": "YouTube recently launched several new APIs (Data API V3, Analytics API, Android Player API) and mobile developers have much easier time integrating the world's video platform into their application. Learn about the best practices and see cool examples from innovators in this area. ",
   "title": "Mobile Development With YouTube APIs: Best Practices",
   "startTimestamp": 1.3686582E9,
   "presenterIds": [
    "102206255324090806743",
    "107670600469475289816"
   ],
   "endTimestamp": 1.3686606E9,
   "subtype": "SESSION",
   "location": "Room 3",
   "isLivestream": false,
   "id": "325518206"
  },
  {
   "description": "Automatic garbage collection in JavaScript isn't a substitute for effective memory management, especially in large, long-running web apps.  Memory leaks, frequent garbage collection pauses, and overall memory bloat can really drag you down.  Come take a trip down memory lane with us and learn how we tackled these performance issues in Gmail.  We'll share best practices for memory management and demonstrate how to use the Chrome DevTools Heap Profiler like a wizard to optimize your site.",
   "title": "A Trip Down Memory Lane with Gmail and DevTools",
   "startTimestamp": 1.3686582E9,
   "presenterIds": [
    "104599836482299606155",
    "107923693443531403563"
   ],
   "endTimestamp": 1.3686606E9,
   "subtype": "SESSION",
   "location": "Room 6",
   "isLivestream": false,
   "id": "325547004"
  },
  {
   "description": "Video stabilization is a key component of YouTube's video enhancement tools and youtube.com/editor. All YouTube uploads are automatically detected for shakiness and suggested stabilization if needed. This talk will describe the technical details behind our fully automatic one-click stabilization technology, including aspects such as camera path optimization, rolling shutter detection and removal, distributed computing for real-time previews, and camera shake detection. More info: http://googleresearch.blogspot.com/2012/05/video-stabilization-on-youtube.html",
   "title": "Secrets of Video Stabilization on YouTube",
   "startTimestamp": 1.3687401E9,
   "presenterIds": [
    "113959972153244849133",
    "108413671848199083683",
    "109031320580712810427"
   ],
   "endTimestamp": 1.3687425E9,
   "subtype": "SESSION",
   "location": "Room 3",
   "isLivestream": false,
   "id": "325566030"
  },
  {
   "description": "Ever try buying something on the mobile web? Combine a mess of form fields and a soft keyboard and it's more frustrating than it needs to be. How many customers don’t buy things from you because doing so is just too much work?  requestAutocomplete() is an aspiring web standard that will allow users to bypass pages of form fields with an imperative API for requesting details the browser knows. In this session we'll highlight how to enhance your site with requestAutocomplete(), how to quickly implement the feature, and what to consider when optimizing the UX of your ecommerce experience.",
   "title": "Standardizing Payments on the Web: Introducing requestAutocomplete()",
   "startTimestamp": 1.3686612E9,
   "youtubeUrl": "2OgAetgR_ok",
   "presenterIds": [
    "103881590032789172511",
    "104222847633329596702"
   ],
   "endTimestamp": 1.3686636E9,
   "subtype": "SESSION",
   "location": "Room 10",
   "isLivestream": true,
   "id": "325582998"
  },
  {
   "description": "The mobile web is accelerating more rapidly than ever!  This session will show you the bleeding edge of the mobile web, enabling you to take your mobile sites and apps to the next level.  We will dive into features that you never thought you could enable in a mobile browser and give you practical advice for the year ahead.",
   "title": "Mobile HTML: The Future of Your Sites",
   "startTimestamp": 1.3687368E9,
   "presenterIds": [
    "109382476609973360727",
    "112427496122904544974"
   ],
   "endTimestamp": 1.3687392E9,
   "subtype": "SESSION",
   "location": "Room 6",
   "isLivestream": false,
   "id": "325586817"
  },
  {
   "description": "While the Android framework provides a number of layouts and prebuilt composable pieces for building UIs, targeted optimization or building unique hero moments often means writing custom views. We'll show you how the measurement and layout process works and patterns for advanced touch processing.",
   "title": "Writing Custom Views for Android",
   "startTimestamp": 1.3686543E9,
   "youtubeUrl": "XclVwJP5GdM",
   "presenterIds": [
    "102958174183527610783",
    "110205796080571131737"
   ],
   "endTimestamp": 1.3686567E9,
   "subtype": "SESSION",
   "location": "Room 12",
   "isLivestream": true,
   "id": "325615129"
  },
  {
   "description": "Built by the Creative Labs team in London, Jam with Chrome was a hugely successful Chrome experiment that allowed users to form a band from nearly anywhere in the world and \"Jam\" like stars in near real-time. We will show you how we built Jam with Chrome using the latest web technologies and give you practical advice and guidance on how you can do the same. We will focus on the Real time WebSockets component, the session management system, and the music engine made using the Web Audio API--come learn how to \"Jam.\"",
   "title": "JAM with Chrome: How We Built a Massive Multiplayer Music Application Using Only Web Technology",
   "startTimestamp": 1.3686471E9,
   "presenterIds": [
    "113351182668525148145",
    "106409898131677148464",
    "107623887044175086201"
   ],
   "endTimestamp": 1.3686507E9,
   "subtype": "SESSION",
   "location": "Room 6",
   "isLivestream": false,
   "id": "325619051"
  },
  {
   "description": "Did you know that YouTube automatically classifies videos based on the Freebase Open Knowledge Graph topics that they relate to? We'll talk more about how we pull off this feat of classification, as well as how you can use topics to power YouTube API searches or find related videos.",
   "title": "Semantic Video Annotations in the YouTube Topics API: Theory and Applications",
   "startTimestamp": 1.3686543E9,
   "presenterIds": [
    "105399359960308199812",
    "113887203771632062458"
   ],
   "endTimestamp": 1.3686567E9,
   "subtype": "SESSION",
   "location": "Room 3",
   "isLivestream": false,
   "id": "325633064"
  },
  {
   "description": "Building web applications often means utilizing other libraries, frameworks, and plugins. Using a package manager to mange this greatly improves your productivity, enhances the speed and security of your application, and makes it much easier to stay up to date. Forget tracking new releases of libraries on blogs/Twitter, manually downloading dependent scripts, and managing the files and folders of libraries you use. With package management, keeping your dependencies updated and discovering new and related projects becomes straight-forward. In this session, we'll dive into the value of client-side package management and bring you up to speed with the open source package manager Bower, which offers a rich ecosystem of packages. Plus, learn about the useful integrations with Yeoman, Grunt, RequireJS, and NPM. ",
   "title": "Clientside Package Management: Less Work, More Awesome",
   "startTimestamp": 1.3688136E9,
   "presenterIds": [
    "104337450658946893583",
    "116035920865350127077"
   ],
   "endTimestamp": 1.368816E9,
   "subtype": "SESSION",
   "location": "Room 10",
   "isLivestream": false,
   "id": "325634001"
  },
  {
   "description": "Since 2011, NativeClient (NaCl) has been a feature of Chrome available through the Chrome Web Store.\r\n\r\nPNaCl is the next exciting step for this technology.  It continues Native Client's compatibility with developers' existing codebases and near native-code performance, but brings this to the open web in a truly portable fashion.  The technology is built around the open source LLVM compiler infrastructure. This technology enables application developers to build both web and Chrome Web Store applications that work on Windows, OS X, Linux, and ChromeOS for x86 and ARM.",
   "title": "Introduction to Portable Native Client (PNaCl)",
   "startTimestamp": 1.36875E9,
   "presenterIds": [
    "108394971971967673680"
   ],
   "endTimestamp": 1.3687524E9,
   "subtype": "SESSION",
   "location": "Room 6",
   "isLivestream": false,
   "id": "325679543"
  },
  {
   "description": "According to Cisco, video data will be 55 percent of all consumer Internet traffic by 2016. With that much data traversing networks, efficient video compression will be more important than ever, especially on mobile networks. We are very excited about the new VP9 codec, which delivers better video quality at lower data rates than competing technologies. Furthermore, VP9 was developed entirely in the open as a royalty-free technology. In this session you will learn how VP9 performs against H.264 and other other codecs in quality and decoding speed, how to create WebM videos with VP9 and the new Opus audio codec, and how to deploy VP9 content to Chrome users in HTML5 \u003cvideo\u003e. ",
   "title": "WebM and the New VP9 Open Video Codec",
   "startTimestamp": 1.3686471E9,
   "presenterIds": [
    "115417828578229251513"
   ],
   "endTimestamp": 1.3686507E9,
   "subtype": "SESSION",
   "location": "Room 4",
   "isLivestream": false,
   "id": "325741299"
  },
  {
   "description": "We'll cover the design decisions that drove creating AngularJS, the JavaScript framework that combines data binding, reusable components, dependency injection, and a host of other powerful capabilities for building modern web applications. Come join us and learn how to build extremely scalable applications that are fast to build, trivial to change and maintain, easy to test, and that clearly express your intent to all developers on your team.",
   "title": "Design Decisions in AngularJS",
   "startTimestamp": 1.3686543E9,
   "presenterIds": [
    "114500255365628569765",
    "101358417373068648175"
   ],
   "endTimestamp": 1.3686567E9,
   "subtype": "SESSION",
   "location": "Room 6",
   "isLivestream": false,
   "id": "325881193"
  },
  {
   "description": "Animations and scrolling at 60FPS: difficult! Let's talk about rendering performance by way of a couple case studies. We'll cover the basic challenge of smooth animation, approaches to finding the bottleneck in your application using Dev Tools, and methods to cope with some common pitfalls. Topics include Dev Tools rendering features, subtleties of CSS animation, common cases that kill scrolling performance, and a peak into the hardware acceleration model that underpins Chrome's graphics pipeline.",
   "title": "Jank Free: Chrome Rendering Performance",
   "startTimestamp": 1.3686513E9,
   "youtubeUrl": "2OgAetgR_ok",
   "presenterIds": [
    "104340296164980931545",
    "101025288539257653872"
   ],
   "endTimestamp": 1.3686537E9,
   "subtype": "SESSION",
   "location": "Room 10",
   "isLivestream": true,
   "id": "325933151"
  },
  {
   "description": "The future platform for reading is mobile. Creating a compelling digital magazine experience requires taking advantage of leading web platform features. CSS filters bring powerful creative control for content and now take advantage of GPUs on mobile devices. This session will cover content creation for state of the art digital documents explaining how these features work, best practices for performance, packaging for deployment and integration with other cutting edge CSS features.",
   "title": "Stunning Mobile Visualization with CSS Filters",
   "startTimestamp": 1.3687236E9,
   "presenterIds": [
    "114687813172698332368",
    "110004786915373318047"
   ],
   "endTimestamp": 1.3687272E9,
   "subtype": "SESSION",
   "location": "Room 6",
   "isLivestream": false,
   "id": "325944029"
  },
  {
   "description": "It’s not that hard to play a background soundtrack in your mobile game app, or to play short clips of sound in response to user actions. But how about responsive reliable audio, that doesn’t glitch, works well across a range of devices, and doesn’t eat up your user’s battery? Oh, and is lower latency too? It turns out that’s not so easy. We’ll share our own experiences with the Android platform and apps, discuss the problem areas and the work we’ve been doing in the platform, and give some techniques you can apply now in your own apps. We assume you’re familiar with OpenSL ES and audio terminology.",
   "title": "High Performance Audio",
   "startTimestamp": 1.3687467E9,
   "presenterIds": [
    "104834035110555747685",
    "111530937453777366891",
    "101288802339116471976"
   ],
   "endTimestamp": 1.3687491E9,
   "subtype": "SESSION",
   "location": "Room 5",
   "isLivestream": false,
   "id": "325993827"
  },
  {
   "description": "Take advantage of the Android platform to create a world-class app. We will use Gmail as an example, walk through platform features, and provide example code. This talk will enable you to leverage the platform, reduce effort, and improve the app experience.",
   "title": "Taking Advantage of Android Platform Features",
   "startTimestamp": 1.3688208E9,
   "presenterIds": [
    "109073346802755138650",
    "103241827073768415543"
   ],
   "endTimestamp": 1.3688232E9,
   "subtype": "SESSION",
   "location": "Room 12",
   "isLivestream": false,
   "id": "326148829"
  },
  {
   "description": "Design on Android is no longer a complex mystery of disjointed patterns; the Android design guidelines have paved the way for a design renaissance following the tenets of content forward and responsive mobile design. In this talk we'll explore the arsenal of tools available to Android UI engineers that let you implement some of these important guidelines, including responsive design with multi-pane layouts, metrics and layout grids, and core navigation components.",
   "title": "Android Design for UI Developers",
   "startTimestamp": 1.3687434E9,
   "youtubeUrl": "hXPAXKb-LQE",
   "presenterIds": [
    "118287924347242328050",
    "117783991067812351544"
   ],
   "endTimestamp": 1.3687458E9,
   "subtype": "SESSION",
   "location": "Room 12",
   "isLivestream": true,
   "id": "326204977"
  },
  {
   "description": "Opinions on Bluetooth can divide a crowd, but the technology can connect them back together. This is an end-to-end session that gives a brief overview of core specifications and profiles before diving into Android Bluetooth support, best practices for development (with examples), and some features you may not be aware of.",
   "title": "Best Practices for Bluetooth Development",
   "startTimestamp": 1.3686513E9,
   "presenterIds": [
    "111352917277688143084",
    "110213546195618582506",
    "118381509295078123900"
   ],
   "endTimestamp": 1.3686537E9,
   "subtype": "SESSION",
   "location": "Room 5",
   "isLivestream": false,
   "id": "326240948"
  },
  {
   "description": "Google TV gives developers a consistent Android platform to create and deliver applications, games and high quality media on the largest screen in the house.\r\nIn this session we'll show you how to unlock the potential of the current Google TV devices and explain the new features of the next generation Google TV platform.",
   "title": "Android: As seen on TV!",
   "startTimestamp": 1.3688136E9,
   "presenterIds": [
    "113281956708887239107"
   ],
   "endTimestamp": 1.368816E9,
   "subtype": "SESSION",
   "location": "Room 5",
   "isLivestream": false,
   "id": "326287482"
  },
  {
   "description": "Many commercially successful apps and games on Google Play share common attributes, including compelling application features, buyer profiles, and business models. In this session, we'll share what Google and developer partners have done to create successful monetization recipes. We'll also share our plans for further strengthening monetization on Google Play.",
   "title": "Making Money on Google Play",
   "startTimestamp": 1.3688136E9,
   "presenterIds": [
    "104528785054129030228",
    "102467645483316233207"
   ],
   "endTimestamp": 1.368816E9,
   "subtype": "SESSION",
   "location": "Room 12",
   "isLivestream": false,
   "id": "326291452"
  },
  {
   "description": "Life is simple when your app is simple. But when your apps gets more complex, how do you choose between spinners, tabs, and drawers for navigation? Members of the Android Design team look at techniques for making your app predictable and pleasing to use.",
   "title": "Structure in Android App Design",
   "startTimestamp": 1.3687401E9,
   "presenterIds": [
    "106292949290629367783",
    "104617628550655857095"
   ],
   "endTimestamp": 1.3687425E9,
   "subtype": "SESSION",
   "location": "Room 5",
   "isLivestream": false,
   "id": "326301704"
  },
  {
   "description": "As an Android application developer, your goal is to get your app discovered. Google Play’s goal is to surface the most relevant content for Android users. In this session, we discuss best practices for app creators in view of both goals. We will demonstrate, through concrete examples, best practices to help your application rise above others in the Google Play Store. We will discuss the signals that go into creating the top and trending lists, personalized recommendations, and Google Play Search. Come hear the inside story from the person who leads search & discovery on Google Play.",
   "title": "Getting Discovered on Google Play",
   "startTimestamp": 1.3688064E9,
   "presenterIds": [
    "112050136031367437844"
   ],
   "endTimestamp": 1.3688088E9,
   "subtype": "SESSION",
   "location": "Room 12",
   "isLivestream": false,
   "id": "326335584"
  },
  {
   "description": "WebRTC implements open standards for realtime, plugin-free video, audio and data communication.  The core WebRTC APIs – getUserMedia, RTCPeerConnection and DataChannel – have now been implemented across Chrome and Firefox.\r\nIn this session, we show you how to get started with building a WebRTC app:\r\n- what’s a MediaStream (aka getUserMedia) and how can I use it?\r\n- resolution constraints\r\n- signalling: what is it and how can I set it up?\r\n- servers: what do I need?\r\n- RTCPeerConnection: WebRTC’s most powerful API\r\n- RTCDataChannel: realtime communication of arbitrary data\r\n- integrating WebRTC with Web Audio\r\n- interoperability\r\n- security\r\n\r\nDuring the session, we talk through code examples, live demos and production apps.",
   "title": "Real-time communication with WebRTC",
   "startTimestamp": 1.3688172E9,
   "presenterIds": [
    "109281167003098778889",
    "106750565517687190132"
   ],
   "endTimestamp": 1.3688196E9,
   "subtype": "SESSION",
   "location": "Room 10",
   "isLivestream": false,
   "id": "326336563"
  },
  {
   "description": "Interested in expanding your app to a global audience, but don’t know where to start? In this session, we’ll show you how to prepare an app for global distribution. Come learn about best practices for internationalization, right-to-left language support, and various tools that can help you along the way.",
   "title": "Building Android Apps for a Global Audience",
   "startTimestamp": 1.3688172E9,
   "presenterIds": [
    "114946740160665159799",
    "113409256581492419872"
   ],
   "endTimestamp": 1.3688196E9,
   "subtype": "SESSION",
   "location": "Room 12",
   "isLivestream": false,
   "id": "326345917"
  },
  {
   "description": "Practical tips for game developers from insiders within the Android team, including how to work with the developer dashboard from the beginning of development through multiple releases.",
   "title": "Practical Android Games Development",
   "startTimestamp": 1.3686543E9,
   "presenterIds": [
    "104697420032137738545",
    "101263529057349062300",
    "110271595341998945783"
   ],
   "endTimestamp": 1.3686567E9,
   "subtype": "SESSION",
   "location": "Room 5",
   "isLivestream": false,
   "id": "326367481"
  },
  {
   "description": "Want to enchant people, simplify their lives, and make them feel amazing with your app? Learn how Android's Design Principles can help you create products that resonate with people. Find out about the meaning and research behind the principles. See real-world examples and practices from the Android Design team. Discover techniques for applying the principles in your daily work. No design experience necessary.",
   "title": "Enchant, Simplify, Amaze: Android's Design Principles",
   "startTimestamp": 1.3687335E9,
   "presenterIds": [
    "114397976386105019978",
    "116113208713530984235"
   ],
   "endTimestamp": 1.3687359E9,
   "subtype": "SESSION",
   "location": "Room 5",
   "isLivestream": false,
   "id": "326368573"
  },
  {
   "description": "Pull up a chair and join the Android platform team for a fireside chat. It's your opportunity to ask us about the platform and learn a little bit more about why things work the way they do, from the people who built it. \r\nModerated by Android Developer Advocate Reto Meier.",
   "title": "Fireside Chat with the Android Team",
   "startTimestamp": 1.36875E9,
   "youtubeUrl": "hXPAXKb-LQE",
   "presenterIds": [
    "105071583660289601573",
    "114397976386105019978",
    "111000777234093413004",
    "117460474504071547773",
    "100701783247287403697",
    "104362162557204314605",
    "105840614246873722149",
    "108275493884838222332",
    "110205796080571131737",
    "102958174183527610783",
    "101621607973398200534",
    "109362389478249494612"
   ],
   "endTimestamp": 1.3687524E9,
   "subtype": "SESSION",
   "location": "Room 12",
   "isLivestream": true,
   "id": "326425499"
  },
  {
   "description": "This talk will show various types of application animations and the code for how to achieve them. Developers should leave the presentation (not too quickly!) with more knowledge about how Android animations work, how to use the APIs effectively, and how to pull together various techniques to create more involved, more interesting and more compelling animations for their applications. ",
   "title": "A Moving Experience",
   "startTimestamp": 1.3687467E9,
   "youtubeUrl": "hXPAXKb-LQE",
   "presenterIds": [
    "110205796080571131737",
    "117594266474214732305"
   ],
   "endTimestamp": 1.3687491E9,
   "subtype": "SESSION",
   "location": "Room 12",
   "isLivestream": true,
   "id": "326431311"
  },
  {
   "description": "For game developers who want to dive into more advanced scenarios. Learn about new ways to integrate with Google+, implement and manage game states in a safe way and creating cool game experiences through select Google REST APIs. We will also cover new NDK topics, as well as using 3rd-party game engines.",
   "title": "Advanced Game Development Topics",
   "startTimestamp": 1.3686612E9,
   "presenterIds": [
    "101298717428027934793",
    "111847972354240994758"
   ],
   "endTimestamp": 1.3686636E9,
   "subtype": "SESSION",
   "location": "Room 5",
   "isLivestream": false,
   "id": "326445164"
  },
  {
   "description": "Learn how to use advanced Android techniques to build apps so good, people think they're magic. Featuring advanced coding tips and tricks, implementation patterns, and exposure to some of the lesser-known APIs, you'll gain insight into how to build context sensitive apps that delight your users without draining their battery.  ",
   "title": "Android Protips: Making Apps Work Like Magic",
   "startTimestamp": 1.3687236E9,
   "youtubeUrl": "hXPAXKb-LQE",
   "presenterIds": [
    "105071583660289601573"
   ],
   "endTimestamp": 1.3687272E9,
   "subtype": "SESSION",
   "location": "Room 12",
   "isLivestream": true,
   "id": "326454327"
  },
  {
   "description": "Publishing a new application on Google Play is just the beginning -- you work constantly to update your app, improve user reviews, see what users are doing with your app, expand into new markets, and build a revenue stream. Join the team who brought you the new Developer Console to learn how Google Play is bringing you more data to optimize your application, better tools to distribute your application, and new ways to understand and connect with your users along every step of the journey. ",
   "title": "What’s new for Developers in Google Play",
   "startTimestamp": 1.36881E9,
   "presenterIds": [
    "113761517808497411889",
    "112047163174328546591",
    "116692618012889487775"
   ],
   "endTimestamp": 1.3688124E9,
   "subtype": "SESSION",
   "location": "Room 12",
   "isLivestream": false,
   "id": "326455375"
  },
  {
   "description": "Google Maps and the Maps API enjoy huge popularity around the world. The Google Maps API is the most used API on the web. maps.google.com is the most used mapping site. Android and iOS SDKs are branching Maps out into new platforms. In this session, the Product Management Director of Google Maps teams with the Product Manager for the Google Maps API and the lead Developer Advocate to walk you into the future of Google Maps.",
   "title": "Google Maps: Into the Future",
   "startTimestamp": 1.3686471E9,
   "youtubeUrl": "2OgAetgR_ok",
   "presenterIds": [
    "115612609094437359963",
    "114882728068215941282"
   ],
   "endTimestamp": 1.3686507E9,
   "subtype": "SESSION",
   "location": "Room 10",
   "isLivestream": true,
   "id": "326458345"
  },
  {
   "description": "This session will provide an in-depth look at human perception and cognition, and its implications for interactive and visual design.  The human brain is purely treated as an information processing machine, and we will teach the audience its attributes, its advantages, its limitations, and generally how to hack it.  While the content will provide a deep review of recent cognitive science research, everything presented will also be grounded in example design work taken from a range of Google applications and platforms.  Specific topics will include: edge detection, gestalt laws of grouping, peripheral vision, geons and object recognition, facial recognition, color deficiencies, change blindness, flow, attention, cognitive load balancing, and the perception of time.",
   "title": "Cognitive Science and Design",
   "startTimestamp": 1.3687281E9,
   "presenterIds": [
    "102126763584778684691"
   ],
   "endTimestamp": 1.3687305E9,
   "subtype": "SESSION",
   "location": "Room 5",
   "isLivestream": false,
   "id": "326460111"
  },
  {
   "description": "In the Android UX team, it is critical to get user feedback frequently and consistently so that we are able to iterate and develop the best-in-class designs for our users.  We will discuss how the team applied \"Pulse Studies\" (iterative research sessions) in order to put new ideas, designs, and concepts in front of users on a regular basis; it requires minimal advance planning, it can have an immediate product impact, and it can meet urgent needs.  We will illustrate how we accomplished this collaborative process by presenting rich examples and case studies.  We will also demonstrate usability study role playing in order to give you tips and tricks on how to adopt this process for anyone who is interested in getting user feedback in a quick and impactful way.",
   "title": "Agile UX Research Practice in Android",
   "startTimestamp": 1.3687368E9,
   "presenterIds": [
    "110854577511922441759",
    "104045702212478127538"
   ],
   "endTimestamp": 1.3687392E9,
   "subtype": "SESSION",
   "location": "Room 5",
   "isLivestream": false,
   "id": "326483138"
  },
  {
   "description": "Chrome packaged apps expand the opportunities for Web developers, giving you the ability to run offline by default, to provide an immersive UX that runs outside the browser, to leverage Chrome's sync architecture, and to access the device hardware. Come learn how to take your web app to the next level by turning it into a Chrome packaged app.",
   "title": "Upgrading to a Chrome Packaged App",
   "startTimestamp": 1.3687467E9,
   "youtubeUrl": "FDEMA6OhvGo",
   "presenterIds": [
    "108906013437361310368"
   ],
   "endTimestamp": 1.3687491E9,
   "subtype": "SESSION",
   "location": "Room 10",
   "isLivestream": true,
   "id": "326973874"
  },
  {
   "description": "In December, Google launched the Google Maps SDK for iOS. With vector maps that allow a much wider range of motion and access to Google Map data and imagery, the SDK provides a powerful way for you to build iOS apps on your platform. This session will explore different ways for you to integrate your data with a Google Maps experience.",
   "title": "The Other Mobile Mapping Platform: Getting Your Maps into iOS",
   "startTimestamp": 1.3686642E9,
   "youtubeUrl": "aK2HXXF2jJw",
   "presenterIds": [
    "114882728068215941282",
    "115652729569082644519"
   ],
   "endTimestamp": 1.3686666E9,
   "subtype": "SESSION",
   "location": "Room 2",
   "isLivestream": true,
   "id": "327377399"
  },
  {
   "description": "Video is predicted to comprise 71 percent of all mobile data traffic by 2016 (Source: Cisco). Yet, surprisingly few people understand the formats that majority of that data traffic will use. In this session you will learn the skills required to encode or decode video in your application, with a focus on the royalty-free WebM format.",
   "title": "Demystifying Video Encoding: WebM/VP8 for the Rest of Us",
   "startTimestamp": 1.3687281E9,
   "presenterIds": [
    "113528314289920753212",
    "107970070961959749041"
   ],
   "endTimestamp": 1.3687305E9,
   "subtype": "SESSION",
   "location": "Room 3",
   "isLivestream": false,
   "id": "327435242"
  },
  {
   "description": "Meet the senior staff from the Web Platform team, the Front End/UI team, the Chrome Apps team, and the Chrome OS team. At this talk, you'll hear senior Chrome developers talk about future plans for Chrome and the web platform. You'll have the opportunity to ask them as many difficult questions as can fit in the time available!",
   "title": "Fireside Chat with the Chrome Team",
   "startTimestamp": 1.368828E9,
   "presenterIds": [
    "110923303051376736915",
    "113390235998969869149",
    "114041237593092466630",
    "116209747985833194860",
    "111925938588766096423",
    "102015190700889612114",
    "103137355052454859724",
    "101323778908970829584",
    "107703401167120146751",
    "104905409446591990813"
   ],
   "endTimestamp": 1.3688304E9,
   "subtype": "SESSION",
   "location": "Room 5",
   "isLivestream": false,
   "id": "327449685"
  },
  {
   "description": "Location continues to play an increasingly important role in a variety of organizations, and the emergence of the cloud and mobile as reliable and scalable platforms has transformed how organizations use mapping technology to work more effectively, improve processes, and benefit customers.  Learn about the different use cases that our enterprise products address and how organizations can easily integrate end-to-end mapping solutions to address a variety of needs.",
   "title": "Our Maps, Your Business: A Step by Step Guide to Making the Most of Our Enterprise Products",
   "startTimestamp": 1.3687467E9,
   "presenterIds": [
    "115612609094437359963",
    "112506701306897158782"
   ],
   "endTimestamp": 1.3687491E9,
   "subtype": "SESSION",
   "location": "Room 4",
   "isLivestream": false,
   "id": "327598382"
  },
  {
   "description": "Location is a fundamental aspect of many location-based apps. But knowing where your user is located is only part of the story. Knowing where they’re going and where they’ve been can fundamentally alter what you present to them. This session will explore using aspects of location to present a richer experience for users.",
   "title": "Making Location Meaningful with the Google Maps APIs",
   "startTimestamp": 1.3686612E9,
   "youtubeUrl": "CO9I3bikFuY",
   "presenterIds": [
    "109072255271027874411",
    "112437818624006019775"
   ],
   "endTimestamp": 1.3686636E9,
   "subtype": "SESSION",
   "location": "Room 1",
   "isLivestream": true,
   "id": "327600597"
  },
  {
   "description": "Much if not most of the world’s data has a geographic component. Data visualizations with a geographic component are some of the most popular on the web. This session will explore the principles of data visualization and how you can use HTML5 - particularly WebGL - to supplement Google Maps visualizations.",
   "title": "Google Maps + HTML5 + Spatial Data Visualization: A Love Story",
   "startTimestamp": 1.3687236E9,
   "presenterIds": [
    "107381749582030154056"
   ],
   "endTimestamp": 1.3687272E9,
   "subtype": "SESSION",
   "location": "Room 4",
   "isLivestream": false,
   "id": "327631300"
  },
  {
   "description": "Spatial data architectures are many and varied. There are simple solutions that host static data, and complex integrations with existing enterprise infrastructures, and everything inbetween. But common patterns - and antipatterns - emerge regarding how data is hosted and served to your users. This session will discuss those patterns and how you can implement them in your mapping architecture.",
   "title": "Design Patterns for Maps - Architecture",
   "startTimestamp": 1.3686543E9,
   "presenterIds": [
    "104266012929783704217",
    "116716104784219574155"
   ],
   "endTimestamp": 1.3686567E9,
   "subtype": "SESSION",
   "location": "Room 4",
   "isLivestream": false,
   "id": "327659239"
  },
  {
   "description": "The Google Maps API is now on multiple platforms, JavaScript, Android, and iOS. Each platform has it’s own special strengths and limitations, and requires special attention. But what if you’re building for all three platforms? How do you approach that problem? This session will look at the specialized development for the individual platforms versus generalized development for all three, and the trade offs inherent in each different approach. We will look at when to use our web services, and how to build a strong back-end infrastructure.",
   "title": "How to Build Multi-Platform Maps with Google’s APIs",
   "startTimestamp": 1.3687401E9,
   "presenterIds": [
    "115211767481477593155",
    "102132443453001852914",
    "118167583580756336864"
   ],
   "endTimestamp": 1.3687425E9,
   "subtype": "SESSION",
   "location": "Room 4",
   "isLivestream": false,
   "id": "327674395"
  },
  {
   "description": "Tens of thousands of ships report their position at least once every 5 minutes, 24 hours a day. Visualizing that quantity of data and serving it out to large numbers of people takes lots of power both in the browser and on the server. This session will explore the use of Maps, App Engine, Go, Compute Engine, BigQuery, Cloud Storage,  and WebGL to do massive data visualization.",
   "title": "All the Ships in the World: Visualizing Data with Google Cloud and Maps",
   "startTimestamp": 1.3687335E9,
   "youtubeUrl": "MA4HU3frUow",
   "presenterIds": [
    "102648035817990852395",
    "114882728068215941282",
    "113748263284402179745"
   ],
   "endTimestamp": 1.3687359E9,
   "subtype": "SESSION",
   "location": "Room 1",
   "isLivestream": true,
   "id": "327696300"
  },
  {
   "description": "Google Maps Engine (GME) Portable enables organizations to “cut” their 2D and 3D data from GME for use offline. This capability extends the power of Google Maps and Google Earth into austere environments where network access may be limited or unavailable. Portable comes with a full suite of APIs that allow developers to embed Google’s familiar mapping interfaces into their own offline applications. Portable is currently in use on the International Space Station, it has been aloft in aircraft, underwater in submarines, and used almost everywhere in between. We are excited to get Portable out to a wider developer audience, so talented engineers can create new and exciting offline implementations.",
   "title": "Off the Grid: Going Offline with Maps and Earth",
   "startTimestamp": 1.3687434E9,
   "presenterIds": [
    "115193389128038683849",
    "112279956112678878792"
   ],
   "endTimestamp": 1.3687458E9,
   "subtype": "SESSION",
   "location": "Room 4",
   "id": "327701357"
  },
  {
   "description": "Does your service send emails? During this session we will show you how to add structured data to your emails to enable actions directly from the inbox and increase user engagement.",
   "title": "Actions in the inbox, powered by schemas",
   "startTimestamp": 1.3686543E9,
   "youtubeUrl": "aK2HXXF2jJw",
   "presenterIds": [
    "103194976596083439703",
    "102884916567006680487"
   ],
   "endTimestamp": 1.3686567E9,
   "subtype": "SESSION",
   "location": "Room 2",
   "isLivestream": true,
   "id": "327735537"
  },
  {
   "description": "Ever wanted to add awesome realtime editing to your apps, just like Google Docs? The Drive Realtime API is here to help. This in-depth talk will discuss the secrets behind Google collaboration, the technical details of the Realtime API, and how you can take advantage of it in your own apps.",
   "title": "The Secrets of the Drive Realtime API",
   "startTimestamp": 1.3687401E9,
   "youtubeUrl": "MA4HU3frUow",
   "presenterIds": [
    "107403937024062899574",
    "109654027848946633829"
   ],
   "endTimestamp": 1.3687425E9,
   "subtype": "SESSION",
   "location": "Room 1",
   "isLivestream": true,
   "id": "327774452"
  },
  {
   "description": "The updated version of Google Forms that launched earlier this year works with Apps Script, allowing you to create and manipulate forms with only a few lines of code. In this session, we'll explore ways to make forms and workflows more useful through scripts and demonstrate tricks that make forms react to changes in your organization.",
   "title": "Use Apps Script to Create Dynamic Google Forms",
   "startTimestamp": 1.3686513E9,
   "presenterIds": [
    "111003737414271546062",
    "116141311008937748437"
   ],
   "endTimestamp": 1.3686537E9,
   "subtype": "SESSION",
   "location": "Room 7",
   "isLivestream": false,
   "id": "327782631"
  },
  {
   "description": "Meet the team behind Blink, Chrome's new open-source rendering engine. We'll give a brief overview of Blink from the inside; among other things, what's happened since our April launch, some of our future plans, and how we ensure interoperability across browsers. Most of the session will be reserved for your questions about Blink, feature development, and the web platform.",
   "title": "Fireside Chat with the Blink Team",
   "startTimestamp": 1.3686642E9,
   "presenterIds": [
    "101770524855203737699",
    "113390235998969869149",
    "104337450658946893583",
    "111599671638312829382",
    "118329321683865945653"
   ],
   "endTimestamp": 1.3686666E9,
   "subtype": "SESSION",
   "location": "Room 6",
   "isLivestream": false,
   "id": "327783629"
  },
  {
   "description": "At Google I/O 2012, Google handed over control of GWT to the community through the GWT Steering Committee. Now, one year later, come see what the exciting future of GWT will look like, as the GWT Steering Committee presents its future roadmap for GWT.",
   "title": "GWT Roadmap for the Future",
   "startTimestamp": 1.3687467E9,
   "presenterIds": [
    "114335252081578466746",
    "102121624563718447959",
    "115782332730465778761"
   ],
   "endTimestamp": 1.3687491E9,
   "subtype": "SESSION",
   "location": "Room 6",
   "isLivestream": false,
   "id": "327833110"
  },
  {
   "description": "Happy birthday Chrome Packaged Apps! Come help us celebrate by learning what's new in the Packaged Apps platform and what's ahead on the roadmap.",
   "title": "The Chrome Packaged Apps State of the Nation",
   "startTimestamp": 1.3686612E9,
   "presenterIds": [
    "101323778908970829584"
   ],
   "endTimestamp": 1.3686636E9,
   "subtype": "SESSION",
   "location": "Room 6",
   "isLivestream": false,
   "id": "327862203"
  },
  {
   "description": "Building great, responsive mobile web applications means you have to be friends with the radio! We will cover how to build battery efficient mobile applications, how to get the best throughput, and how to plan for the various latency delays present in mobile networks. This talk is a radio crash course - aka, your HAM license for the mobile web - with a top-down overview of how a modern 4G carrier network works under the hood. Bring your propeller hat!",
   "title": "Mobile Performance from the Radio Up: Battery, Latency and Bandwidth Optimization",
   "startTimestamp": 1.368828E9,
   "presenterIds": [
    "103532563190745371016"
   ],
   "endTimestamp": 1.3688304E9,
   "subtype": "SESSION",
   "location": "Room 10",
   "isLivestream": false,
   "id": "327864330"
  },
  {
   "description": "In this talk, we will discuss what we are doing for our enterprise admins and developers to provide them a much better way of building tools and applications.",
   "title": " Introducing a New Way to Administer Businesses on Google",
   "startTimestamp": 1.3687335E9,
   "presenterIds": [
    "105514624696537100293",
    "113178796867312565171"
   ],
   "endTimestamp": 1.3687359E9,
   "subtype": "SESSION",
   "location": "Room 3",
   "isLivestream": false,
   "id": "327878419"
  },
  {
   "description": "Using Google Apps Script it's now possible to add custom menus, popups, and other functionality to your Google Docs. In this session we'll explore the ways in which you can utilize this technology to build custom workflows, import data from other sources, and integrate your own applications in Google Docs.",
   "title": "Extend Google Docs with Apps Script",
   "startTimestamp": 1.3687434E9,
   "youtubeUrl": "MA4HU3frUow",
   "presenterIds": [
    "112752528635025559793",
    "103524298901290363156"
   ],
   "endTimestamp": 1.3687458E9,
   "subtype": "SESSION",
   "location": "Room 1",
   "isLivestream": true,
   "id": "327928222"
  },
  {
   "description": "What is the user interface for your map? How do you put together a UI that allows easy access to your data? Does the design of your map help your users get the data they need? This talk will help developers bring together the elements of visual design, cartography, and user experience to help present their mapping data in the best way.",
   "title": "Design Principles for Maps",
   "startTimestamp": 1.3686582E9,
   "presenterIds": [
    "111395160068414462086",
    "109235774535962117997"
   ],
   "endTimestamp": 1.3686606E9,
   "subtype": "SESSION",
   "location": "Room 4",
   "isLivestream": false,
   "id": "328082805"
  },
  {
   "description": "Tired of polling for updates to YouTube API feeds? Wouldn't it be nicer if the API could tell your application when new data were available? Come and hear about our new YouTube API push notification infrastructure, and find out how you can write code that responds to new YouTube activities.",
   "title": "YouTube API Push Notifications",
   "startTimestamp": 1.3686612E9,
   "presenterIds": [
    "112161935323871526092",
    "111815493751521097215"
   ],
   "endTimestamp": 1.3686636E9,
   "subtype": "SESSION",
   "location": "Room 3",
   "isLivestream": false,
   "id": "328119818"
  },
  {
   "description": "Adaptive streaming internet videos is hard, but it gets even harder when you try to do it at scale. We'll talk about the basics of quality of experience and discuss what we are doing to improve it at YouTube.",
   "title": "Adaptive Streaming for You and YouTube",
   "startTimestamp": 1.3687467E9,
   "presenterIds": [
    "101093850288031203239",
    "114650298582089429470"
   ],
   "endTimestamp": 1.3687491E9,
   "subtype": "SESSION",
   "location": "Room 3",
   "isLivestream": false,
   "id": "328181796"
  },
  {
   "description": "This talk will discuss the latest features of the Drive SDK that have been developed as part of Google’s commitment to allow 3rd parties to write Drive applications with the richness of Google Docs/Sheets/Presentations. These features make it easier to find files, receive notifications when files change, and publish websites.",
   "title": "What's New with the Google Drive SDK: One Year Later",
   "startTimestamp": 1.3686471E9,
   "presenterIds": [
    "115039654550925344117"
   ],
   "endTimestamp": 1.3686507E9,
   "subtype": "SESSION",
   "location": "Room 7",
   "isLivestream": false,
   "id": "328229660"
  },
  {
   "description": "Mapping streets and buildings is the hard part. But the even harder part is mapping indoors. Not only is Google acquiring floor plans for major buildings and venues, but we’re also working out ways to provide positioning data inside those buildings. When GPS doesn’t work, how do you find your place on the map?",
   "title": "The Next Frontier: Indoor Maps",
   "startTimestamp": 1.3686513E9,
   "presenterIds": [
    "116925039230405927608",
    "113291976841237332494"
   ],
   "endTimestamp": 1.3686537E9,
   "subtype": "SESSION",
   "location": "Room 4",
   "isLivestream": false,
   "id": "328283671"
  },
  {
   "description": "Ever had a question you wanted to ask the Google Maps Team? Here’s your chance to ask leading engineers, product managers, and developer advocates the questions you’ve always wanted to ask.",
   "title": "Fireside Chat with the Google Maps Team",
   "startTimestamp": 1.36875E9,
   "presenterIds": [
    "115612609094437359963",
    "114882728068215941282",
    "106475443897919264426",
    "104053532464087688431",
    "109235774535962117997",
    "106971440609458103164",
    "111282396038093008297"
   ],
   "endTimestamp": 1.3687524E9,
   "subtype": "SESSION",
   "location": "Room 4",
   "id": "328290202"
  },
  {
   "description": "Google Drive aims to deliver your apps to Google Drive users where and when they need to find them inside Google Drive or on a mobile device. This talk will describe the compelling reasons why your app should integrate with Google Drive, and the ways in which your app can reach as many customers as possible. We will run through how your app will appear to users, and the technical details behind putting it there.",
   "title": "Getting Your App Noticed Inside Google Drive",
   "startTimestamp": 1.3687236E9,
   "presenterIds": [
    "109052429299753016317",
    "110768893200141376463"
   ],
   "endTimestamp": 1.3687272E9,
   "subtype": "SESSION",
   "location": "Room 11",
   "isLivestream": false,
   "id": "328316140"
  },
  {
   "description": "In this talk attendees will learn all about the new YouTube Analytics API. We will show the audience how to access the data via Google Apps Script, a cloud scripting platform. We will build and demo ad hoc reporting that extracts parametrized data via the YouTube Analytics API into Google Sheets. We'll also show how some of the reporting can be scheduled and alerts can be fired when thresholds are met. This talk will be of interest to YouTube publishers and also to developers looking to do more with Google Apps Scripts and Google Sheets.",
   "title": "Ad hoc YouTube Analytics with Google Apps Script",
   "startTimestamp": 1.3686513E9,
   "presenterIds": [
    "111784658684387563624",
    "114890094354607830075"
   ],
   "endTimestamp": 1.3686537E9,
   "subtype": "SESSION",
   "location": "Room 3",
   "isLivestream": false,
   "id": "328316141"
  },
  {
   "description": "Leading gaming developers are integrating with YouTube to make their games go viral. You could be next. In this session will will show you how to take a Unity3D game and super-charge it with YouTube uploads, in-game YouTube playback and convert the YouTube users into players of your title. ",
   "title": "Super-Charge Your Mobile Game with YouTube",
   "startTimestamp": 1.3686642E9,
   "presenterIds": [
    "113570705157192485597",
    "104672469404158254034"
   ],
   "endTimestamp": 1.3686666E9,
   "subtype": "SESSION",
   "location": "Room 3",
   "isLivestream": false,
   "id": "328318842"
  },
  {
   "description": "Google and Catlin Seaview Survey's Richard Vevers have partnered together to bring the first ever underwater street view imagery to Google Maps. Learn how Catlin Seaview Survey has built a special camera to collect this spectacular surround imagery. Their goal in partnership with University of Sydney professor Dr. Ove Hoegh-Gulberg is to empower a global reef record to create a snapshot in time of the world's coral reef areas, starting with the Great Barrier Reef in Australia. Explore also Apo Island, Philippines, Molokini Atoll, Maui, Hanauma Bay, Hawaii and now for the first time the pristine Raja Ampat, Indonesia. They have built an impressive 2.3 million following on Google Plus enabling public engagement through underwater diver hangouts.",
   "title": "Dive Into Underwater Street View",
   "startTimestamp": 1.3687368E9,
   "presenterIds": [
    "102231901459779067976",
    "102722145216824292369"
   ],
   "endTimestamp": 1.3687392E9,
   "subtype": "SESSION",
   "location": "Room 4",
   "isLivestream": false,
   "id": "328321280"
  },
  {
   "description": "YouTube channels can help launch your business to success. Learn some tips and tricks on how your business can use the world's second largest search engine to help with maketing, product support, fundraising and customer acquisition. The session will share key insights on understanding YouTube's audience and learning how to use all of the site's tools to build a channel that sticks.",
   "title": "Leveraging YouTube to Grow Your Business",
   "startTimestamp": 1.36875E9,
   "youtubeUrl": "MA4HU3frUow",
   "presenterIds": [
    "108420200293350716007",
    "109637357592099657926"
   ],
   "endTimestamp": 1.3687524E9,
   "subtype": "SESSION",
   "location": "Room 1",
   "isLivestream": true,
   "id": "328356649"
  },
  {
   "description": "This session describes the recently launched YouTube Live APIs. We'll demo developer and partner applications (Games, Publishing software, devices), describe best practices and potentially work on a simple Live-streaming app.",
   "title": "Broadcast Yourself!: Using the YouTube Live APIs to Stream to the World",
   "startTimestamp": 1.3687335E9,
   "youtubeUrl": "FL2RHE3Jsj0",
   "presenterIds": [
    "112276519059897035237",
    "108367657731517061389"
   ],
   "endTimestamp": 1.3687359E9,
   "subtype": "SESSION",
   "location": "Room 2",
   "isLivestream": true,
   "id": "328361185"
  },
  {
   "description": "YouTube API is Google's largest API by request volume yet there are still a lot of apps that are not taking advantage of it. Join YouTube platform product and engineering leaders as they give you an overview of where YouTube is headed, give you a sneak peak at the latest YouTube APIs, and talk about opportunities for developers. We will also watch a few cool videos. ",
   "title": "YouTube for Developers: The Future and the Opportunities",
   "startTimestamp": 1.3686471E9,
   "presenterIds": [
    "110270558498714093434",
    "113705992628251059467",
    "114450399567338466648"
   ],
   "endTimestamp": 1.3686507E9,
   "subtype": "SESSION",
   "location": "Room 3",
   "isLivestream": false,
   "id": "328400253"
  },
  {
   "description": "One of the top barrier to mobile commerce is the ease of checkout. Whether you're selling office supplies, t-shirts, or fancy jewelry your users are faced with the same problem: providing credit card and shipping information via long complicated forms that are particularly painful to fill out on a mobile device. Learn how you can use Google Wallet to make the shopping experience in your app simple and frictionless, and in turn drive up conversion and sales.",
   "title": "What's New with Mobile Payments on Android",
   "startTimestamp": 1.3686513E9,
   "youtubeUrl": "CO9I3bikFuY",
   "presenterIds": [
    "107716001091572934721",
    "102001956029749662794",
    "100949969414069163924"
   ],
   "endTimestamp": 1.3686537E9,
   "subtype": "SESSION",
   "location": "Room 1",
   "isLivestream": true,
   "id": "330844794"
  },
  {
   "description": "Learn about the Google Wallet platform and how developers can start using Wallet APIs. ",
   "title": "Google Wallet for Developers: Part I",
   "startTimestamp": 1.3686543E9,
   "youtubeUrl": "CO9I3bikFuY",
   "presenterIds": [
    "101254346988339056058",
    "103358377026900500111",
    "112042661669835649802"
   ],
   "endTimestamp": 1.3686567E9,
   "subtype": "SESSION",
   "location": "Room 1",
   "isLivestream": true,
   "id": "331042422"
  },
  {
   "description": "Learn about the Google Wallet Platform and how developers can start using the Google Wallet APIs.",
   "title": "Google Wallet for Developers Part II",
   "startTimestamp": 1.3686582E9,
   "presenterIds": [
    "114004546096225605843",
    "103157884921314553842",
    "107617215758723496509"
   ],
   "endTimestamp": 1.3686606E9,
   "subtype": "SESSION",
   "location": "Room 8",
   "isLivestream": false,
   "id": "331169394"
  },
  {
   "description": "Learn some of the techniques and tips from the Google Wallet team and from one of our partner on how you can make your mobile commerce apps easier and more secure to use, and thus increase your conversions and ultimately your bottom line. This session will include some intermediate/advanced development topics.",
   "title": "Building Compelling mCommerce Experiences",
   "startTimestamp": 1.3686612E9,
   "presenterIds": [
    "100432311890795889621",
    "117506393888291966563",
    "107966519771249748630"
   ],
   "endTimestamp": 1.3686636E9,
   "subtype": "SESSION",
   "location": "Room 8",
   "isLivestream": false,
   "id": "331380814"
  },
  {
   "description": "In 2009, Ray Ryan gave a talk at Google I/O advocating the Model-View-Presenter pattern and the EventBus for architecting GWT applications. Since then, MVP and the EventBus have become widespread in the GWT community and several frameworks have appeared to support them. However, there's still a lot of confusion over what MVP actually is and the best way to implement it. Many common solutions involve tedious amounts of boilerplate and overhead. In this talk, I will demonstrate that using MVP and the EventBus correctly is easier than you probably think it is and can be done without any frameworks or extra overhead. The end result is a more testable, maintainable GWT application that is a pleasure to work with.",
   "title": "Demystifying MVP and EventBus in GWT",
   "startTimestamp": 1.3687281E9,
   "presenterIds": [
    "109750381921536031348"
   ],
   "endTimestamp": 1.3687305E9,
   "subtype": "SESSION",
   "location": "Room 4",
   "isLivestream": false,
   "id": "331474237"
  },
  {
   "description": "Whether you have a website, mobile app, game, or other online service, users can now sign in with Google and bring along their Google+ profile. Come learn how Google+ Sign-In can create more engaging experiences in your app and drive more usage across devices.  This talk will introduce the technical concepts of integrating Google+ Sign-In and other Google+ features, and is a pre-requisite for other Google+ talks. ",
   "title": "An Introduction to Integrating Google+ Sign-In",
   "startTimestamp": 1.3686513E9,
   "youtubeUrl": "aK2HXXF2jJw",
   "presenterIds": [
    "104392738264586850178",
    "104276047482306325210"
   ],
   "endTimestamp": 1.3686537E9,
   "subtype": "SESSION",
   "location": "Room 2",
   "isLivestream": true,
   "id": "331521903"
  },
  {
   "description": "Join us for an overview of the whole Google+ platform. Learn what Google+ has to offer your applications, where the platform is headed, and determine your must see Google+ platform sessions at I/O this year.",
   "title": "Google+ Platform Overview",
   "startTimestamp": 1.3686471E9,
   "youtubeUrl": "CO9I3bikFuY",
   "presenterIds": [
    "101366316496655479407",
    "105301562746453695662"
   ],
   "endTimestamp": 1.3686507E9,
   "subtype": "SESSION",
   "location": "Room 1",
   "isLivestream": true,
   "id": "331751140"
  },
  {
   "description": "Google Apps is a cloud-based productivity suite that helps your team get work done from anywhere on any device. By adding the power of Google+ for business, your team can connect and share seamlessly with coworkers and external partners. In this session, we will review the unique features of Google+ for business, discuss new ways of integrating Google+ into your business systems and processes, and help you get the most out of Google+ to facilitate easy, quick and compelling communication across your organization.",
   "title": "Getting the Most Out of Google+ in Your Organization",
   "startTimestamp": 1.3686642E9,
   "presenterIds": [
    "114798392356273832177",
    "114440103510717181457"
   ],
   "endTimestamp": 1.3686666E9,
   "subtype": "SESSION",
   "location": "Room 7",
   "isLivestream": false,
   "id": "331828864"
  },
  {
   "description": "Got a burning question about the Google+ platform? Come meet the team and have your questions answered directly from the people behind the Google+ platform. Dig into the technology and have your voice heard.",
   "title": "Fireside Chat with the Google+ Platform Team",
   "startTimestamp": 1.3687236E9,
   "youtubeUrl": "MA4HU3frUow",
   "presenterIds": [
    "101366316496655479407",
    "105301562746453695662",
    "111906213460278052395",
    "100988415634272001384",
    "100046111226547636851",
    "111541293037698895607"
   ],
   "endTimestamp": 1.3687272E9,
   "subtype": "SESSION",
   "location": "Room 1",
   "isLivestream": true,
   "id": "331838045"
  },
  {
   "description": "RenderScript is an API for high-performance computation on Android using whatever processors are available on a device, including CPUs, GPUs, DSPs, and more. This talk will cover how to develop applications with RenderScript that are capable of running on any device running Gingerbread or greater.\r\nWe will walk you through accelerating a simple application and show how we can provide high performance on different architectures with a single source base. Benchmarks comparing RS to the NDK will be presented.",
   "title": "High Performance Applications with RenderScript",
   "startTimestamp": 1.36881E9,
   "presenterIds": [
    "113680924389579925739",
    "109905793369500800056"
   ],
   "endTimestamp": 1.3688124E9,
   "subtype": "SESSION",
   "location": "Room 5",
   "isLivestream": false,
   "id": "331954522"
  },
  {
   "description": "The Hangout Apps platform has evolved steadily over the last year. Hear how far we've come, learn how you can make your apps come alive with audio/video conversations & see what's up next for the technology.",
   "title": "The Google+ Hangouts API a Year Later: Much More than a Virtual Mustache",
   "startTimestamp": 1.3686612E9,
   "presenterIds": [
    "106152192987874158067",
    "104392738264586850178"
   ],
   "endTimestamp": 1.3686636E9,
   "subtype": "SESSION",
   "location": "Room 4",
   "isLivestream": false,
   "id": "331967769"
  },
  {
   "description": "You are a developer making a hot social app. Your Android app, iOS app, and website all need to seamlessly work with an authenticated user. This session will deep dive into Google+ Sign-In auth models, and help you choose the right one for your needs.",
   "title": "Cross-Platform Auth with Google+ Sign-In",
   "startTimestamp": 1.3687467E9,
   "youtubeUrl": "MA4HU3frUow",
   "presenterIds": [
    "115337774658109774307",
    "105524488315701830418"
   ],
   "endTimestamp": 1.3687491E9,
   "subtype": "SESSION",
   "location": "Room 1",
   "isLivestream": true,
   "id": "332060543"
  },
  {
   "description": "Learn how to derive the most benefit for your site and your users from Google+ Sign-In. Hear how to maximize installs of your apps, optimize click-through-rates for interactive posts, deliver customized content based on social data, and write app activities that get noticed on Google.",
   "title": "Best Practices for Google+ Sign-In",
   "startTimestamp": 1.3687401E9,
   "presenterIds": [
    "107377191681802669866",
    "101823260413332862725"
   ],
   "endTimestamp": 1.3687425E9,
   "subtype": "SESSION",
   "location": "Room 11",
   "isLivestream": false,
   "id": "332242620"
  },
  {
   "description": "Learn how to add Google+ Sign-In to your web based app, how to connect user's to their friends, create customized experiences with Google+ profile data, drive more engagement using interactive posts, and monitor your app's performance on Google+.",
   "title": "Google+ Sign-In for Web Apps",
   "startTimestamp": 1.3687281E9,
   "youtubeUrl": "MA4HU3frUow",
   "presenterIds": [
    "109016304695129264328"
   ],
   "endTimestamp": 1.3687305E9,
   "subtype": "SESSION",
   "location": "Room 1",
   "isLivestream": true,
   "id": "332301066"
  },
  {
   "description": "Whether you’re building a game, a mobile app, or a social analytics service, your information needs to be highly available, stored safely, and able to grow as your user base explodes. Come to this session to learn how modern distributed databases address these needs. You’ll hear from a panel of four industry experts about their solutions for tackling this problem using Google’s infrastructure and have the opportunity to ask the panel questions about their experiences.",
   "title": "Distributed Databases Panel: An Exploration of Approaches and Best Practices",
   "startTimestamp": 1.3687335E9,
   "presenterIds": [
    "103758939240201269129",
    "115953675346826539854",
    "101268520621127893892",
    "104729495212196679573",
    "107369548625488457671",
    "111522867595723149080"
   ],
   "endTimestamp": 1.3687359E9,
   "subtype": "SESSION",
   "location": "Room 4",
   "isLivestream": false,
   "id": "332318287"
  },
  {
   "description": "Google+ offers a suite of tools for publishers that help users share and discover content on their site, both on the site itself and when coming from Google properties like Google Search.  In this session, we'll cover all the basics of the Google+ tools that can help drive discovery and engagement on your website.",
   "title": "Google+ for Publishers: Buttons, Badges, and More",
   "startTimestamp": 1.3686543E9,
   "presenterIds": [
    "111466602600743594987",
    "107786897865850743842"
   ],
   "endTimestamp": 1.3686567E9,
   "subtype": "SESSION",
   "location": "Room 7",
   "isLivestream": false,
   "id": "332357156"
  },
  {
   "description": "See examples of how to maximize your social graph utilization and return from a Google+ integration, using launched applications as a reference.  See how partners in certain situations integrate Google+ to improve the success of their apps, and make them more socially relevant to users.",
   "title": "Building a Successful Google+ Integration That Adds Significant Value",
   "startTimestamp": 1.3687368E9,
   "presenterIds": [
    "101991109918134351158",
    "106629624069287759290",
    "107054398730220626019",
    "108821066082539878644"
   ],
   "endTimestamp": 1.3687392E9,
   "subtype": "SESSION",
   "location": "Room 11",
   "isLivestream": false,
   "id": "332364943"
  },
  {
   "description": "Learn how Google+ Sign-In can co-exist with alternative social login solutions and how to migrate your apps from legacy Google authentication systems. If you already have social login on your site and are wondering how to add Google+ Sign-In, or are currently using an older OAuth 2.0 Google auth integration, this session is for you.",
   "title": "How to Offer Google+ Sign-In Alongside Other Social Sign-In Services",
   "startTimestamp": 1.36875E9,
   "presenterIds": [
    "110547825053290505051"
   ],
   "endTimestamp": 1.3687524E9,
   "subtype": "SESSION",
   "location": "Room 3",
   "isLivestream": false,
   "id": "332401735"
  },
  {
   "description": "Let us walk you through how to add Google+ Sign-In to your iOS app, connect user's to their friends, drive more engagement using interactive posts, and monitor your app's performance on Google+.",
   "title": "Google+ Sign-In for iOS Developers",
   "startTimestamp": 1.3687335E9,
   "presenterIds": [
    "100682245760160682928",
    "101902965735556853785"
   ],
   "endTimestamp": 1.3687359E9,
   "subtype": "SESSION",
   "location": "Room 11",
   "isLivestream": false,
   "id": "332435024"
  },
  {
   "description": "By bringing technology closer, we can get it out of the way. This and other core concepts, design guidelines, UX paradigms, and APIs will be introduced as a baseline for Glass Development. Excellent examples will be shown and used to codify everything into a set of best practices. If you want to develop for Glass, this is where you start! This session is a prerequisite for all Glass development sessions.",
   "title": "Developing For Glass",
   "startTimestamp": 1.3687236E9,
   "youtubeUrl": "FL2RHE3Jsj0",
   "presenterIds": [
    "108929048159669197910"
   ],
   "endTimestamp": 1.3687272E9,
   "subtype": "SESSION",
   "location": "Room 2",
   "isLivestream": true,
   "id": "332490621"
  },
  {
   "description": "Comprehending and navigating complex web pages is difficult already for readers with perfect eyesight, but much harder when relying on speech rendering only. The ChromeVox screen reader is specifically built to handle modern web content in all its richness. ChromeVox is Javascript-based and makes it easy for developers to make cutting-edge web applications accessible.\r\n\r\nWe demonstrate the latest incarnation of ChromeVox that offers advanced navigation facilities for complex content such as tables and mathematical formulas as well as support for Braille and new HTML5 UI controls such as date/time, and media controls.",
   "title": "Advancing Web Accessibility with ChromeVox",
   "startTimestamp": 1.3686642E9,
   "presenterIds": [
    "117488202747497585065",
    "100638895793320047898",
    "106195438568138564022"
   ],
   "endTimestamp": 1.3686666E9,
   "subtype": "SESSION",
   "location": "Room 8",
   "isLivestream": false,
   "id": "332625543"
  },
  {
   "description": "Join several key members of the Glass team as they discuss the path that brought them here. We'll discuss why Glass is so important to the evolution of wearable technology and how developers can most effectively engage in the ecosystem.",
   "title": "Fireside Chat with the Glass Team",
   "startTimestamp": 1.3687434E9,
   "presenterIds": [
    "105335971699246066257",
    "103920236067646572792",
    "108929048159669197910",
    "106798735063220314720"
   ],
   "endTimestamp": 1.3687458E9,
   "subtype": "SESSION",
   "location": "Room 7",
   "isLivestream": false,
   "id": "332695704"
  },
  {
   "description": "Glass is ready for hacking! See what is possible with the hardware platform and how you can gain root access. Learn how to run your own experimental applications. Disclaimer: you'll be stepping into uncharted and unsupported territory!",
   "title": "Voiding Your Warranty: Hacking Glass ",
   "startTimestamp": 1.3687401E9,
   "youtubeUrl": "FL2RHE3Jsj0",
   "presenterIds": [
    "110585271504899439962",
    "104252001098817863676"
   ],
   "endTimestamp": 1.3687425E9,
   "subtype": "SESSION",
   "location": "Room 2",
   "isLivestream": true,
   "id": "332704837"
  },
  {
   "description": "The Google Mirror API is a simple but powerful set of RESTful APIs for building Glassware. In this session we'll review some first principles for Glass development, paradigms of the Google Mirror API, and the rapid track from concept to prototype. We will cover both standard use cases and ones that push the boundaries of the API.",
   "title": "Building Glass Services with the Google Mirror API",
   "startTimestamp": 1.3687335E9,
   "presenterIds": [
    "102383647968207344192",
    "118309258654733192569"
   ],
   "endTimestamp": 1.3687359E9,
   "subtype": "SESSION",
   "location": "Room 7",
   "isLivestream": false,
   "id": "332733833"
  },
  {
   "description": "Ever want to make a small tweak to your mobile application but your users have already downloaded your app? Ever forget to add analytics on a key event until it's too late? Learn about new ways to dynamically configure your mobile applications server-side. You can hone your app for various audiences, and you'll never get caught by old versions or forgetfulness again.",
   "title": "Dynamically Configure Mobile Applications: Google Tag Manager for Mobile Apps",
   "startTimestamp": 1.3687335E9,
   "presenterIds": [
    "113601526252446646008",
    "104645088114794307503"
   ],
   "endTimestamp": 1.3687359E9,
   "subtype": "SESSION",
   "location": "Room 8",
   "isLivestream": false,
   "id": "332761592"
  },
  {
   "description": "Concurrency is the key to designing high performance network services. This talk expands on last year's popular Go Concurrency Patterns talk to dive deeper into Go's concurrency primitives, and see how tricky concurrency problems can be solved gracefully with simple Go code.",
   "title": "Advanced Go Concurrency Patterns",
   "startTimestamp": 1.3687467E9,
   "presenterIds": [
    "117164717346967447278"
   ],
   "endTimestamp": 1.3687491E9,
   "subtype": "SESSION",
   "location": "Room 7",
   "isLivestream": false,
   "id": "332768653"
  },
  {
   "description": "You’ve spent many long hours working on your app, but how do you turn those long days and nights into many users and plentiful revenue? Find out what’s new with AdMob, and how it can be your partner in building a great app business.",
   "title": "Build a Great App Business with AdMob",
   "startTimestamp": 1.3687281E9,
   "youtubeUrl": "FL2RHE3Jsj0",
   "presenterIds": [
    "107935616280834277527",
    "111001605198683647425"
   ],
   "endTimestamp": 1.3687305E9,
   "subtype": "SESSION",
   "location": "Room 2",
   "isLivestream": true,
   "id": "332774230"
  },
  {
   "description": "Since its release in November 2009, The Go Programming Language has grown into a thriving open source project with a dedicated following. Join us in this session and have your Go questions answered by members of the Go team at Google.",
   "title": "Fireside Chat with the Go Team ",
   "startTimestamp": 1.36875E9,
   "youtubeUrl": "FL2RHE3Jsj0",
   "presenterIds": [
    "117164717346967447278",
    "116194885237009984305",
    "118256501351373212797",
    "104248425957414959349",
    "106260887951948582270",
    "104209454589006912339",
    "104503406809963767593",
    "100574140909000777759"
   ],
   "endTimestamp": 1.3687524E9,
   "subtype": "SESSION",
   "location": "Room 2",
   "isLivestream": true,
   "id": "332838749"
  },
  {
   "description": "Google Analytics recently launched Universal Analytics, a new way to measure user interactions across any device / platform / environment. By measuring this data, developers can better optimize their applications. In this session we'll discuss how how to measure user-interaction from any device as well as demo new reports and best practices to optimize both web and mobile apps.",
   "title": "Optimize Web and Mobile Apps, Across Devices, Using Google Analytics",
   "startTimestamp": 1.3687368E9,
   "youtubeUrl": "FL2RHE3Jsj0",
   "presenterIds": [
    "115588790777352268774",
    "117109107576111195881",
    "104004073782045011680"
   ],
   "endTimestamp": 1.3687392E9,
   "subtype": "SESSION",
   "location": "Room 2",
   "isLivestream": true,
   "id": "332857962"
  },
  {
   "description": "Highly scalable and rapid data collection and analysis is a key need for many mobile and gaming apps, as well as for sensor networks and the \"Internet of Things.\"  We'll show how the Data Sensing Lab incorporates a key Google Cloud Platform pattern: a high-throughput pipeline for data collection, processing, and analysis. We use the Cloud Endpoints API to collect constantly streaming data; process large amounts of data with high throughput using App Engine, Cloud Storage, and data transformation on Compute Engine; and query many GBs of collected data in just a few seconds using BigQuery.",
   "title": "Behind the Data Sensing Lab: Gathering, Processing, and Analyzing Data at Scale using the Google Cloud Platform",
   "startTimestamp": 1.36875E9,
   "presenterIds": [
    "100978872515629229948",
    "107648916160124526500"
   ],
   "endTimestamp": 1.3687524E9,
   "subtype": "SESSION",
   "location": "Room 7",
   "isLivestream": false,
   "id": "332908798"
  },
  {
   "description": "Google Analytics and AdSense are two Google products that will soon be able to deliver their reporting data into BigQuery, Google's big data query and analysis engine. In this session, see how Google Analytics Premium and AdSense users are able to conduct advanced data analysis using BigQuery.",
   "title": "Google Analytics and AdSense Data Analysis in BigQuery",
   "startTimestamp": 1.3687434E9,
   "presenterIds": [
    "111694106399875025329",
    "101989983434898115569",
    "104474707579972909405",
    "108620323372746014066"
   ],
   "endTimestamp": 1.3687458E9,
   "subtype": "SESSION",
   "location": "Room 8",
   "isLivestream": false,
   "id": "332940014"
  },
  {
   "description": "Google’s cloud platform, including Google Compute Engine, App Engine, Cloud Storage and BigQuery are effective tools for developers to overcome challenging engineering requirements at scale. In this talk we present the Open Bidder, a fully customizable toolkit that leverages these services to meet the high request rate and low latency constraints third-party developers face when integrating with Google’s DoubleClick Ad Exchange.",
   "title": "Introducing Open Bidder: Leverage Google’s Cloud Platform to Reinvent Display Advertising",
   "startTimestamp": 1.3687401E9,
   "presenterIds": [
    "116391792927809553900"
   ],
   "endTimestamp": 1.3687425E9,
   "subtype": "SESSION",
   "location": "Room 8",
   "isLivestream": false,
   "id": "332947383"
  },
  {
   "description": "This session introduces a new and highly-requested language for Google App Engine. The new runtime allows developers to take advantage of App Engine’s powerful scaling, services, durability, and ease of use, while leveraging familiar and powerful frameworks to build applications. In this session we'll give an overview of this new runtime, and show how easy it is to move existing applications to use App Engine and the Google Cloud Platform.",
   "title": "A New Language for App Engine",
   "startTimestamp": 1.3687467E9,
   "youtubeUrl": "FL2RHE3Jsj0",
   "presenterIds": [
    "117283591689575222130",
    "111015761579617724294",
    "116292102573654737807"
   ],
   "endTimestamp": 1.3687491E9,
   "subtype": "SESSION",
   "location": "Room 2",
   "isLivestream": true,
   "id": "333055646"
  },
  {
   "description": "Ready to rock the world with your next application?  Odds are you are thinking about mobile, web and the cloud. In this session we will walk through building a modern mobile web application that takes advantage of the Google Cloud Platform.  Learn trips, best practices and solid architecture that will make your next mobile web app an amazing success.",
   "title": "Mobile, Web and Cloud - The Triple Crown of Modern Applications",
   "startTimestamp": 1.3686612E9,
   "presenterIds": [
    "104063574019960026476",
    "107624689303045310946"
   ],
   "endTimestamp": 1.3686636E9,
   "subtype": "SESSION",
   "location": "Room 7",
   "isLivestream": false,
   "id": "333067828"
  },
  {
   "description": "Shutterfly is the market leader in digital personalized photo products and services and helps customers turn their precious memories into lasting keepsakes. Being able to analyze user data quickly is important for optimizing their customer and product marketing strategies. Learn how Shutterfly’s analytics and DW teams are integrating Google BigQuery into their workflows, using features like Big Join and Large Group Aggregations to mine terabytes of data, and rapidly identifying customer usage patterns and effective outreach campaigns - without massive hardware and software investments.",
   "title": "Big Data Mashups: Enabling Next Generation Analytics Using BigQuery",
   "startTimestamp": 1.3687281E9,
   "presenterIds": [
    "102492856051318070277",
    "109309673586066921706"
   ],
   "endTimestamp": 1.3687305E9,
   "subtype": "SESSION",
   "location": "Room 11",
   "isLivestream": false,
   "id": "333103712"
  },
  {
   "description": "Google Compute Engine's had a very busy year! We've made improvements to the underlying architecture to provide even better performance, released new versions of our APIs that improve the developer experience, and introduced many new features and instance types. Come join us as we guide you through what's new and cool with Google Compute Engine, and how recent improvements can help you build more efficient, scalable and cost-effective applications in the cloud.",
   "title": "What's New and Cool with Google Compute Engine",
   "startTimestamp": 1.3686582E9,
   "youtubeUrl": "aK2HXXF2jJw",
   "presenterIds": [
    "100655376578809877867",
    "110742766946974748282",
    "113290495495234538794"
   ],
   "endTimestamp": 1.3686606E9,
   "subtype": "SESSION",
   "location": "Room 2",
   "isLivestream": true,
   "id": "333117643"
  },
  {
   "description": "Come learn about an exciting new networking feature for Google Compute Engine that enables you to specifically control how traffic is routed throughout your virtual network.",
   "title": "Speed, Efficiency, and Control: Advanced Packet Routing Techniques in a Google Compute Engine Network",
   "startTimestamp": 1.3688172E9,
   "presenterIds": [
    "111751412635817257166",
    "114241073508015754302"
   ],
   "endTimestamp": 1.3688196E9,
   "subtype": "SESSION",
   "location": "Room 2",
   "isLivestream": false,
   "id": "333138978"
  },
  {
   "description": "From indie to AAA game studios, learn how cutting edge developers are building next generation experiences on the Google Cloud Platform. This session focuses on how developers are combining technologies such as App Engine, Compute Engine, and BigQuery to quickly build and scale their multi-platform releases.",
   "title": "Intense Gaming",
   "startTimestamp": 1.3687236E9,
   "presenterIds": [
    "105703330024067623466",
    "113985439648236595612",
    "102658799622794901405"
   ],
   "endTimestamp": 1.3687272E9,
   "subtype": "SESSION",
   "location": "Room 7",
   "isLivestream": false,
   "id": "333138979"
  },
  {
   "description": "Learn tools and techniques to help you build rock solid, scalable, high performance, virtual computing clusters on Google Compute Engine. Topics we'll cover:\r\n- summary of advanced tools (startup scripts, metadata server, service accounts, load balancing)\r\n- building and managing clusters\r\n- storage options and tradeoffs (scratch disk vs. persistent disk vs. cloud storage, snapshots, hot swap PD)\r\n- dealing with outages (planned and unplanned)\r\n\r\nWe'll conclude with a guided tour of a robust web service along with summary of best practices.",
   "title": "When Bad Things Happen to Good Clusters: Building Robust Systems with Google Compute Engine",
   "startTimestamp": 1.3688244E9,
   "presenterIds": [
    "107233449499433848128",
    "108156600936117322974"
   ],
   "endTimestamp": 1.3688268E9,
   "subtype": "SESSION",
   "location": "Room 2",
   "isLivestream": false,
   "id": "333205865"
  },
  {
   "description": "This session will provide a clear, step-by-step approach to accessing Google Cloud Platform resources using OAuth 2.0. We will define the most important use cases and show how to build those solutions using practical code examples. The goal is to help you solve your authorization problems correctly and easily, without having to become an OAuth expert.",
   "title": "Keys to the Kingdom: Design Patterns for Using OAuth in the Cloud",
   "startTimestamp": 1.3688064E9,
   "presenterIds": [
    "110608505967802603978",
    "100025013496431133965"
   ],
   "endTimestamp": 1.3688088E9,
   "subtype": "SESSION",
   "location": "Room 2",
   "id": "333234305"
  },
  {
   "description": "Senior Vice President Urs Hölzle will share Google’s vision for the next generation of cloud computing.  He’ll discuss how investments in infrastructure, software and people will help usher in this new era for Google and developers around the world via the Google Cloud Platform.  This session will also include announcements and demo important new features of the Platform.",
   "title": "Cloud Platform Track Kickoff: Ushering in the Next Generation of Cloud Computing",
   "startTimestamp": 1.3686471E9,
   "youtubeUrl": "aK2HXXF2jJw",
   "presenterIds": [
    "102497046928279183978",
    "113057531893316771155"
   ],
   "endTimestamp": 1.3686507E9,
   "subtype": "SESSION",
   "location": "Room 2",
   "isLivestream": true,
   "id": "333265959"
  },
  {
   "description": "Understand how to build Java applications that work well in an autoscaling environment.  We'll discuss common anti-patterns in Java that make it difficult for autoscaling environments to deal with your application.  We'll also discuss how App Engine knows when to scale up and back your application and how to take full advantage of this.",
   "title": "Autoscaling Java",
   "startTimestamp": 1.3686513E9,
   "presenterIds": [
    "103027372107619157644",
    "118066768580306911990"
   ],
   "endTimestamp": 1.3686537E9,
   "subtype": "SESSION",
   "location": "Room 8",
   "isLivestream": false,
   "id": "333276583"
  },
  {
   "description": "The Google Developers website, aka developers.google.com, is one of thousands of Google applications that run on App Engine.  In this talk, we walk through the real-world use cases and design patterns that drive the site's content management system, and discuss implementation techniques that have worked, and a few that haven't.  As a bonus, we'll consider several of the newest App Engine features in the context of this app, and how they change the way we think about application architecture.",
   "title": "Building developers.google.com on App Engine",
   "startTimestamp": 1.3687368E9,
   "presenterIds": [
    "114762921794125640576"
   ],
   "endTimestamp": 1.3687392E9,
   "subtype": "SESSION",
   "location": "Room 9",
   "isLivestream": false,
   "id": "333307296"
  },
  {
   "description": "In this talk we will describe the ATLAS Experiment on Google Compute Engine (GCE) scientific computing project and illustrate several examples of large-scale high performance computing installations on GCE, including a 1000-core PROOF cluster for ATLAS data analysis and a 4000-core HTCondor cluster used for simulation of LHC collision events. We will also discuss Xroot technology used for high-performance data clustering.",
   "title": "Cloud Computing and High-Energy Particle Physics: How ATLAS Experiment at CERN Uses Google Compute Engine in the Search for New Physics at LHC",
   "startTimestamp": 1.368828E9,
   "presenterIds": [
    "117103096851450902500",
    "104460128037045881107",
    "101662974652271974519"
   ],
   "endTimestamp": 1.3688304E9,
   "subtype": "SESSION",
   "location": "Room 2",
   "isLivestream": false,
   "id": "333315382"
  },
  {
   "description": "We’ll look at how the Gamesys social MMORPG “Here Be Monsters” utliizes the Google Cloud Platform as a production data warehouse for managing user engagement and automating retention activities using App Engine. We’ll demo the game’s integration with Google Spreadsheets and BigQuery via Google Apps Script and dive into the code that enables automated reporting dashboards and ad hoc game optimization.",
   "title": "Here Be BigQuery: Building Social Gaming Infrastructure on the Google Cloud Platform",
   "startTimestamp": 1.36881E9,
   "presenterIds": [
    "105137129520428919903",
    "111353357730292956733"
   ],
   "endTimestamp": 1.3688124E9,
   "subtype": "SESSION",
   "location": "Room 2",
   "isLivestream": false,
   "id": "333361785"
  },
  {
   "description": "This session will review multiple approaches customers take when importing their large data sets into Google Cloud Storage, including trade-offs in time, cost, and complexity. These solutions include several advanced techniques which will also help you in a wide range of other situations. We'll show the architecture and code for some of these approaches and feature a case study of a 5 PB+ migration.",
   "title": "Importing Large Data Sets into Google Cloud Storage",
   "startTimestamp": 1.3686543E9,
   "presenterIds": [
    "115953675346826539854",
    "108398217887969561968"
   ],
   "endTimestamp": 1.3686567E9,
   "subtype": "SESSION",
   "location": "Room 8",
   "isLivestream": false,
   "id": "333473305"
  },
  {
   "description": "The best Android applications take full advantage of the cloud to power great user experiences. This talk shows, in detail, how to use the server-code optional backend on the Google Cloud Platform to store application and game state in the cloud.  We will then walk through adding your own custom logic via Google Cloud Endpoints and the Google Plugin for Eclipse. ",
   "title": "From Nothing to Nirvana in Minutes: Cloud Backend for Your Android Application",
   "startTimestamp": 1.3687434E9,
   "youtubeUrl": "FL2RHE3Jsj0",
   "presenterIds": [
    "106920059607812615730",
    "108858760740261730394",
    "117635347870966929564"
   ],
   "endTimestamp": 1.3687458E9,
   "subtype": "SESSION",
   "location": "Room 2",
   "isLivestream": true,
   "id": "333508149"
  },
  {
   "description": "The Go runtime for App Engine is a high performance engine for running web applications. It produces fast responses, starts instances in a fraction of a second, makes the most use of instance hours, and allows your app to do serious processing at full machine speed. Come along to hear how to fully exploit the power of Go on App Engine and make your web applications the best they can be.",
   "title": "High Performance Apps with Go on App Engine ",
   "startTimestamp": 1.3687401E9,
   "presenterIds": [
    "116194885237009984305"
   ],
   "endTimestamp": 1.3687425E9,
   "subtype": "SESSION",
   "location": "Room 7",
   "isLivestream": false,
   "id": "333519914"
  },
  {
   "description": "Is longform content the way to go or do short clips still reign supreme on YouTube? Are you hot in South Korea? Do video annotations engage or irritate your audiences? The YouTube Analytics API can answer all these questions and more. Learn about advanced features of the API. Discover how Next Big Sound uses the YouTube API to help record labels, artists, and band managers make better decisions. ",
   "title": "Find the Next Big Thing with the YouTube Analytics API",
   "startTimestamp": 1.3687368E9,
   "presenterIds": [
    "116485751350673088264",
    "111277728620030766765",
    "108072475249223692851"
   ],
   "endTimestamp": 1.3687392E9,
   "subtype": "SESSION",
   "location": "Room 3",
   "isLivestream": false,
   "id": "350411205"
  },
  {
   "description": "Design is different from art. In fact, if you had to use math to validate it, then you are probably on the right track. In this product design-focused session, we will discuss what it means to be a designer at YouTube. We will cover the state and meaning of the multi-device world we live in. Finally, we will share a few best principles for both design and corresponding quantitative analysis in this new world.",
   "title": "Designing Products for a Multi-screen World: The YouTube Perspective",
   "startTimestamp": 1.3687434E9,
   "presenterIds": [
    "101226446505540536961",
    "115269663178525362757"
   ],
   "endTimestamp": 1.3687458E9,
   "subtype": "SESSION",
   "location": "Room 3",
   "isLivestream": false,
   "id": "350418426"
  },
  {
   "description": "The performance, reliability and consistency of Persistent Disk (PD) are part of what distinguishes GCE as a next generation cloud service.  Discover some of the internals of PD and what distinguishes it from comparable offerings.  This session will include a technical deep dive into best practices for using PD with your GCE apps.",
   "title": "Supercharge Your Google Compute Engine App with Persistent Disk",
   "startTimestamp": 1.3686642E9,
   "presenterIds": [
    "116218133741213876182",
    "115770252156332003580"
   ],
   "endTimestamp": 1.3686666E9,
   "subtype": "SESSION",
   "location": "Room 4",
   "isLivestream": false,
   "id": "350753683"
  },
  {
   "description": "Almost every new mobile device today ships with a high DPI screen. That trend has started branching out to laptops, and it’s only a matter of time until every device we use is high DPI. In this talk we’ll dive into what high DPI means and how you can optimize your sites so they look great in any form factor.  You’ll learn 1) how different “pixels” affect layout and how to achieve the layout you want, 2) how layouts are affected by different display densities, and 3) how different image formats can be used to provide the best experience for users ensuring that your site looks great on any device.  You’ll walk away knowing how to use responsive techniques to build sites that shine, and also how you can quickly update your existing sites to look beautiful, both today and in the future.",
   "title": "Seeing the World Through High DPI",
   "startTimestamp": 1.3687401E9,
   "presenterIds": [
    "100449428189239388872",
    "117525909753351141826"
   ],
   "endTimestamp": 1.3687425E9,
   "subtype": "SESSION",
   "location": "Room 6",
   "isLivestream": false,
   "id": "350992350"
  },
  {
   "description": "Freebase is the open core of Google's Knowledge Graph. The Freebase APIs help developers enhance their applications so they better understand the people, places and things users care about. We'll dig into code samples and show how to enhance your application with Knowledge Graph data.",
   "title": "The Freebase APIs: Tapping into Google's Knowledge Graph",
   "startTimestamp": 1.3687368E9,
   "youtubeUrl": "MA4HU3frUow",
   "presenterIds": [
    "114584588709374914590"
   ],
   "endTimestamp": 1.3687392E9,
   "subtype": "SESSION",
   "location": "Room 1",
   "isLivestream": true,
   "id": "351310959"
  },
  {
   "description": "At Google, we're making more and more use of structured data to help users find your content. In addition to a variety of rich snippets that enhance search results, we're now showing event calendars for cities and venues, reviews for movies in the Knowledge Graph, ingredient filters for recipes, and more. How do you ensure your site is participating in features like these? We'll answer that question by demoing a suite of new and updated tools — including Data Highlighter and the Structured Data Dashboard — that make providing and validating your site’s structured data easier than ever.",
   "title": "Hands-On: New Google Tools for Structured Data",
   "startTimestamp": 1.3687281E9,
   "presenterIds": [
    "112415399858553375329",
    "103480414186995725733"
   ],
   "endTimestamp": 1.3687305E9,
   "subtype": "SESSION",
   "location": "Room 9",
   "isLivestream": false,
   "id": "351340935"
  },
  {
   "description": "While the web began with free-text documents, most of it is now backed by structured databases. However, too often the structure from these databases is lost on the way to HTML. It doesn't have to be that way. We'll cover what new features can be powered by this structured data as well as tools & techniques for making sure this useful structure is not lost on your site.\r\n",
   "title": "From Structured Data to the Knowledge Graph",
   "startTimestamp": 1.3687236E9,
   "presenterIds": [
    "106683584710120301522",
    "107251853277073795671"
   ],
   "endTimestamp": 1.3687272E9,
   "subtype": "SESSION",
   "location": "Room 9",
   "isLivestream": false,
   "id": "351343657"
  },
  {
   "description": "Ignite captures the best of geek culture in a series of five-minute speed presentations. Each speaker gets 20 slides that auto-advance after 15 seconds. ",
   "title": "IGNITE",
   "startTimestamp": 1.3687467E9,
   "endTimestamp": 1.3687524E9,
   "subtype": "SESSION",
   "location": "Room 11",
   "isLivestream": false,
   "id": "352045148"
  },
  {
   "description": "In this session we'll walk you through a series of techniques you can use to make your app and content shine on Google. Using these techniques you can connect more directly with new and existing users on Google Search.",
   "title": "G+ and Search: How to Enhance Your Brand Queries on Google",
   "startTimestamp": 1.3686582E9,
   "youtubeUrl": "CO9I3bikFuY",
   "presenterIds": [
    "100831539213655563256",
    "103390686048441232976"
   ],
   "endTimestamp": 1.3686606E9,
   "subtype": "SESSION",
   "location": "Room 1",
   "isLivestream": true,
   "id": "355405369"
  },
  {
   "description": "This design lab is for developers who are interested in UX design and in becoming part of the design narrative for the product that they're working on. Unlike most design labs, this one is tailored for the needs of developers who might be new to UX design, and want to contribute to the design process, but don't know where to start. This is where you can start.",
   "title": "UX Design for Developers",
   "startTimestamp": 1.3688136E9,
   "presenterIds": [
    "102470692378986690553",
    "109216666351851084497"
   ],
   "endTimestamp": 1.3688208E9,
   "subtype": "SESSION",
   "location": "Room 11",
   "isLivestream": false,
   "id": "355690278"
  },
  {
   "description": "So you built an app, site, game, or online service, but have no idea how to connect with users to grow your business? Join us for a discussion on how Google+ helps you grow and engage your audience. Take away tips on how to use Google+ to create value for your business by getting found across Google, getting recommended to other Google users, and creating more personal engagement.",
   "title": "Grow Your Audience with Google+",
   "startTimestamp": 1.3687434E9,
   "presenterIds": [
    "106892688294484508250"
   ],
   "endTimestamp": 1.3687458E9,
   "subtype": "SESSION",
   "location": "Room 11",
   "isLivestream": false,
   "id": "355865420"
  },
  {
   "description": "Go is an exciting new programming language with a concurrency model that makes network programming fun and straightforward. In this codelab you'll build a peer-to-peer chat network to communicate with your fellow attendees, giving you hands-on experience with Go's concurrency primitives and standard library.\r\n\r\nThis codelab is a practical application of the theory presented in the Advanced Go Concurrency Patterns session.",
   "title": "Whispering Gophers: network programming in Go",
   "startTimestamp": 1.3688064E9,
   "presenterIds": [
    "104248425957414959349",
    "102648035817990852395"
   ],
   "endTimestamp": 1.3688136E9,
   "subtype": "CODE_LAB",
   "location": "Room 3",
   "isLivestream": false,
   "id": "356379867"
  },
  {
   "description": "PCs,  laptops, tablets, smartphones, hybrids, televisions and more: touch-AND-mouse-enabled devices are coming. Come to this talk to learn how to make your site awesome on the growing number of touchscreen devices and to see what the future of the web holds for touch-based computing.  \r\n\r\nYou will learn how to future-proof your website for touchscreen laptops, how to build a buttery smooth touch experience, and, most importantly, how to create code that is responsive to multi-modal input.",
   "title": "Point, Click, Tap, Touch - Building Multi-Device Web Interfaces",
   "startTimestamp": 1.3687434E9,
   "youtubeUrl": "FDEMA6OhvGo",
   "presenterIds": [
    "103099260058609329507",
    "109951732179700807248"
   ],
   "endTimestamp": 1.3687458E9,
   "subtype": "SESSION",
   "location": "Room 10",
   "isLivestream": true,
   "id": "361772634"
  },
  {
   "description": "Megan Smith (VP, Google[x]) will emcee a series of TED talk style segments from Susan Wojcicki (SVP, Ads), Anna Patterson (VP, Knowledge), Johanna Wright  (VP, Search and Mobile), Kathy Kleiman (Founder of the ENIAC Programmers Project), Jean Wang (Staff Hardware Engineer, Glass), and Diane Greene (Board of Directors, Google). They’ll share their insights, learnings, and “ah ha!” moments from being technical leaders inside innovative companies. This will be a special supersized session that runs until 6:35pm!\r\n\r\nPresented by Women Techmakers.\r\n",
   "title": "7 Techmakers and a Microphone",
   "startTimestamp": 1.3686642E9,
   "youtubeUrl": "GEeUBsyBUEc",
   "presenterIds": [
    "117575372449723249485",
    "107477842723776280015",
    "113247851178580535598",
    "108235622768911025579",
    "114303513520691285735",
    "114275943287326487460"
   ],
   "endTimestamp": 1.3686666E9,
   "subtype": "SESSION",
   "location": "Room 1",
   "isLivestream": true,
   "id": "364746894"
  },
  {
   "description": "When you build solutions on both App Engine and Compute Engine you get the best of both worlds: a fully managed platform to deploy and serve your frontend services and a raw virtual machine environment to do your custom backend processing. But what if you want to store your data in a scalable, non-relational storage system and share that data across both environments? In this codelab you will learn techniques for accessing the App Engine Datastore from Compute Engine by building an end to end solution that leverages the larger Google Cloud Platform.",
   "title": "Using the App Engine Datastore to build unified solutions that span App Engine and Compute Engine",
   "startTimestamp": 1.3688145E9,
   "presenterIds": [
    "118023969811374967961",
    "104008716717889396039"
   ],
   "endTimestamp": 1.3688217E9,
   "subtype": "CODE_LAB",
   "location": "Room 8",
   "isLivestream": false,
   "id": "372681304"
  },
  {
   "description": "Come learn about how Google+ is helping Online learning platforms help connect students to each other and to professors. This talk will give an overview of the Google+ technologies that can be used in online education and also look at various examples of where this has been integrated successfully. You will also hear from Coursera, one of the leading Online Learning platforms and their experience with Google+ Hangouts. ",
   "title": "Online Learning Made Social with Google+ ",
   "startTimestamp": 1.3686513E9,
   "presenterIds": [
    "117240000621256851899",
    "104906919451670502090"
   ],
   "endTimestamp": 1.3686537E9,
   "subtype": "SESSION",
   "location": "Room 9",
   "isLivestream": false,
   "id": "382318827"
  },
  {
   "description": "Location is a key feature for building contextually aware mobile applications. Join us as we explore the best practice techniques for building applications that are location aware.",
   "title": "Android Location Based Services",
   "startTimestamp": 1.3688145E9,
   "presenterIds": [
    "110749387555384474850",
    "116913082927852709091"
   ],
   "endTimestamp": 1.3688217E9,
   "subtype": "CODE_LAB",
   "location": "Room 9",
   "id": "382879951"
  },
  {
   "description": "Ingress is a massively multiplayer geo game that was recently launched by Google's Niantic Labs.  Players move through the real world using an Android device and the Ingress app to discover and tap sources of a mysterious energy. Players acquire objects to aid in their quest, deploy tech to capture territory, and ally with other field agents to advance the cause of the Enlightened or the Resistance in an epic struggle for the fate of humanity. \r\n\r\nBrandon Badger, is the Product Manager for Ingress. He's been a Product Manager on Google Maps, Google Books, YouTube, and Niantic Labs. He'll be talking about Google's latest efforts to create \"adventures on foot\" using Android and Google's Geo data. The discussion will focus on the the game design principles and techniques used to create Ingress, as well as opportunities to use emerging technologies to create new types of mobile gaming experiences.",
   "title": "Ingress: Design Principles Behind Google's Massively Multiplayer Geo Game",
   "startTimestamp": 1.3686582E9,
   "presenterIds": [
    "100044483708056731249"
   ],
   "endTimestamp": 1.3686606E9,
   "subtype": "SESSION",
   "location": "Room 9",
   "isLivestream": false,
   "id": "382968729"
  },
  {
   "description": "Last summer, 155K Google users came together in a virtual classroom by signing up for our experimental \"Power Searching with Google\" MOOC (massive open online course).  Twenty-thousand of those students “graduated.” Two months later, we launched an open source project called Course Builder--based on the original Power Searching MOOC code--to make the technology powering the class available to everyone. This session is a case study of how Course Builder evolved from Power Searching with Google MOOC to an online course delivery platform. We'll focus on how Google's APIs and technologies facilitated the development of the initial system and continue to support the open source platform. ",
   "title": "Building an Online Education Platform using Google Technologies",
   "startTimestamp": 1.36875E9,
   "presenterIds": [
    "102984254530689471489"
   ],
   "endTimestamp": 1.3687524E9,
   "subtype": "SESSION",
   "location": "Room 9",
   "isLivestream": false,
   "id": "383165932"
  },
  {
   "description": "Identity is hard, but the penalties for getting it wrong are severe. Good news: technologies are surfacing that reduce developer pain while improving user experience. This talk highlights them and introduces a framework, starting from your unique combination of constraints, users, and platforms, to help you figure out which technologies and policies will work for you.",
   "title": "Identity Tech Overview: Less Pain, More Gain",
   "startTimestamp": 1.3686471E9,
   "presenterIds": [
    "102740676338488322935"
   ],
   "endTimestamp": 1.3686507E9,
   "subtype": "SESSION",
   "location": "Room 9",
   "isLivestream": false,
   "id": "383266187"
  },
  {
   "description": "In 2008, Google began project Ground Truth. Its goal was to map the world from authoritative data sources, via a unique mix of algorithms and elbow grease. To date, the project has created and launched high-quality map data of 42 countries in Google Maps. In this session, you'll get a behind-the-scenes look at the inner workings of Ground Truth. Come see how we combine a mix of advanced algorithms, supplemental data (such as aerial and Street View imagery), as well as raw human labor to create and maintain map data that corresponds as closely as possible to real-world truth on the ground.",
   "title": "Project Ground Truth: Accurate Maps Via Algorithms and Elbow Grease",
   "startTimestamp": 1.3686543E9,
   "presenterIds": [
    "104529225084296890652",
    "109424455815729947272"
   ],
   "endTimestamp": 1.3686567E9,
   "subtype": "SESSION",
   "location": "Room 9",
   "isLivestream": false,
   "id": "383278298"
  },
  {
   "description": "An iconic auto manufacturer, Mercedes-Benz strives to lead the automotive industry in technology innovation. Learn how Mercedes created amazing experiences with Google Maps and the Places API in \"Digital Drive Style\" -- a connected, social navigation system powering the cockpit user experience from a smartphone.",
   "title": "Places API-Powered Navigation: A Case Study with Mercedes Benz",
   "startTimestamp": 1.3687335E9,
   "presenterIds": [
    "109295717637533938188",
    "109568980530784983800",
    "108952231133565874689"
   ],
   "endTimestamp": 1.3687359E9,
   "subtype": "SESSION",
   "location": "Room 9",
   "isLivestream": false,
   "id": "383305988"
  },
  {
   "description": "In this interactive design lab, participants will walk through the process of designing an Android app, from feature-planning to sketching and drawing screen wireframes. Members of the Android team and the Android design community will be available to help you think through design decisions. No prior design experience or special software is required — just make sure to bring your paper, a pencil, and your creativity.",
   "title": "Android Design in Action Live",
   "startTimestamp": 1.3688244E9,
   "presenterIds": [
    "117783991067812351544",
    "118287924347242328050",
    "106150334554780854002"
   ],
   "endTimestamp": 1.3688316E9,
   "subtype": "CODE_LAB",
   "location": "Room 7",
   "id": "383307141"
  },
  {
   "description": "Research at Google is unique, as it is conducted across the entire Engineering organization - by Research Scientists as well as Software Engineers.  Teams are integrated, boundaries are fluid, and we face challenges together while retaining a close feedback loop from our users. This enables us to quickly build, iterate, and launch new and innovative products that change the state of the art and thereby produce new research results.  Google's definition of research is broad and happens in multiple ways across the organization.  Our research results in technology advances in the areas of Audio/Video Fingerprinting, Image Understanding, MapReduce/Parallel Computing, Deep Learning, and Parsing at Scale, which we apply to many of our products.  And, it also results in new whole new products, such as Voice Search and Google Translate. Learn about Google's hybrid approach to research from the engineers and scientists behind ideas such as Google Glass, MapReduce, Search, and online education, who conduct big idea experiments that translate into real-time innovation at Google.",
   "title": "Fireside chat with Research at Google",
   "startTimestamp": 1.3687467E9,
   "presenterIds": [
    "106736982332312893620",
    "112317652221071509598",
    "102984254530689471489",
    "110501547970954403143"
   ],
   "endTimestamp": 1.3687491E9,
   "subtype": "SESSION",
   "location": "Room 9",
   "isLivestream": false,
   "id": "383344388"
  },
  {
   "description": "So you want to expand to an international audience ... where to start? what does it entail? how do I do it? how to promote in local markets?\r\nThis talk will address above questions for android and web developers. In our journey of the where, what and how, we will take an in-depth look at various internationalization and localization tools available to you.",
   "title": "Developing for a Global Audience: Tools for Internationalization & Localization",
   "startTimestamp": 1.3687281E9,
   "presenterIds": [
    "113453049700246637459"
   ],
   "endTimestamp": 1.3687305E9,
   "subtype": "SESSION",
   "location": "Room 7",
   "isLivestream": false,
   "id": "383370298"
  },
  {
   "description": "Come build stunning Hangouts apps!  We will start with the basic building blocks of multi-person interactive applications and end with magic interactions built on top of cutting edge media effects!\r\n",
   "title": "Building Amazing Hangouts Applications - Make Magic Interactions!",
   "startTimestamp": 1.3688244E9,
   "presenterIds": [
    "100682245760160682928"
   ],
   "endTimestamp": 1.3688316E9,
   "subtype": "CODE_LAB",
   "location": "Room 4",
   "id": "383400568"
  },
  {
   "description": "From SOPA/PIPA and CISPA, to immigration and patent reform, government is taking a renewed interest in the Internet and the businesses we're building on it -- in some cases, there is even a new focus on the use of technology which can solve government problems.\r\n\r\nAs a result, government is looking for input from our community of entrepreneurs and developers about what our needs are as a community, and how they can build better public policy in our interest.  \r\n\r\nSo, what are the most efficient, easy ways for you to get involved? Join us for a panel of some leaders in the Internet advocacy space to learn how you, as a developer, can get more involved in creating better policies that can affect your business.",
   "title": "Beyond SOPA: What You Can Do to Influence Tech Policy",
   "startTimestamp": 1.3686642E9,
   "presenterIds": [
    "105529705368997989104",
    "104829323222940219654",
    "104738959971405105137",
    "117373626751040790202",
    "102999062016777565181"
   ],
   "endTimestamp": 1.3686666E9,
   "subtype": "SESSION",
   "location": "Room 9",
   "isLivestream": false,
   "id": "383408099"
  },
  {
   "description": "In this code lab, learn how to add snazz to your Android apps by using the Google Maps Android API v2 to its full potential. We will show you useful Maps-specific interaction and UI patterns to help make your app really stand out. Engineers from the Android and Maps teams will be there to advise you on the best ways to integrate maps into your specific application.",
   "title": "Make your Android app pop with  Google Maps Android API v2",
   "startTimestamp": 1.3688244E9,
   "presenterIds": [
    "102492699096464888077",
    "114910489268164152893"
   ],
   "endTimestamp": 1.3688316E9,
   "subtype": "CODE_LAB",
   "location": "Room 9",
   "isLivestream": false,
   "id": "383425125"
  },
  {
   "description": "Learn about the power of the modern web and use WebRTC to build a simple video and text chat app. \r\nIn this codelab, we'll help you get to grips with the core APIs and technologies of WebRTC:\r\n- MediaStream (aka getUserMedia): what is it and how can I use it?\r\n- RTCPeerConnection: what is important about WebRTC’s most powerful API?\r\n- RTCDataChannel: how can I set up real-time communication of arbitrary data?\r\n- signalling: what is it and how do I set it up?\r\n- servers: what do I need for signalling, STUN, and TURN?",
   "title": "Build a WebRTC Web App",
   "startTimestamp": 1.3688244E9,
   "presenterIds": [
    "109281167003098778889",
    "106750565517687190132"
   ],
   "endTimestamp": 1.3688316E9,
   "subtype": "CODE_LAB",
   "location": "Room 1",
   "isLivestream": false,
   "id": "383635742"
  },
  {
   "description": "In this code lab you will learn how to get started using Google Compute Engine. We will begin with basic tasks, such as starting an instance, installing software and setting up a firewall. Then we will walk through the steps of using Compute Engine instances for processing public astronomical data to generate viewable images. The results of your work will be combined with other code lab participants to create a composite image of a region of outer space containing numerous astronomical objects that can be explored using the Maps API Navigation controls.",
   "title": "Computing the Cosmos: Getting started with Google Compute Engine ",
   "startTimestamp": 1.3688064E9,
   "presenterIds": [
    "112227548639735285701",
    "116113517845915876469"
   ],
   "endTimestamp": 1.3688136E9,
   "subtype": "CODE_LAB",
   "location": "Room 8",
   "id": "383750987"
  },
  {
   "description": "Google App Engine is adding another very popular programming language to the list of supported runtimes! At this codelab, we will cover the basics of setting up and building an application in this new language.",
   "title": "Hands-on With App Engine’s New Runtime",
   "startTimestamp": 1.3688244E9,
   "presenterIds": [
    "109917895093567337892",
    "102522909221496625357"
   ],
   "endTimestamp": 1.3688316E9,
   "subtype": "CODE_LAB",
   "location": "Room 8",
   "isLivestream": false,
   "id": "383758862"
  },
  {
   "description": "Chrome packaged apps deliver an experience as capable as a native app, but as safe as a web page. In this codelab, we'll walk through a complete app example, exercising the API along the way, until we arrive at a finished working app.",
   "title": "Chrome Packaged Apps from Start to Finish",
   "startTimestamp": 1.3688136E9,
   "presenterIds": [
    "105715743446152683974"
   ],
   "endTimestamp": 1.3688208E9,
   "subtype": "CODE_LAB",
   "location": "Room 1",
   "isLivestream": false,
   "id": "383834211"
  },
  {
   "description": "YouTube Android Player API allows you to integrate a high quality video playback experience into your application. Learn how to YouTube-enable your app in 120 minutes. ",
   "title": "YouTube Anywhere - Using the YouTube API on Phones, Tablets and GoogleTV",
   "startTimestamp": 1.3688145E9,
   "presenterIds": [
    "103412084362126415384",
    "101256144263197185529"
   ],
   "endTimestamp": 1.3688217E9,
   "subtype": "CODE_LAB",
   "location": "Room 3",
   "isLivestream": false,
   "id": "383869681"
  },
  {
   "description": "Bring your laptop, leave with speech-enabled web pages. The Web Speech API enables you to add speech recognition as an input for forms, continuous dictation and control. We start with two demos you can try yourself: composing email and adding captions to silent films. Then we take a look under the hood. In this hands-on codelab, you will learn how to add scripts to your own web pages to create interactive speech experiences. ",
   "title": "Web Speech API Creates Interactive Experiences",
   "startTimestamp": 1.3688145E9,
   "presenterIds": [
    "105610246776273933891"
   ],
   "endTimestamp": 1.3688217E9,
   "subtype": "CODE_LAB",
   "location": "Room 7",
   "isLivestream": false,
   "id": "383995547"
  },
  {
   "description": "Learn how to use the new YouTube APIs along with Freebase to search and organize videos using entities from the Knowledge Graph. We'll show you how to build a movie recommendation app that links movie trailers to actors, directors and other relevant entities.",
   "title": "Mashing Up Videos with the YouTube and the Freebase Knowledge Graph APIs",
   "startTimestamp": 1.3688244E9,
   "presenterIds": [
    "114584588709374914590",
    "112161935323871526092"
   ],
   "endTimestamp": 1.3688316E9,
   "subtype": "CODE_LAB",
   "location": "Room 3",
   "isLivestream": false,
   "id": "384077085"
  },
  {
   "description": "You paid for the whole seat but you'll only need the edge!\r\nGet hands-on experience and build declarative, modern mobile web apps with Dart and Web Components. Go from zero to magnificent using Dart's structured language, comprehensive libraries, and lightning-fast dev cycle. Learn how to use the Dart toolchain to deploy and test web apps for tablet, phone, and desktop. Yes, you can!",
   "title": "Mobile Web Apps with Dart and Web Components",
   "startTimestamp": 1.3688064E9,
   "presenterIds": [
    "117776444983962221856"
   ],
   "endTimestamp": 1.3688136E9,
   "subtype": "CODE_LAB",
   "location": "Room 1",
   "isLivestream": false,
   "id": "384097044"
  },
  {
   "description": "We will walk through Google Wallet the integration points, API description, best practices and recommendation from Google on best conversions. ",
   "title": "Google Wallet Codelab",
   "startTimestamp": 1.3688064E9,
   "presenterIds": [
    "117998004536506289151",
    "110474970590747617014",
    "109098082422304028286"
   ],
   "endTimestamp": 1.3688136E9,
   "subtype": "CODE_LAB",
   "location": "Room 7",
   "isLivestream": false,
   "id": "390332015"
  },
  {
   "description": "Have an idea and want to start a company? Learn how to attract investors, and what they want to see before writing a check. Hear from entrepreneurs who have raised money and VCs who have funded them.",
   "title": "How to Go from Weekend Hack to Funded Startup",
   "startTimestamp": 1.3687434E9,
   "presenterIds": [
    "107387931359352696858",
    "116847660159800859787",
    "103859678727748484803",
    "104457407339651133951"
   ],
   "endTimestamp": 1.3687458E9,
   "subtype": "SESSION",
   "location": "Room 9",
   "isLivestream": false,
   "id": "395810182"
  },
  {
   "description": "The lead UX Designer and the Engineering Director for Google Maps will be covering technical and design considerations around creating the rich experiences of Google Maps, including deep dives into several innovative features. This talk will offer a rare insight into the thinking and challenges behind the scenes of the leading online mapping service.",
   "title": "Behind the scenes of Google Maps",
   "startTimestamp": 1.3688064E9,
   "presenterIds": [
    "102216575152384470727",
    "106083236283107462131"
   ],
   "endTimestamp": 1.3688088E9,
   "subtype": "SESSION",
   "location": "Room 6",
   "isLivestream": false,
   "id": "401273575"
  },
  {
   "description": "Discover the latest features of the Google Visualization API and master the new methods of creating elegant, data-driven charts.",
   "title": "Google Visualization API",
   "startTimestamp": 1.3688172E9,
   "presenterIds": [
    "115460968974434994385"
   ],
   "endTimestamp": 1.3688196E9,
   "subtype": "SESSION",
   "location": "Room 6",
   "isLivestream": false,
   "id": "401719292"
  },
  {
   "description": "What if meetings didn’t have to be boring? What if you had a toolbox full of techniques for coming up with interesting and innovative ideas to get unstuck, moving forward, and writing code? Enter gamestorming: brainstorming for hackers. In this session, we’ll go in-depth on three gamestorming techniques that are fast, versatile and incredibly impactful for almost any project.",
   "title": "Get Unstuck: Gamestorming Not Brainstorming",
   "startTimestamp": 1.36881E9,
   "presenterIds": [
    "109190427224293412756",
    "103692726632119536060",
    "111466602600743594987",
    "102729913071017074604",
    "111917719322976262515",
    "100741655729055962932",
    "105027830043806117113",
    "112530944390906484728",
    "103348665260968712207",
    "102989283929113031927",
    "107909685126592182583",
    "101454916063792268454",
    "115647198277496016817"
   ],
   "endTimestamp": 1.3688124E9,
   "subtype": "SESSION",
   "location": "Room 11",
   "isLivestream": false,
   "id": "419755974"
  },
  {
   "description": "How you can use save files on Android and let the Drive SDK deal with the messy details of uploading it to the cloud, and having it available and synchronised on all devices.",
   "title": "Using Drive as the Storage Solution on Android",
   "startTimestamp": 1.3686612E9,
   "youtubeUrl": "aK2HXXF2jJw",
   "presenterIds": [
    "114171861746793664535"
   ],
   "endTimestamp": 1.3686636E9,
   "subtype": "SESSION",
   "location": "Room 2",
   "isLivestream": true,
   "id": "443945093"
  },
  {
   "description": "WebP is a new, open-source image format which provides lossy and lossless compression of images with significant byte savings: 30-80% smaller image files when compared to jpeg and png! In this session we will cover the latest features, news, and future roadmap of the WebP format. We will  dive into a few hands-on case studies and recount how large sites and applications deployed WebP, the challenges they faced in the process, and the benefits they saw and measured after the migration. In other words, a 0-60 primer on WebP: what it is, how to get started, the tooling, and the benefits - bring your propeller hat!",
   "title": "WebP: Deploying Faster, Smaller, and More Beautiful Images",
   "startTimestamp": 1.3688136E9,
   "presenterIds": [
    "103532563190745371016",
    "101103081486075663546"
   ],
   "endTimestamp": 1.368816E9,
   "subtype": "SESSION",
   "location": "Room 6",
   "isLivestream": false,
   "id": "462268217"
  },
  {
   "description": "Test your native and web apps on 100s of real phones and tablets in about 5 minutes! \r\nAppThwack tests your app in parallel on real, non-emulated devices using our built-in tests or your own scripts written in Robotium, Calabash, MonkeyTalk and more.",
   "title": "AppThwack",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/AppThwack.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "466449829"
  },
  {
   "description": "OCTO Technology is an IT consulting, design and implementation company, who helps its clients to design information systems and applications to transform their businesses.",
   "title": "Octo Technology",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/octo.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "466794494"
  },
  {
   "description": "Manymo makes a better emulator – one that runs in a browser, can be shared with a link, and can be embed in a site. \r\nManymo is a fast, in-browser Android emulator used for development, collaboration, and embedding apps in websites – dozens of OS versions and screen sizes available.",
   "title": "Manymo",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Manymo.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "467064686"
  },
  {
   "description": "AppTornado is a startup from Switzerland and the Netherlands. We develop AppBrain, an Android app discovery platform and offer promotional services for Android app developers.\r\nWith the AppBrain Apptimizer you can evaluate technical aspects of Android apps. Apptimizer makes suggestions to boost your app’s popularity and success.",
   "title": "AppTornado GmbH",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/AppTornado.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "467192777"
  },
  {
   "description": "Bitbar focuses in disruptive mobile developer solutions. We develop no-nonsense software by focusing on well-defined pain points and solve them better than anyone else.\r\nTestdroid, by Bitbar, is the easiest to use automated cloud-based testing solution for Android apps. Test your application on over 200 real Android  devices in minutes. ",
   "title": "Testdroid",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Testdroid.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "467242296"
  },
  {
   "description": "Epic Games, Inc. develops cutting-edge games and the award-winning Unreal Engine technology. Epic is responsible for the blockbuster Gears of War and Infinity Blade franchises.",
   "title": "Epic Games Inc",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/EpicGames.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "467347816"
  },
  {
   "description": "BugSense helps thousands of developers worldwide - including Fortune 500 companies - create better mobile app experiences by harnessing the power of Big Data.\r\nBugSense is the leading operational intelligence service for mobile app developers providing real-time insights for Android, iOS, HTML5, WP, Windows 8 using big data analysis. ",
   "title": "BugSense",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/BugSense.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "467356406"
  },
  {
   "description": "Mission Control For Mobile Apps.\r\nAppGlu is an innovative new mobile application platform that helps companies build connected apps faster and manage them better after launch.\r\nAppGlu’s Content Sync Engine accelerates development of backend connected apps, and AppGlu’s Control Center provides app content management, content analytics, and personalized push notifications.",
   "title": "AppGlu",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/AppGlu.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "467359288"
  },
  {
   "description": "Evernote makes it easy to remember things big and small from your everyday life using your computer, phone, tablet and the web.\r\nEvernote lets you take notes, capture photos, create to-do lists, record voice reminders--and makes these notes completely searchable, whether you are at home, at work, or on the go.",
   "title": "Evernote",
   "startTimestamp": 1.3688064E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Evernote.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "467359289"
  },
  {
   "description": "A practical look at how the best engineering and design teams work. How do you find great designers? What skills should they have? How do engineering and design processes differ, and how can you fit them together? How do you shape a culture where both engineers and designers work happily together? We'll talk about all this, and any other questions you have about startups and design. ",
   "title": "An Engineer's Pragmatic Guide to Design",
   "startTimestamp": 1.3688064E9,
   "endTimestamp": 1.3688088E9,
   "subtype": "SESSION",
   "location": "Room 11",
   "isLivestream": false,
   "id": "467453230"
  },
  {
   "description": "Gradleware offers a unique combination of the expert knowledge of Gradle's core developers and a broad array of successful client engagements spanning the entire software delivery pipeline.\r\nGradle is an open-source tool that provides a next-generation platform for creating sophisticated enterprise software automation used in a variety of projects including Google's Android.",
   "title": "Gradleware Inc.",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/gradleware.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "467792041"
  },
  {
   "description": "Expedia.com is the world's leading online travel site, helping millions of travelers per month easily plan and book travel. We create beautiful mobile apps that make travel easier and more fun.",
   "title": "Expedia",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3686678E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Expedia.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "467800039"
  },
  {
   "description": "DocuSign is the global standard for electronic signature and the eSignature transaction management leader.\r\nDocuSign helps companies and individuals securely collect information, automate data workflows and sign anything, anywhere, anytime, on any device. ",
   "title": "DocuSign",
   "startTimestamp": 1.3688064E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/DocuSign.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "467912935"
  },
  {
   "description": "NVIDIA is the global leader in visual computing technologies including the breathtaking graphics of the Tegra® mobile processor and, now, NVIDIA’s own groundbreaking Project SHIELD™ gaming portable.\r\nCome see NVIDIA Tegra Android debugging and profiling tools, including PerfHUD ES, Tegra Profiler and Nsight Tegra, the premiere Android development environment for Microsoft Visual Studio.",
   "title": "NVIDIA",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/NVIDIA.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "469480452"
  },
  {
   "description": "Intel, a world leader in silicon, provides the resources, products and services that help software developers innovate for Android and Chrome on Intel Architecture platforms. \r\nCome see hands-on demonstrations of Intel’s latest tools and technologies for Android including hardware accelerated emulation, real-time game performance and power analyzers for smartphones and tablets.",
   "title": "Intel Corporation",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Intel.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "469662437"
  },
  {
   "description": "Little Eye Labs was founded by a group of program analysis geeks in Bangalore, India, with over 30 years of experience building developer tools. \r\nIt is a ridiculously easy to use, yet awesomely powerful pre-production performance monitoring and analysis tool for Android developers, tracking battery, data, memory and providing rich context around everything!",
   "title": "Little Eye Labs",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/LittleEyeLabs.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "469971345"
  },
  {
   "description": "JetBrains is a software development company that's crazy-passionate about developer productivity. Our tools automate your routine tasks and help you effectively solve the challenging ones. \r\nIntelliJ IDEA Community Edition is an open-source IDE for Android, Java, Groovy and Scala development with integrated debugger, UI designer, refactoring and version control support.",
   "title": "JetBrains",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/JetBrains.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "470009270"
  },
  {
   "description": "The Qualcomm Developer Network is about giving you the tools and resources you need to create exceptional mobile experiences and bring them to market. \r\nQDevNet provides the software and hardware tools to help you create differentiated user experiences, channels to global markets and business connections to major mobile operators and device makers.",
   "title": "Qualcomm",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Qualcomm.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "470225361"
  },
  {
   "description": "Shopular is a Y-Combinator backed startup building a smart mobile application that automatically gives you shopping and saving information at the right place, right time.\r\nShopular is a mobile app that automatically sends you the best, personalized coupons by detecting when you are out shopping.",
   "title": "Shopular",
   "startTimestamp": 1.3688064E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Shopular.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "470305032"
  },
  {
   "description": "Unity Technologies are the creators of Unity, a powerful and accessible engine and integrated development environment used by over 1.7 million developers to make incredible games, simulations, visualizations, and more.",
   "title": "Unity Technologies",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Unity.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "470407555"
  },
  {
   "description": "Netflix is the world's leading Internet television network with more than 33 million members in 40 countries enjoying more than one billion hours of TV shows and movies per month, including original series. For one low monthly price, Netflix members can watch as much as they want, anytime, anywhere, on nearly any Internet-connected screen. Members can play, pause and resume watching, all without commercials or commitments.",
   "title": "Netflix",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3686678E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Netflix.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "470619628"
  },
  {
   "description": "Vessel sets out to reimagine application development. By providing one interface for your mobile application's inner workings, Vessel manages the performance and distribution of your app for its entire life cycle -- from idea to inception to evolution -- and across platforms and devices.",
   "title": "Vessel",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Vessel.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "470625742"
  },
  {
   "description": "Square is making commerce easy for everyone. With a free card reader and app, Square enables anyone to accept credit card payments, anywhere.\r\nLearn about a variety of open source libraries designed to simplify multiple aspects of Android development – from networking to UI to testing.",
   "title": "Square, Inc.",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Square.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "470672614"
  },
  {
   "description": "Snapette is the largest local fashion and store discovery platform. Snapette helps retailers market to nearby shoppers and drive foot traffic into stores.\r\nSnapette’s mobile and tablet apps enable shoppers to discover great fashion products available in nearby stores. Retailers can easily create storefronts to reach nearby shoppers.",
   "title": "Snapette",
   "startTimestamp": 1.36872E9,
   "endTimestamp": 1.3687524E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Snapette.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "470792840"
  },
  {
   "description": "TuneIn lets people listen to the world’s music, sports and news from wherever they are, with over 70,000 radio stations streaming from every continent.",
   "title": "TuneIn",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3686678E9,
   "iconUrl": "/apps/images/io_2013/sandbox/TuneIn.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "470820979"
  },
  {
   "description": "Urban Airship enables brands to build relationships with their constantly connected customers through Mobile Relationship Management solutions that spark exceptional experiences, increasing engagement and loyalty.\r\nOur solution provides a suite of mobile engagement channels (push, message centers, landing pages, digital wallets), bolstered by sophisticated audience segmentation, geolocation, and analytics tools.",
   "title": "Urban Airship",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/UrbanAirship.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "470942444"
  },
  {
   "description": "StackMob is the industry’s premiere, cloud-based mobile platform that helps developers create a mobile business by letting them easily build, deploy and grow full-featured applications right from the start. \r\nStackMob features frontend HTML5 and robust backend services that cut development time more than 50 percent so developers can focus on creating high caliber apps with quality user experiences.",
   "title": "StackMob",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/StackMob.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "470985296"
  },
  {
   "description": "Gantter, a division of InQuest Technologies, Inc specializes in developing a best-in-class enterprise collaborative cloud-based project scheduling platform.\r\nGantter is a powerful enterprise cloud-based Project Scheduling application that allows you to save, share, and collaborate in real-time from Google Drive.",
   "title": "Gantter",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3686678E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Gantter.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "471066331"
  },
  {
   "description": "Ordering food shouldn’t be harder than eating it.\r\nSeamless is simply the easiest way to order food for delivery or takeout. Whatever you’re in the mood for, wherever you’re in the mood for it, you’ve got it. No menus, no phone calls, no repeating yourself.",
   "title": "Seamless",
   "startTimestamp": 1.36872E9,
   "endTimestamp": 1.3687524E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Seamless.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "471070358"
  },
  {
   "description": "FedEx Office, an operating company of FedEx Corp., has approximately 1,800 stores and locations primarily in the U.S. and Canada, providing convenient access to printing and shipping expertise with reliable service. \r\nDesign & print presentations, flyers, posters and more using your Google Drive files with FedEx Office® Print Online.",
   "title": "FedEx Office",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3686678E9,
   "iconUrl": "/apps/images/io_2013/sandbox/FedEx.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "471170052"
  },
  {
   "description": "Zillow is a home and real estate marketplace dedicated to helping homeowners, buyers, sellers, renters, real estate agents, mortgage professionals, and property managers find and share vital information. \r\nZillow operates a living database of more than 110 million U.S. homes and provides consumers with real estate shopping tools across all major platforms. ",
   "title": "Zillow, Inc.",
   "startTimestamp": 1.36872E9,
   "endTimestamp": 1.3687524E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Zillow.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "471203448"
  },
  {
   "description": "Builds Digital Lifestyle Management™ applications for organizing, managing and sharing files and content whether on mobile devices, cloud services or PCs. \r\nThe leading content management, federated search and mobile file sharing app in the world with almost 60 million installs in over 90 countries. ",
   "title": "Metago",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3686678E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Astro.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "471416419"
  },
  {
   "description": "Recon Instruments is the world leader in Heads-up Displays (HUD) which feature state-of-the art micro-computers with on board Wifi and smartphone tethering.\r\nRecon's latest product is a HUD with a web connected micro-computer running ReconOS. An open SDK gives developers the ability to create apps to run directly on the device.",
   "title": "Recon Instruments Inc",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/ReconInstruments.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "471418980"
  },
  {
   "description": "O'Reilly spreads the knowledge of innovators through its technology books, online services, research, and tech conferences.\r\nThe oreilly.com ebook advantage - DRM-free, multiple formats, lifetime access, sync with Google Drive.",
   "title": "O'Reilly Media, Inc.",
   "startTimestamp": 1.3688064E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/OReilly.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "471432993"
  },
  {
   "description": "Avery Office and Consumer Products Group creates Avery labels, business cards and more.  Avery products can be customized and printed right from your desktop.\r\nThe Avery Extension for Google Drive makes it easy to customize printable Avery products for professional-looking results.",
   "title": "Avery Dennison Corporation",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3686678E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Avery.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "471488681"
  },
  {
   "description": "LumApps is a company dedicated to create web and mobile business applications using Google Apps and Google Cloud Platform services.\r\nLumApps provides LumDocs+, a scalable Document Management System built on top of Google Drive and App Engine, with customizable metadata and attachments, workflows and versions management, notification with read receipt.",
   "title": "LumApps",
   "startTimestamp": 1.36872E9,
   "endTimestamp": 1.3687524E9,
   "iconUrl": "/apps/images/io_2013/sandbox/LumApps.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "471489548"
  },
  {
   "description": "SMART Technologies Inc. is a leading provider of technology solutions that enable inspired collaboration, turning group work into a highly interactive, engaging and productive experience.\r\nTouch-enabled interactive displays and software applications that elevate the way students learn and teams collaborate to develop ideas, visualize strategies, and solve problems.",
   "title": "SMART Technologies",
   "startTimestamp": 1.36872E9,
   "endTimestamp": 1.3687524E9,
   "iconUrl": "/apps/images/io_2013/sandbox/SmartTech.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "471549962"
  },
  {
   "description": "Spotify gives you instant access to all the music you’ll ever need. Play whatever you want, on whatever you have.",
   "title": "Spotify",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3686678E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Spotify.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "471557620"
  },
  {
   "description": "Esna is a leader in cloud-enabled unified communication and collaboration solutions.  Thousands of organizations have increased productivity, improved collaboration and reduced communication costs with Esna.\r\nEsna Officelinx™ is a cloud-enabled unified communication and collaboration solution that seamlessly integrates live communication services like messaging, presence, click-to-dial and mobility with Google Apps.",
   "title": "Esna Technologies",
   "startTimestamp": 1.3688064E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Esna.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "471605453"
  },
  {
   "description": "Turnitin is the leading provider of online feedback solutions for education. Turnitin's products are used by 10,000 institutions in 126 countries.\r\nTurnitin engages students by enabling the delivery of rich feedback, combining online grading and peer review tools with award-winning originality checking.",
   "title": "Turnitin",
   "startTimestamp": 1.36872E9,
   "endTimestamp": 1.3687524E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Turnitin.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "471618354"
  },
  {
   "description": "Driven by artificial intelligence and simple user experience, Magisto is a consumer facing ecosystem for creating and sharing professional quality personal movies.  It automatically selects the most compelling moments and, like an expert video editor, weaves them together to convey a story with customized styles and music.  ",
   "title": "Magisto",
   "startTimestamp": 1.36872E9,
   "endTimestamp": 1.3687524E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Magisto.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "471627805"
  },
  {
   "description": "Epson is a global imaging and innovation leader whose product lineup ranges from inkjet printers and 3LCD projectors to sensors and other microdevices.\r\nEpson offers a variety of Epson-branded printers and All-in-One devices worldwide supporting Epson Connect™, EPSON Scan to Cloud, and Google Cloud Print™ features.  ",
   "title": "EPSON",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3686678E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Epson.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "471642523"
  },
  {
   "description": "HelloFax was founded in 2010 to bring simple and easy online faxing to everyday consumers. Today, HelloFax is most popular faxing application for Google users.\r\nWith HelloFax, Google Drive is your new fax machine. Send and receive faxes, create fax templates and more from your Google Drive account.",
   "title": "HelloFax",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3686678E9,
   "iconUrl": "/apps/images/io_2013/sandbox/HelloFax.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "471719291"
  },
  {
   "description": "At Zetetic LLC, we make tools that keep data safe in an increasingly insecure world, specialzing in applied security for mobile, web and traditional applications. \r\nSTRIP is a highly rated Password Manager and Data Vault that keeps your passwords, financials, and personal information secure yet always at your fingertips.",
   "title": "Zetetic LLC",
   "startTimestamp": 1.36872E9,
   "endTimestamp": 1.3687524E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Zetetic.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "471747966"
  },
  {
   "description": "Archy is the best file manager for Google Drive. Collaboration is as easy as a drag and drop. \r\nBeautiful, simple, easy to use and minimalistic design. With unlimited account support you can have all your data centralized in one place. Edit documents inside the app regardless of the account they are in and without extra logins.",
   "title": "Archy",
   "startTimestamp": 1.3688064E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Archy.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "471831465"
  },
  {
   "description": "HelloSign is the easiest way to sign a document online.  HelloSign partnered with Google to launch the Paperless 2013 campaign which promotes paperless solutions.\r\nHelloSign is the eSignature service most closely integrated with Google products. Check out HelloSign for Drive, HelloSign for Gmail and HelloSign for Android.",
   "title": "HelloSign",
   "startTimestamp": 1.3688064E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/HelloSign.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "471879232"
  },
  {
   "description": "Neutron Drive is a company dedicated to building the next generation of rich web apps.\r\nA collaborative development environment in your browser that integrates with Google Drive or your own private cloud server.",
   "title": "Neutron Drive",
   "startTimestamp": 1.3688064E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Neutron.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "471929628"
  },
  {
   "description": "CloudCodes builds cloud based Products for Google Apps and strongly believes in building the ecosystem around Google Apps.\t\r\ngLogin App is access control for Google Apps with many features like Password reset, custom login page, IP based restriction, broadcasting etc.",
   "title": "CloudCodes Software (P) Ltd",
   "startTimestamp": 1.3688064E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/CloudCodes.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "471958243"
  },
  {
   "description": "draw.io is a Google Drive based online diagramming application.",
   "title": "draw.io",
   "startTimestamp": 1.36872E9,
   "endTimestamp": 1.3687524E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Drawio.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "471970106"
  },
  {
   "description": "Avast Software develops and sells security software and related solutions for individuals and businesses worldwide. The company offers security software products for desktop security, server protection, and mobile device protection.\r\navast! Backup offers simple-to-use backup & restore of contacts, call logs, SMS, images, audio files, video files and apps. It is tightly integrated to Google Drive online storage and features direct integration to the my avast! web account to manage the backup of all your devices online.",
   "title": "AVAST Software",
   "startTimestamp": 1.3688064E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Avast.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "471982978"
  },
  {
   "description": "Code for America envisions a government by the people, for the people, that works in the 21st century. \r\nThrough our Fellowship, Accelerator, and Brigade, we're building a network of cities, citizens, community groups, and startups, all equally committed to reimagining government.",
   "title": "Code for America",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/CodeForAmerica.png",
   "location": "Develop for Good Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "476571948"
  },
  {
   "description": "Guide's mission is giving consumers the content they love in the format they want across tablets and smart TVs by turning online news and social streams into a TV experience. \r\nGuide is an app that leverages the latest in text to speech and avatar technologies to transform static web content into a dynamic news broadcast.",
   "title": "Guide",
   "startTimestamp": 1.3688064E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Guide.png",
   "location": "Google TV Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "477641745"
  },
  {
   "description": "Udacity's mission is to bring accessible, affordable, engaging, and highly effective higher education to the world. We believe that higher education is a basic human right, and we seek to empower our students to advance their education and careers.",
   "title": "Udacity",
   "startTimestamp": 1.3688064E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Udacity.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "477954294"
  },
  {
   "description": "Kendo UI is everything professional developers need to build HTML5 and JavaScript sites, mobile apps and Chrome packaged apps.",
   "title": "Kendo UI",
   "startTimestamp": 1.36872E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/KendoUI.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "478271426"
  },
  {
   "description": "Staq is changing the way video games are managed and optimized. We provide the tools producers and game designers need for creating better games and optimize revenues.\r\nStaq offers the first real-time analytics service for the video-game industry. It allows game producers to ask new questions to their data and get accurate, up to date answers in seconds.",
   "title": "//staq",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3686678E9,
   "iconUrl": "/apps/images/io_2013/sandbox/staq.png",
   "location": "Cloud Platform Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "478364674"
  },
  {
   "description": "Original Skateboards blends hardware (skateboard related) design and development excellence with a dedication to creatively bettering the skateboard buying and ownership process via software development.\r\nIn addition to unique performance longboards and skateboards, Original designs in-house applications to better support all of those who chose to make skateboarding a lifelong pursuit.",
   "title": "Original Skateboards",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/OriginalSkateboards.png",
   "location": "YouTube Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "478424281"
  },
  {
   "description": "DeNA Co., Ltd. is a global Internet company and social game engine that allows you to develop mobile HTML5(Chrome/Mobile Safari)/Android/iOS games like Blood Brothers from one source.",
   "title": "DeNA Co., Ltd.",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3687524E9,
   "iconUrl": "/apps/images/io_2013/sandbox/DeNA.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "478454774"
  },
  {
   "description": "AppScale Systems, Inc. is the team behind the development and support of AppScale -- the open source implementation of Google App Engine.\r\nAppScale is Google App Engine implemented using proven open source technologies, making your apps portable across App Engine, on-premise datacenters, and public/private cloud infrastructures.",
   "title": "AppScale Systems, Inc.",
   "startTimestamp": 1.36872E9,
   "endTimestamp": 1.3687524E9,
   "iconUrl": "/apps/images/io_2013/sandbox/AppScale.png",
   "location": "Cloud Platform Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "478455696"
  },
  {
   "description": "AngularJS is a leading client-side web framework developed by Google and the AngularJS community.\r\nHTML enhanced for web apps!",
   "title": "AngularJS",
   "startTimestamp": 1.3688064E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/AngularJS.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "478551327"
  },
  {
   "description": "NVIDIA is the global leader in visual computing technologies including the breathtaking graphics of the Tegra® mobile processor and, now, NVIDIA’s own groundbreaking Project SHIELD™ gaming portable.\r\nTake your mobile experience further than ever before with Tegra 4's perfect balance of power and efficiency. Explore new camera capabilities, lightning-fast web browsing, stunning visuals for mobile gaming, and blazing LTE networking through an optional chipset—all with incredible battery life.",
   "title": "NVIDIA",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.368666E9,
   "iconUrl": "/apps/images/io_2013/sandbox/NVIDIA.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "478608932"
  },
  {
   "description": "WeVideo™ is a unique cloud-based collaborative video editing service that helps anyone and everyone tell their stories through great looking videos.\r\nWeVideo™  makes video editing easy, with its storyboard editor and  themes for instant styling. As a Chrome app, WeVideo works both offline and online.",
   "title": "WeVideo",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/WeVideo.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "478629813"
  },
  {
   "description": "Sauce’s cloud-based service allows savvy developers to automatically or interactively test web and mobile applications on over 130 browsers and platforms including Android, iOS & Mac OS X. \r\nAppium is an open source test automation tool for use with native and hybrid mobile apps. It drives Android & iOS apps using the WebDriver JSON wire protocol, and can be run locally or in the Sauce cloud. ",
   "title": "Sauce Labs",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.368666E9,
   "iconUrl": "/apps/images/io_2013/sandbox/SauceLabs.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "478672928"
  },
  {
   "description": "Kamcord created the world's first screen capture technology for mobile games in 2012. Kamcord allows users to record and share a video of their mobile gameplay.",
   "title": "Kamcord",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Kamcord.png",
   "location": "YouTube Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "478762814"
  },
  {
   "description": "Epson is a global imaging and innovation leader whose product lineup ranges from inkjet printers and 3LCD projectors to sensors and other microdevices.\r\nThe Epson Moverio BT-100 is an Android based pair of smart glasses.  The dual-screen, transparent display enables 3D content to be rendered in one’s actual environment. ",
   "title": "EPSON",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Epson.png",
   "location": "YouTube Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "478763929"
  },
  {
   "description": "Gliffy is the creator of the world's first net-native business graphics application. Bootstrapped in San Francisco since 2005!\r\nGliffy Diagrams makes it easy for everyone to draw and share professional-looking diagrams, flowcharts, UML, BPMN, ERD, network diagrams, wireframes and more.",
   "title": "Gliffy",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3686678E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Gliffy.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "478848558"
  },
  {
   "description": "Niantic Labs is a team within Google with the goal of creating \"adventures on foot.\" \r\nIngress transforms the real world into the landscape for a global game of mystery, intrigue, and competition. Move through the real world using your Android device and the Ingress app to discover and tap sources of this mysterious energy. Acquire objects to aid in your quest, deploy tech to capture territory, and ally with other players to advance the cause of the Enlightened or the Resistance.",
   "title": "Ingress - Niantic Labs",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3686678E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Ingress.png",
   "location": "Cloud Platform Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "478866776"
  },
  {
   "description": "MongoLab is a fully-managed MongoDB Database-as-a-Service (DBaaS) platform that automates the operational aspects of running MongoDB in the cloud.",
   "title": "MongoLab",
   "startTimestamp": 1.3688064E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/mongolab.png",
   "location": "Cloud Platform Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "478925652"
  },
  {
   "description": "ATLAS is a particle physics experiment at the Large Hadron Collider at CERN. The ATLAS detector is searching for new discoveries in the head-on collisions of protons of extraordinarily high energy. ATLAS will learn about the basic forces that have shaped our Universe since the beginning of time and that will determine its fate. Among the possible unknowns are the origin of mass, extra dimensions of space, unification of fundamental forces, and evidence for dark matter candidates in the Universe.\r\nWe will describe a project initiated by the ATLAS Experiment on Google Compute Engine in order to utilize cloud resources in scientific computing. We will present several examples of large-scale high performance computing clusters deployed by ATLAS on GCE.",
   "title": "Brookhaven National Lab",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.368666E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Brookhaven.png",
   "location": "Cloud Platform Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "478953142"
  },
  {
   "description": "Zencoder is the performance leader in cloud-based encoding for video files and live streams. Zencoder is part of the Brightcove family of cloud content services. \r\nThe Zencoder API allows content providers to transcode and quickly deploy Internet video on virtually any Internet-connected device.",
   "title": "Zencoder, A Brightcove Service",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/zencoder.png",
   "location": "Cloud Platform Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "478953143"
  },
  {
   "description": "The worldwide pioneer in the creation of interactive entertainment, Nintendo Co Ltd manufactures & markets hardware & software for its Wii U™ & Wii™ home consoles, & Nintendo 3DS™ & Nintendo DS™ families of portable systems. Subsidiary Nintendo of America Inc, based in Redmond WA, serves as headquarters for Nintendo in the Western Hemisphere.\r\nNintendo Web Framework is a development environment based on WebKit technologies, supporting application development on the Wii U system using HTML5, JavaScript, and CSS. ",
   "title": "Nintendo of America Inc.",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Nintendo.png",
   "location": "Maps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "478989911"
  },
  {
   "description": "JetBrains is a software development company that's crazy-passionate about developer productivity. Our tools automate your routine tasks and help you effectively solve the challenging ones. \r\nWebStorm is a lightweight and intelligent IDE for server-side JavaScript and front-end Web development, with support for sourcemaps-based debugging, live reloading of edits and Dart.",
   "title": "JetBrains",
   "startTimestamp": 1.36872E9,
   "endTimestamp": 1.3687524E9,
   "iconUrl": "/apps/images/io_2013/sandbox/JetBrains.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479035424"
  },
  {
   "description": "Nafundi is a technology company with expertise in creating software for challenging environments (e.g., rural Kenya, war-torn Afghanistan, and post-hurricane New Jersey). \r\nOpen Data Kit replaces paper forms with smart forms on smartphones. It's great for mobile workers who must collect data quickly, accurately, and at scale.  ",
   "title": "Nafundi",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3687524E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Nafundi.png",
   "location": "Develop for Good Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479035738"
  },
  {
   "description": "UberConference is part of Firespotter Labs, a San Francisco based telecom incubator funded by Google Ventures and Andreessen Horowitz. \r\nUberConference fixes the pain of conference calls by adding a visual interface that lets people see who is on a call, who is talking and more.",
   "title": "UberConference",
   "startTimestamp": 1.36872E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/uberconference.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479037682"
  },
  {
   "description": "Underwater Earth - promoting and protecting the oceans of the world. We are the team taking Street View underwater www.http://maps.google.com/help/maps/streetview/gallery/ocean/ \r\nThe Catlin Seaview Survey - developing the technology to record our oceans and reveal them to the world in collaboration with Google.",
   "title": "Underwater Earth",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/UnderwaterEarth.png",
   "location": "Maps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479053667"
  },
  {
   "description": "Map of Life is a collaborative academic effort to aggregate species distribution data and provide a platform for the community to build upon this knowledge. \r\nA new analysis feature in the Map of Life leverages Google's Earth Engine to refine species range maps to known habitat preferences and elevation ranges.",
   "title": "Map of Life",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3687524E9,
   "iconUrl": "/apps/images/io_2013/sandbox/MapOfLife.png",
   "location": "Develop for Good Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479054848"
  },
  {
   "description": "Leap Motion is dedicated to changing the way the world interacts with technology by making it remarkably natural. Just like real life.\r\nThe Leap Motion Controller is a remarkably accurate, incredibly natural way to interact with your computer just by using your hands and fingers.",
   "title": "Leap Motion",
   "startTimestamp": 1.3688064E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/LeapMotion.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479075210"
  },
  {
   "description": "Leanplum is a platform for optimizing mission-critical metrics of mobile apps. We make it easy to conduct on-the-fly A/B tests and see results with powerful analytics.\r\nWe support iOS, Android, and HTML 5 apps, and allow you to continuously deploy changes and tests to your mobile app.",
   "title": "Leanplum",
   "startTimestamp": 1.3688064E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Leanplum.png",
   "location": "Cloud Platform Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479084934"
  },
  {
   "description": "FT Labs is an emerging web technologies team at the Financial Times. \r\nThe FT web app and Economist HTML5 powered apps represent some of the most advanced thinking in web engineering for the publishing industry, featuring offline reading, audio description, advanced typography and layout and many other innovations on the urging edge of web technologies.",
   "title": "FT Labs",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3687524E9,
   "iconUrl": "/apps/images/io_2013/sandbox/FTLabs.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479106803"
  },
  {
   "description": "Dart is an easy to learn, class-based, object-oriented language for building structured modern web applications.",
   "title": "Dart",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3687524E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Dart.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479110926"
  },
  {
   "description": "Capella develops both a software-based live streaming encoder and file-based transcoder. We are committed to listening to our customers and delivering products that exceed their expectations. \r\nThe Cambria Live Series is a set of three software-based production tools that enable and enhance professional live streaming broadcast production.",
   "title": "Capella Systems",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Capella.png",
   "location": "YouTube Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479121365"
  },
  {
   "description": "The World Resources Institute (WRI) is an independent, non-partisan organization that focuses on the intersection of the environment and socio-economic development. \r\nGlobal Forest Watch 2.0 is a near real-time forest monitoring system that unites satellite technology, data sharing, and human networks around the world to fight deforestation.",
   "title": "World Resources Institute",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3687524E9,
   "iconUrl": "/apps/images/io_2013/sandbox/WorldResourcesInstitute.png",
   "location": "Develop for Good Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479127401"
  },
  {
   "description": "Tableau helps people see and understand data. Its award-winning software delivers fast analytics, visualization and rapid-fire business intelligence on data of any size, format, or subject. The result? Anyone can get answers from data quickly, no programming required. \r\nFrom executive dashboards to ad-hoc reports, Tableau lets you share mobile and browser-based, interactive analytics in a few clicks. With Tableau, business users get what they need and IT saves time and money.",
   "title": "Tableau Software",
   "startTimestamp": 1.36872E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Tableau.png",
   "location": "Cloud Platform Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479133134"
  },
  {
   "description": "Khan Academy is a not-for-profit with the goal of changing education for the better by providing a free world-class education for anyone anywhere. \r\nStudents can use Khan Academy's extensive video library, interactive challenges, and assessments from any device. Coaches, parents, and teachers have unprecedented visibility into what their students are learning.",
   "title": "Khan Academy",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Khan.png",
   "location": "Cloud Platform Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479164476"
  },
  {
   "description": "Adobe is the global leader in digital marketing and digital media solutions. Our tools and services allow our customers to create and deploy groundbreaking digital content. \r\nEdge Tools & Services is a set of offerings for web designers and developers looking to create beautiful mobile-ready content and apps with HTML, CSS, and JavaScript.",
   "title": "Adobe Systems, Incorporated",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3687524E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Adobe.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479175444"
  },
  {
   "description": "Mediastudio brings Hollywood-quality production and post-production to the YouTube generation. Mediastudio's mission is to simplify quality media production and make it accessible and scalable.\r\nMediastudio offers a platform with web-based tools, management workflow and marketplace that allows media creators and clients to efficiently connect, collaborate and create great content.",
   "title": "Mediastudio",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Mediastudio.png",
   "location": "YouTube Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479182854"
  },
  {
   "description": "Pocket is the leading save-for-later service. \r\nPocket lets you save content you discover from your browser or favorite apps into a beautiful universal list accessible from your phone, tablet and computer. \r\nPlease note: We will be in the Chrome & Apps Developer Sandbox Day 1 and Day 3, *not* Day 2.",
   "title": "Pocket",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Pocket.png",
   "location": "Chrome & Apps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479191040"
  },
  {
   "description": "The Johns Hopkins University Applied Physics Laboratory (APL) is a not-for-profit center for engineering, research, and development.\r\nOSPREY is a suite of programs for computational structure-based protein design now running in Google Compute Engine.",
   "title": "The Johns Hopkins University Applied Physics Laboratory",
   "startTimestamp": 1.3688064E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/JHAPL.png",
   "location": "Cloud Platform Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479192500"
  },
  {
   "description": "Experience the best of both worlds with our streaming library of hits and discs at the kiosk with Redbox Instant by Verizon.  Start a free one-month trial with subscription. Sign up now at www.redboxinstant.com.\r\n\r\nPlease note: We will be in the Google TV Developer Sandbox Day 1 and Day 3, *not* Day 2. ",
   "title": "Redbox Instant by Verizon",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Redbox.png",
   "location": "Google TV Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479206911"
  },
  {
   "description": "Freelance developer working with Google GIS technologies for outreach partners.\r\nExample work:\r\nhttp://earth.tryse.net/\r\nhttp://maps.eyesontheforest.or.id/\r\nhttp://mapas.fas-amazonas.org/\r\nhttp://kmlfactbook.org/",
   "title": "tryse.net",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Tryse.png",
   "location": "Develop for Good Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479209413"
  },
  {
   "description": "Ubitus Inc., the technology leader in deploying cloud-enabled rich media services, provides re-usable and scalable turnkey solutions to carriers, OEMs and CPs globally.\r\nUbitus provides the world's most scalable cloud gaming solutions, as well as appliances for application streaming and multi-way n-screen live video/3D fetching, editing, transcoding and delivery.",
   "title": "Ubitus Inc.",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3687524E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Ubitus.png",
   "location": "Google TV Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479209900"
  },
  {
   "description": "The Sunlight Foundation is a nonprofit, nonpartisan organization that uses the power of the internet to catalyze greater government openness and transparency. \r\nCongress for Android is a fast and free way to access real-time information about Congress on your phone.",
   "title": "Sunlight Foundation",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/SunlightFoundation.png",
   "location": "Develop for Good Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479237232"
  },
  {
   "description": "MapR delivers on the promise of Hadoop with a proven, enterprise-grade Big Data platform that supports a broad set of mission-critical and real-time production uses.\r\nDynamo is a messaging platform that activates client data for targeted, consistent, cross- channel messaging. Dynamo runs MapR’s distribution for Hadoop leveraging Google Compute Engine.",
   "title": "MapR Technologies",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3687524E9,
   "iconUrl": "/apps/images/io_2013/sandbox/MapR.png",
   "location": "Cloud Platform Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479310450"
  },
  {
   "description": "FreshPlanet makes fun mobile social games and apps for smart people, reaching over 100M users with a 20-person team in New York City. \r\nSongPop - the #1 cross-platform social game of 2012 - where you can challenge friends to see who's the biggest music fan ",
   "title": "FreshPlanet",
   "startTimestamp": 1.36872E9,
   "endTimestamp": 1.3687524E9,
   "iconUrl": "/apps/images/io_2013/sandbox/FreshPlanet.png",
   "location": "Cloud Platform Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479311829"
  },
  {
   "description": "Grameen Foundation is a global organization fighting against poverty by providing the poor with access to actionable information, appropriate financial services and unique business opportunities. \r\nWe will demo a set of Android-based mobile data collection and poverty outreach applications.",
   "title": "Grameen Foundation",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.368666E9,
   "iconUrl": "/apps/images/io_2013/sandbox/GrameenFoundation.png",
   "location": "Develop for Good Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479318559"
  },
  {
   "description": "End Point specializes in Google Liquid Galaxy development and support as well as consulting using other Open Source systems and tools. Liquid Galaxy is a remarkably compelling panoramic display system. Applications running on it include Google Earth, Google Maps, panoramic imagery viewers and more.",
   "title": "End Point Corporation",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Endpoint.png",
   "location": "Maps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479358766"
  },
  {
   "description": "Codenvy is the cloud development environment for coding, building, and testing applications.  Cloud-powered workspaces, multi-core compilation, continuous deployment, pair programming, on-demand IDEs.",
   "title": "Codenvy",
   "startTimestamp": 1.36872E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Codenvy.png",
   "location": "Cloud Platform Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479361265"
  },
  {
   "description": "Leap Motion is dedicated to changing the way the world interacts with technology by making it remarkably natural. Just like real life.",
   "title": "Leap Motion",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/LeapMotion.png",
   "location": "Maps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479414680"
  },
  {
   "description": "Benetech is a different kind of tech company—a nonprofit—with a pure focus on developing technology for the social good. \r\nMartus is a secure information management system for human rights organizations.",
   "title": "Benetech",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3687524E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Benetech.png",
   "location": "Develop for Good Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479427189"
  },
  {
   "description": "RightScale is the leader in cloud management for public and private clouds.  Millions of servers have been launched with RightScale by organizations including CBS, A&E and Zynga. \r\nRightScale® Cloud Management Platform enables organizations to easily deploy, scale and manage business-critical applications within Google Compute Engine. ",
   "title": "RightScale",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/RightScale.png",
   "location": "Cloud Platform Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479437034"
  },
  {
   "description": "The Task Force for Global Health (The Task Force) is a not-for-profit, public health organization with a 28-year history of using collaboration to improve the lives and health of millions of people around the world. The Task Force works with partners across sectors, disciplines, and communities. The Task Force brings people together to improve the way health information is used and to apply resources efficiently to address global health challenges. \r\nLINKS is a modified version of the Open Data Kit Android based application.",
   "title": "The Task Force for Global Health",
   "startTimestamp": 1.36872E9,
   "endTimestamp": 1.3687524E9,
   "iconUrl": "/apps/images/io_2013/sandbox/TaskForceForGlobalHealth.png",
   "location": "Develop for Good Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479450496"
  },
  {
   "description": "Red Hat, Inc. is an American multinational software company that is engaged in providing open-source software products to the enterprise community.\r\nJBoss CapeDwarf is an implementation of the Google App Engine API, which allows applications to be deployed on JBoss Application Servers without modification. Behind the scenes, CapeDwarf uses existing JBoss APIs such as Infinispan, JGroups, PicketLink, HornetQ and others.",
   "title": "Red Hat Inc",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3686678E9,
   "iconUrl": "/apps/images/io_2013/sandbox/RedHat.png",
   "location": "Cloud Platform Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479457076"
  },
  {
   "description": "“Woowa Bros.” is a mobile start-up company in South Korea founded by Bon-jin Kim, “the dreamy-designer” and Kwan-Soo Kim, “the magical-engineer” (Yes, they are brothers).\r\n“Baedal Minjok” is a GPS-based mobile application that lets you search for the nearby restaurants for food delivery. ",
   "title": "Woowa brothers",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/WoowaBrothers.png",
   "location": "YouTube Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479474103"
  },
  {
   "description": "Mercedes-Benz Research & Development North America, Inc. (MBRDNA) was founded in 1994 and builds on a long-standing tradition of engineering expertise and a strong commitment to innovation and ingenuity to help develop safe, sustainable and technologically advanced vehicles. \r\nMercedes-Benz Digital DriveStyle is a smartphone-powered navigation and entertainment app that lets you continue your digital lifestyle in your car.",
   "title": "Mercedes-Benz Research & Development North America, Inc.",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/MercedesBenz.png",
   "location": "Maps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479489103"
  },
  {
   "description": "TuneIn is the leading service for listening to music, sports and news from around the world, with 70,000 radio stations streaming from every continent.",
   "title": "TuneIn",
   "startTimestamp": 1.36872E9,
   "endTimestamp": 1.3687524E9,
   "iconUrl": "/apps/images/io_2013/sandbox/TuneIn.png",
   "location": "Google TV Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479493006"
  },
  {
   "description": "We are an independent digital creative agency in Portland, Oregon that combines design thinking and technical craft. We conceive, design and produce digital content and integrated experiences for web, mobile and the physical world. \r\nWe created an interactive installation that will engage developers through the magic and future of the Google Maps API.",
   "title": "Instrument",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Instrument.png",
   "location": "Maps Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "479496096"
  },
  {
   "title": "Keynote",
   "startTimestamp": 1.3686336E9,
   "youtubeUrl": "XclVwJP5GdM",
   "id": "480302417",
   "subtype": "KEYNOTE",
   "location": "Room 12",
   "isLivestream": true,
   "endTimestamp": 1.3686444E9
  },
  {
   "description": "Apps4Android, Inc., a subsidiary of IDEAL Group, is the world's largest developer of Android accessibility applications with more than seven million installations in 150 countries. \r\nApps4Android develops a wide range of Android accessibility applications designed to accommodate the mobile access needs of individuals with disabilities... and everyone else!",
   "title": "Apps4Android, Inc.",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Apps4Android.png",
   "location": "Accessibility Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "484524953"
  },
  {
   "description": "This code lab will take developers into an end-to-end integration, in which everyone leaves with a working cross-platform Google+ Sign-In integration.",
   "title": "From Zero to Hero: Integrating Google+ Sign-In on Android and Web in Less Than Three Hours",
   "startTimestamp": 1.3688145E9,
   "presenterIds": [
    "107377191681802669866",
    "109074716522478685421"
   ],
   "endTimestamp": 1.3688217E9,
   "subtype": "CODE_LAB",
   "location": "Room 4",
   "isLivestream": false,
   "id": "485576147"
  },
  {
   "description": "Benetech is a different kind of tech company—a nonprofit—with a pure focus on developing technology for the social good. \r\nBookshare is an online library for the blind and others with print disabilities.",
   "title": "Benetech",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/Benetech.png",
   "location": "Accessibility Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "486148272"
  },
  {
   "title": "Discovering opportunities with Kratu",
   "startTimestamp": 1.368657E9,
   "presenterIds": [
    "115674558611899573873"
   ],
   "id": "496343427",
   "subtype": "OFFICE_HOURS",
   "location": "Ads Sandbox",
   "isLivestream": false,
   "endTimestamp": 1.3686579E9
  },
  {
   "description": "with Jeremy Malczyk from Map of Life",
   "title": "Managing Global Species Range Data",
   "startTimestamp": 1.3686498E9,
   "endTimestamp": 1.3686552E9,
   "subtype": "OFFICE_HOURS",
   "location": "Develop for Good Sandbox",
   "isLivestream": false,
   "id": "511206538"
  },
  {
   "description": "An independent software company passionate about mobile and embedded applications, developer tools and open source.",
   "title": "readyState Software Ltd",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/readyState.png",
   "location": "Android Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "512078808"
  },
  {
   "description": "APX Labs started solving mission critical augmented reality use cases for the United States military. Their experience improving mission effectiveness and keeping soldiers safe has been the springboard to addressing some of the toughest problems in commercial, entertainment, industrial and medical markets. APX Labs partnered with Epson to help develop the software for the Moverio BT-100. The Moverio BT-100 is an Android based pair of smart glasses. The dual-screen, transparent display enables 3D content to be rendered in one's actual environment.",
   "title": "APX Labs",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/APXLabs.png",
   "location": "YouTube Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "512480394"
  },
  {
   "description": "Please check back soon for partners in the Google+ Sandbox.",
   "title": "Google+ Partners",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/PlaceholderPlus.png",
   "location": "Google+ Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "516485859"
  },
  {
   "description": "Come visit Googler experts in the Ads Sandbox!",
   "title": "Ads Googlers ",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/PlaceholderAds.png",
   "location": "Ads Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "517101658"
  },
  {
   "description": "Please check back soon for partners in the Glass Sandbox.",
   "title": "Glass Partners",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/PlaceholderGlass.png",
   "location": "Glass Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "517125737"
  },
  {
   "description": "Come visit members of our global developer community in the Google Developer Groups Lounge!",
   "title": "Google Developer Groups",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/PlaceholderGDG.png",
   "location": "Google Developer Groups Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "517267352"
  },
  {
   "description": "Come visit Googler experts in the Search and Knowledge Graph Sandbox!",
   "title": "Search and Knowledge Graph Googlers",
   "startTimestamp": 1.3686444E9,
   "endTimestamp": 1.3688316E9,
   "iconUrl": "/apps/images/io_2013/sandbox/PlaceholderSearch.png",
   "location": "Search and Knowledge Graph Sandbox",
   "subtype": "DEVELOPER_SANDBOX",
   "isLivestream": false,
   "id": "517329183"
  }
 ],
 "kind": "googledevelopers#sessionsItem",
 "etag": "\"osyxKcbM5ip0ctwDSYkRLORXcUo/yGQ5LTk-TDzmactpsrhDg2XAgvc\""
}
